{
  "headers": [],
  "rows": [
    [
      "Type of value",
      "Notes"
    ],
    [
      "Field",
      "A column in an object that is the data source of the current page. For example, the data source of theAccountssection record page is the \"Account\" object. You can select columns of the linked objects (e.g., use the data of the account’s primary contact)."
    ],
    [
      "System setting",
      "A system setting, that in this context is treated as a field with a certain value. Be sure to specify the system setting code (as opposed to its localizable title). You will need to specify the system setting code manually. The list of system settings is available in aseparate article.Business rules work only with system settings that haveCachedcheckbox selected."
    ],
    [
      "System variable",
      "A system variable that in this context is treated as a field with a certain value that changes dynamically. For example, the \"Current Date\" variable is a \"Date\" type field that always contains the current date.Available system variables:\"Current Time\"\"Current Date\"\"Current Time and Date\"\"Current user\" (the current user account, stored in the SysAdminUnit object)\"Current user contact\" (the contact specified on the current user’s page in theSystem userssection)\"Current user account\""
    ],
    [
      "Attribute",
      "The attribute value (for example, a virtual column). This option is intended for developer customization and requires development tools."
    ],
    [
      "Constant",
      "A static value of the following types: text, integer, decimal, date and time, date, time, lookup, Boolean. Use constants to match field values, system settings, system variables and attributes against a static value. A constant can be of any of the field data types supported in the section."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Type of value</p></th><th><p>Notes</p></th></tr><tr><td><p>Field</p></td><td><p>A column in an object that is the data source of the current page. For example, the data source of the <strong>Accounts</strong> section record page is the \"Account\" object. You can select columns of the linked objects (e.g., use the data of the account’s primary contact).</p></td></tr><tr><td><p>System setting</p></td><td><p>A system setting, that in this context is treated as a field with a certain value. Be sure to specify the system setting code (as opposed to its localizable title). You will need to specify the system setting code manually. The list of system settings is available in a <a href=\"https://academy.creatio.com/documents?id=269\" rel=\"noopener noreferrer\" target=\"_blank\">separate article</a>.<br/>\n<!-- -->Business rules work only with system settings that have <strong>Cached</strong> checkbox selected.</p></td></tr><tr><td><p>System variable</p></td><td><p>A system variable that in this context is treated as a field with a certain value that changes dynamically. For example, the \"Current Date\" variable is a \"Date\" type field that always contains the current date.<br/>\n<!-- -->Available system variables:</p><ul>\n<li>\"Current Time\"</li>\n<li>\"Current Date\"</li>\n<li>\"Current Time and Date\"</li>\n<li>\"Current user\" (the current user account, stored in the SysAdminUnit object)</li>\n<li>\"Current user contact\" (the contact specified on the current user’s page in the <strong>System users</strong> section)</li>\n<li>\"Current user account\"</li>\n</ul></td></tr><tr><td><p>Attribute</p></td><td><p>The attribute value (for example, a virtual column). This option is intended for developer customization and requires development tools.</p></td></tr><tr><td><p>Constant</p></td><td><p>A static value of the following types: text, integer, decimal, date and time, date, time, lookup, Boolean. Use constants to match field values, system settings, system variables and attributes against a static value. A constant can be of any of the field data types supported in the section.</p></td></tr></tbody></table>"
}