{
  "headers": [],
  "rows": [
    [
      "SubStringOf",
      "Determines whether the string passed as a parameter is a substring of thepropertyproperty."
    ],
    [
      "ToUpper",
      "Changes the column value specified in thepropertyproperty to uppercase."
    ],
    [
      "EndsWith",
      "Verifies whether the value specified in thepropertyproperty ends with a value passed as parameter."
    ],
    [
      "StartsWith",
      "Verifies whether the value specified in thepropertyproperty starts with a value passed as parameter."
    ],
    [
      "Year",
      "Returns year based on thepropertyproperty value."
    ],
    [
      "Month",
      "Returns month based on thepropertyproperty value."
    ],
    [
      "Day",
      "Returns day based on thepropertyproperty value."
    ],
    [
      "In",
      "Verifies if thepropertyproperty value is within the value range passed as the method parameter."
    ],
    [
      "NotIn",
      "Verifies if thepropertyproperty value is outside the value range passed as the method parameter."
    ],
    [
      "Like",
      "Determines if thepropertyproperty value matches the specified template."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>SubStringOf</p></td><td><p>Determines whether the string passed as a parameter is a substring of the <code>property</code> property.</p></td></tr><tr><td><p>ToUpper</p></td><td><p>Changes the column value specified in the <code>property</code> property to uppercase.</p></td></tr><tr><td><p>EndsWith</p></td><td><p>Verifies whether the value specified in the <code>property</code> property ends with a value passed as parameter.</p></td></tr><tr><td><p>StartsWith</p></td><td><p>Verifies whether the value specified in the <code>property</code> property starts with a value passed as parameter.</p></td></tr><tr><td><p>Year</p></td><td><p>Returns year based on the <code>property</code> property value.</p></td></tr><tr><td><p>Month</p></td><td><p>Returns month based on the <code>property</code> property value.</p></td></tr><tr><td><p>Day</p></td><td><p>Returns day based on the <code>property</code> property value.</p></td></tr><tr><td><p>In</p></td><td><p>Verifies if the <code>property</code> property value is within the value range passed as the method parameter.</p></td></tr><tr><td><p>NotIn</p></td><td><p>Verifies if the <code>property</code> property value is outside the value range passed as the method parameter.</p></td></tr><tr><td><p>Like</p></td><td><p>Determines if the <code>property</code> property value matches the specified template.</p></td></tr></tbody></table>"
}