{
  "headers": [],
  "rows": [
    [
      "Parameter",
      "Description"
    ],
    [
      "-workspaceName",
      "The workspace name. Set toDefaultby default."
    ],
    [
      "-destinationPath",
      "The directory to which to generate the static content."
    ],
    [
      "-webApplicationPath",
      "Path to the web application from which to read the information about the connection to the database. Optional. If you do not specify a value, Creatio will establish a connection to the database specified in the connection string of theTerrasoft.Tools.WorkspaceConsole.configfile. If you specify a value, Creatio will establish the connection to the database from theConnectionStrings.configfile of the web application."
    ],
    [
      "-force",
      "Optional. Set tofalseby default. If you leave the value as is, Creatio will generate the file contents only for modified schemas. If you set the value totrue, Creatio will generate the content for all schemas."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Parameter</p></th><th><p>Description</p></th></tr><tr><th><p><code>-workspaceName</code></p></th><td><p>The workspace name. Set to <code>Default</code> by default.</p></td></tr><tr><th><p><code>-destinationPath</code></p></th><td><p>The directory to which to generate the static content.</p></td></tr><tr><th><p><code>-webApplicationPath</code></p></th><td><p>Path to the web application from which to read the information about the connection to the database. Optional. If you do not specify a value, Creatio will establish a connection to the database specified in the connection string of the <code>Terrasoft.Tools.WorkspaceConsole.config</code> file. If you specify a value, Creatio will establish the connection to the database from the <code>ConnectionStrings.config</code> file of the web application.</p></td></tr><tr><th><p><code>-force</code></p></th><td><p>Optional. Set to <code>false</code> by default. If you leave the value as is, Creatio will generate the file contents only for modified schemas. If you set the value to <code>true</code>, Creatio will generate the content for all schemas.</p></td></tr></tbody></table>"
}