{
  "headers": [],
  "rows": [
    [
      "Successful deliveries",
      "The number of delivered emails. Indicates the total number of recipients, whose mail provider response is \"Accepted by the server.\" You can display this metric in the list using theDeliveredcolumn."
    ],
    [
      "Unique opens",
      "The number of times emails were opened. The indicators are calculated based on opens by unique recipients. For example, if a recipient opens an email several times, the indicators will show only one \"open.\" These indicators account for cases when no information about opening the email was received from the recipient, but information about clicked links, unsubscription or flagging the email as spam exists. The metric can be displayed in the list using theNo. of opensandOpens, %columns."
    ],
    [
      "Unique clicks",
      "The number of emails where recipients followed links in the message text and its percentage to the number of delivered emails. The indicators are calculated based on clicks by unique recipients. For example, if a recipient follows the same link in the same email multiple times, this will still count as a single click. Clicking the \"unsubscribe\" link does not count as a \"click\" in this metric. The metric can be displayed in the list using theNumber of clicksandClicks, %columns."
    ],
    [
      "Unsubscribes",
      "The number of unsubscribed recipients. The metric can be displayed in the list using theNo. of unsubscribesandUnsubscribe rate, %columns."
    ],
    [
      "Spam",
      "The number of times the emails were sent to spam. Only manual spam flagging will be calculated. The metric can be displayed in the list using theNo. of spam complaintsandSpam rate, %columns."
    ],
    [
      "Audience",
      "The number of contacts added to the email audience. The widget is based on the data of theAudiencetab."
    ],
    [
      "Stopped & cancelled",
      "The number of emails that were not sent to the audience due to various reasons."
    ],
    [
      "Errors",
      "The total number of undelivered emails. The widget is based on records that received the following responses: \"Canceled,\" \"Invalid email address,\" \"Delivery error,\" \"Soft Bounce,\" \"Hard Bounce,\" \"Canceled (unsubscribed from all emails),\" \"Canceled (invalid email),\" \"Canceled (incorrect email)\" and \"Canceled (email not provided).\" The records are available on theAudience tab."
    ],
    [
      "Hard bounces",
      "The number of delivery errors that have a \"Hard Bounce\" response."
    ],
    [
      "Soft bounces",
      "The number of delivery errors that have a \"Soft Bounce\" response."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Successful deliveries</p></td><td><p>The number of delivered emails. Indicates the total number of recipients, whose mail provider response is \"Accepted by the server.\" You can display this metric in the list using the <strong>Delivered</strong> column.</p></td></tr><tr><td><p>Unique opens</p></td><td><p>The number of times emails were opened. The indicators are calculated based on opens by unique recipients. For example, if a recipient opens an email several times, the indicators will show only one \"open.\" These indicators account for cases when no information about opening the email was received from the recipient, but information about clicked links, unsubscription or flagging the email as spam exists. The metric can be displayed in the list using the <strong>No. of opens</strong> and <strong>Opens, %</strong> columns.</p></td></tr><tr><td><p>Unique clicks</p></td><td><p>The number of emails where recipients followed links in the message text and its percentage to the number of delivered emails. The indicators are calculated based on clicks by unique recipients. For example, if a recipient follows the same link in the same email multiple times, this will still count as a single click. Clicking the \"unsubscribe\" link does not count as a \"click\" in this metric. The metric can be displayed in the list using the <strong>Number of clicks</strong> and <strong>Clicks, %</strong> columns.</p></td></tr><tr><td><p>Unsubscribes</p></td><td><p>The number of unsubscribed recipients. The metric can be displayed in the list using the <strong>No. of unsubscribes</strong> and <strong>Unsubscribe rate, %</strong> columns.</p></td></tr><tr><td><p>Spam</p></td><td><p>The number of times the emails were sent to spam. Only manual spam flagging will be calculated. The metric can be displayed in the list using the <strong>No. of spam complaints</strong> and <strong>Spam rate, %</strong> columns.</p></td></tr><tr><td><p>Audience</p></td><td><p>The number of contacts added to the email audience. The widget is based on the data of the <strong>Audience</strong> tab.</p></td></tr><tr><td><p>Stopped &amp; cancelled</p></td><td><p>The number of emails that were not sent to the audience due to various reasons.</p></td></tr><tr><td><p>Errors</p></td><td><p>The total number of undelivered emails. The widget is based on records that received the following responses: \"Canceled,\" \"Invalid email address,\" \"Delivery error,\" \"Soft Bounce,\" \"Hard Bounce,\" \"Canceled (unsubscribed from all emails),\" \"Canceled (invalid email),\" \"Canceled (incorrect email)\" and \"Canceled (email not provided).\" The records are available on the <strong>Audience tab</strong>.</p></td></tr><tr><td><p>Hard bounces</p></td><td><p>The number of delivery errors that have a \"Hard Bounce\" response.</p></td></tr><tr><td><p>Soft bounces</p></td><td><p>The number of delivery errors that have a \"Soft Bounce\" response.</p></td></tr></tbody></table>"
}