{
  "headers": [],
  "rows": [
    [
      "200 OK",
      "GET,PUT,MERGE, orPATCHrequest was completed successfully. The response body should contain the value of the object or properly specified in the request URL."
    ],
    [
      "201 Created",
      "POSTrequest created an object or a link successfully. The response body should contain the updated object."
    ],
    [
      "202 Accepted",
      "Processing of the data update request has started but has not finished yet. The response body should contain theLocationheaderand theRetry-Afterheader. The response body should be empty. The server should return the 303 response code with theLocationheaderthat contains the final URL that can be used to retrieve the result. The body and the header of the final URL should be formatted similar to the initial data update request."
    ],
    [
      "204 No content",
      "Data update request. The value of the requested resource is 0. The response body should be empty."
    ],
    [
      "3xx Redirection",
      "Data update request. The redirection means the client must take further actions to execute the request. The response should contain theLocationheaderwith the URL that can be used to retrieve the result."
    ],
    [
      "4xx Client Error",
      "Incorrect requests. The server returns this code in response to client errors and requests to non-existent resources, such as entities, entity collections, or properties. If the response body is defined for the error code, the error body will be as defined for the correspondingformat."
    ],
    [
      "404 Not Found",
      "The object or collection specified in the URL does not exist. The response body should be empty."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>200 OK</p></th><td><p><code>GET</code>, <code>PUT</code>, <code>MERGE</code>, or <code>PATCH</code> request was completed successfully. The response body should contain the value of the object or properly specified in the request URL.</p></td></tr><tr><th><p>201 Created</p></th><td><p><code>POST</code> request created an object or a link successfully. The response body should contain the updated object.</p></td></tr><tr><th><p>202 Accepted</p></th><td><p>Processing of the data update request has started but has not finished yet. The response body should contain the <a href=\"https://www.odata.org/documentation/odata-version-3-0/odata-version-3-0-core-protocol/#thelocationheader\" rel=\"noopener noreferrer\" target=\"_blank\"><code>Location</code> header</a> and the <a href=\"https://www.odata.org/documentation/odata-version-3-0/odata-version-3-0-core-protocol/#theretry-afterheader\" rel=\"noopener noreferrer\" target=\"_blank\"><code>Retry-After</code> header</a>. The response body should be empty. The server should return the 303 response code with the <a href=\"https://www.odata.org/documentation/odata-version-3-0/odata-version-3-0-core-protocol/#thelocationheader\" rel=\"noopener noreferrer\" target=\"_blank\"><code>Location</code> header</a> that contains the final URL that can be used to retrieve the result. The body and the header of the final URL should be formatted similar to the initial data update request.</p></td></tr><tr><th><p>204 No content</p></th><td><p>Data update request. The value of the requested resource is 0. The response body should be empty.</p></td></tr><tr><th><p>3xx Redirection</p></th><td><p>Data update request. The redirection means the client must take further actions to execute the request. The response should contain the <a href=\"https://www.odata.org/documentation/odata-version-3-0/odata-version-3-0-core-protocol/#thelocationheader\" rel=\"noopener noreferrer\" target=\"_blank\"><code>Location</code> header</a> with the URL that can be used to retrieve the result.</p></td></tr><tr><th><p>4xx Client Error</p></th><td><p>Incorrect requests. The server returns this code in response to client errors and requests to non-existent resources, such as entities, entity collections, or properties. If the response body is defined for the error code, the error body will be as defined for the corresponding <a href=\"https://www.odata.org/documentation/odata-version-3-0/odata-version-3-0-core-protocol/#formats\" rel=\"noopener noreferrer\" target=\"_blank\">format</a>.</p></td></tr><tr><th><p>404 Not Found</p></th><td><p>The object or collection specified in the URL does not exist. The response body should be empty.</p></td></tr></tbody></table>"
}