{
  "headers": [],
  "rows": [
    [
      "Which object to apply access rights to?",
      "The object that contains records for which the permissions must be updated. For example, to change access permissions to specific activities, select the \"Activity\" object, to change permissions to certain accounts, select \"Account,\" etc."
    ],
    [
      "Apply access rights to all records that match conditions",
      "Set up a filter to select records whose permissions must be modified. To change permissions for a specific record, set up a filter by theIdcolumn."
    ],
    [
      "Which access rights to remove?",
      "Specify access permissions that will berevokedon the element’s execution. Click+to add a new permission. On the element execution, the specifiedpermissions will be revokedfor the specified users and roles."
    ],
    [
      "Which access rights to add?",
      "Specify access permissions that will begrantedon the element’s execution. Click+(Fig. 2) to add a new permission. On the element execution, the specifiedpermissions will be grantedfor the specified users and roles."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p><strong>Which object to apply access rights to?</strong></p></td><td><p>The object that contains records for which the permissions must be updated. For example, to change access permissions to specific activities, select the \"Activity\" object, to change permissions to certain accounts, select \"Account,\" etc.</p></td></tr><tr><td><p><strong>Apply access rights to all records that match conditions</strong></p></td><td><p>Set up a filter to select records whose permissions must be modified. To change permissions for a specific record, set up a filter by the <strong>Id</strong> column.</p></td></tr><tr><td><p><strong>Which access rights to remove?</strong></p></td><td><p>Specify access permissions that will be <strong>revoked</strong> on the element’s execution. Click <strong>+</strong> to add a new permission. On the element execution, the specified <strong>permissions will be revoked</strong> for the specified users and roles.</p></td></tr><tr><td><p><strong>Which access rights to add?</strong></p></td><td><p>Specify access permissions that will be <strong>granted</strong> on the element’s execution. Click <strong>+</strong> (Fig. 2) to add a new permission. On the element execution, the specified <strong>permissions will be granted</strong> for the specified users and roles.</p></td></tr></tbody></table>"
}