{
  "headers": [],
  "rows": [
    [
      "Process elements",
      "BPMN naming conventions and documentation guidelines"
    ],
    [
      "Actions",
      "Anaction nameshould start with a descriptive action verb. For example, \"Call customer.\"Theaction descriptioncontains action details. For example, \"The manager calls the customer and appoints a meeting.\" The users need such descriptions to figure out what they should do to progress the business process."
    ],
    [
      "Events",
      "Constructevent namesusing an action object and a past participle of an active verb. For example, \"Employee hired.\" Use specific time-dates or specific conditions to name timer and conditional events. For example, use \"Every morning at 10 AM\" for a timer event or \"Yes,\" \"Correct\" and so on for a conditional event. Make sure that paired start and intermediate events share matching names.Anevent descriptionshould include detailed information about the event: what, how, and when it occurs. Such descriptions help users to find out if the event has happened."
    ],
    [
      "Gateways",
      "Gateway namesdepend on the gateway type. Diverging exclusive gateways (OR) normally have interrogative names phrased as closed questions. The answers to the question are used to name the outgoing conditional flows. For example, \"Does candidate qualify?\" Names are optional for other gateway types.Thegateway descriptioncovers the process branching on the respective gateway. For example, \"The process branches depending on the job qualifications of the candidate\" (exclusive gateway (OR))."
    ],
    [
      "Flows",
      "Aconditional flow nameincludes the condition that triggers the flow. Sequence flows and default flows usually have no names.Flow descriptionswill not be included in the documentation and are optional."
    ],
    [
      "Artifacts",
      "Thename of the data objectincludes the name of the business object. For example, \"Organization profile.\"Thecommentcontains additional information and can be filled in arbitrarily."
    ],
    [
      "Lanes",
      "Thelane nameshould match the role of the business process participant. In the process documentation, lanes are listed as process participants."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Process elements</p></th><th><p>BPMN naming conventions and documentation guidelines</p></th></tr><tr><td><p>Actions</p></td><td><p>An <strong>action name</strong> should start with a descriptive action verb. For example, \"Call customer.\"<br/>\n<!-- -->The <strong>action description</strong> contains action details. For example, \"The manager calls the customer and appoints a meeting.\" The users need such descriptions to figure out what they should do to progress the business process.</p></td></tr><tr><td><p>Events</p></td><td><p>Construct <strong>event names</strong> using an action object and a past participle of an active verb. For example, \"Employee hired.\" Use specific time-dates or specific conditions to name timer and conditional events. For example, use \"Every morning at 10 AM\" for a timer event or \"Yes,\" \"Correct\" and so on for a conditional event. Make sure that paired start and intermediate events share matching names.<br/>\n<!-- -->An <strong>event description</strong> should include detailed information about the event: what, how, and when it occurs. Such descriptions help users to find out if the event has happened.</p></td></tr><tr><td><p>Gateways</p></td><td><p><strong>Gateway names</strong> depend on the gateway type. Diverging exclusive gateways (OR) normally have interrogative names phrased as closed questions. The answers to the question are used to name the outgoing conditional flows. For example, \"Does candidate qualify?\" Names are optional for other gateway types.<br/>\n<!-- -->The <strong>gateway description</strong> covers the process branching on the respective gateway. For example, \"The process branches depending on the job qualifications of the candidate\" (exclusive gateway (OR)).</p></td></tr><tr><td><p>Flows</p></td><td><p>A <strong>conditional flow name</strong> includes the condition that triggers the flow. Sequence flows and default flows usually have no names.<br/>\n<strong>Flow descriptions</strong> will not be included in the documentation and are optional.</p></td></tr><tr><td><p>Artifacts</p></td><td><p>The <strong>name of the data object</strong> includes the name of the business object. For example, \"Organization profile.\"<br/>\n<!-- -->The <strong>comment</strong> contains additional information and can be filled in arbitrarily.</p></td></tr><tr><td><p>Lanes</p></td><td><p>The <strong>lane name</strong> should match the role of the business process participant. In the process documentation, lanes are listed as process participants.</p></td></tr></tbody></table>"
}