{
  "headers": [],
  "rows": [
    [
      "Execution",
      "When the incoming flow is activated, theSub-processelement activates theSimplestart eventof the process specified in theWhich process to run?field.As a result, the actual version of the sub-process is launched as a new sub-process instance.If any of the incoming and bi-directional process parameters are populated in theProcess parametersblock of theSub-processelement, the sub-process will run with those parameter values.If you save another version of the sub-process as “actual” after theSub-processelement has been launched, the element will continue executing the version that was actual at the time of theSub-processelement activation. The new sub-process version will be used on the new activation of theSub-processelement. The active instance of the sub-process version that was “actual” when theSub-processelement was launched will continue running normally.The sub-process log page, which displays the sub-process tasks on theProcess elementsdetail in the order of their execution, is available as a separate process instance in theProcess Logsectionand as a clickable process task in theProcess elementsdetail of the parent process."
    ],
    [
      "Completion",
      "TheSub-processelement is considered complete when the corresponding sub-process instance completes its execution.Upon completion, theSub-processelement updates its parameter values from the corresponding parameters of the completed sub-process instance and activates its own outgoing flows."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>Execution</p></td><td><p>When the incoming flow is activated, the <strong>Sub-process</strong> element activates the  <a href=\"https://academy.creatio.com/documents/technic-bpms/7-16/simple-start-event#HT_chapter_process_designer_elements_events_simple_start\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Simple</strong> start event</a> of the process specified in the <strong>Which process to run?</strong> field.<br/>\n<!-- -->As a result, the actual version of the sub-process is launched as a new sub-process instance.<br/>\n<!-- -->If any of the incoming and bi-directional process parameters are populated in the <strong>Process parameters</strong> block of the <strong>Sub-process</strong> element, the sub-process will run with those parameter values.<br/>\n<!-- -->If you save another version of the sub-process as “actual” after the <strong>Sub-process</strong> element has been launched, the element will continue executing the version that was actual at the time of the <strong>Sub-process</strong> element activation. The new sub-process version will be used on the new activation of the <strong>Sub-process</strong> element. The active instance of the sub-process version that was “actual” when the <strong>Sub-process</strong> element was launched will continue running normally.<br/>\n<!-- -->The sub-process log page, which displays the sub-process tasks on the <strong>Process elements</strong> detail in the order of their execution, is available as a separate process instance in the  <a href=\"https://academy.creatio.com/documents/technic-bpms/7-16/process-log-section#HT_specs_process_log\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Process Log</strong> section</a> and as a clickable process task in the <strong>Process elements</strong> detail of the parent process.</p></td></tr><tr><td><p>Completion</p></td><td><p>The <strong>Sub-process</strong> element is considered complete when the corresponding sub-process instance completes its execution.<br/>\n<!-- -->Upon completion, the <strong>Sub-process</strong> element updates its parameter values from the corresponding parameters of the completed sub-process instance and activates its own outgoing flows.</p></td></tr></tbody></table>"
}