{
  "headers": [],
  "rows": [
    [
      "LoadLicResponse",
      "Upload licenses to the database specified in the connection string. The only operation that does not require the-workspaceNameparameter."
    ],
    [
      "SaveRepositoryContent",
      "Save the *.zip package archives specified in the-contentTypesparameter from the directory specified in the-sourcePathparameter to the directory specified in the-destinationPathparameter."
    ],
    [
      "SaveDBContent",
      "Save the database content to the file system. The-contentTypesparameter determines the content type. The-destinationPathparameter determines the content export path in the file system. Requires either the-webApplicationPathor-configurationPathparameter."
    ],
    [
      "SaveVersionSvnContent",
      "Dump the package hierarchy as a set of *.zip archives. The-destinationPathparameter determines the content export path in the file system. The-sourcePathparameter specifies the SVN repositories."
    ],
    [
      "RegenerateSchemaSources",
      "Regenerate the source code and compile it. Requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "InstallFromRepository",
      "Install the package from *.zip archives into the configuration. If needed, the utility runs bound SQL scripts, regenerates source code, and installs bound data. Works exclusively with updated or new packages and their schemas. Requires either the-webApplicationPathor-configurationPathparameter. Also requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "InstallBundlePackages",
      "Install the bundle of packages listed in the-packageNamecomma-separated list to the workplace specified in the-workspaceNameparameter. Requires either the-webApplicationPathor-configurationPathparameter. Also requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "PrevalidateInstallFromRepository",
      "Check if installing packages from *.zip archives is possible."
    ],
    [
      "ConcatRepositories",
      "Merge several repositories."
    ],
    [
      "ConcatSVNRepositories",
      "Merge several SVN repositories."
    ],
    [
      "ExecuteProcess",
      "Run the business process in the configuration if the utility detects such a process. Requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "UpdatePackages",
      "Update the packages (-packageNameparameter) in the database. Only packages included in the product package hierarchy will be updated. Requires either the-webApplicationPathor-configurationPathparameter. Also requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "BuildWorkspace",
      "Compile the workplace (configuration). Use when developing schemas in Visual Studio. Learn more:Write C# code. Requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "ReBuildWorkspace",
      "Recompile the workplace (configuration). Use when developing schemas in Visual Studio. Learn more:Write C# code. Requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "UpdateWorkspaceSolution",
      "Update the solution and files of the Visual Studio project. Learn more:Write C# code."
    ],
    [
      "BuildConfiguration",
      "Generate the static content in the file system. Learn more:Set up WorkspaceConsole for compilation. Uses the following parameters:-workspaceName-destinationPath-webApplicationPath-logPath-force-configurationPathRequires either the-webApplicationPathor-configurationPathparameter."
    ],
    [
      "RestoreConfiguration",
      "Restore the configuration from the package backup. Requires theBackupConfigurationoperation to be performed. Requires the-installPackageDataand-backupPathparameters."
    ],
    [
      "UpdateConfiguration",
      "Update the configuration."
    ],
    [
      "DeletePackages",
      "Delete the packages from configuration. Requires the-packagesToDeleteparameter."
    ],
    [
      "ChangeFeatureState",
      "Change the feature status. Requires the-featureCode,-featureState,-adminUnitNameparameters."
    ],
    [
      "ExecuteScript",
      "Run out-of-the-box or custom executable code (*.dll)."
    ],
    [
      "SetFileStorageConnectionString",
      "Change the connection settings for an external file storage, for example, S3 or Azure Blob. This is useful to arrange automation, such as rotating credentials regularly. Requires the-storageCodeand-storageConnectionStringparameters."
    ],
    [
      "InstallApp",
      "Install the app from *.zip archives into the configuration. If needed, the utility runs bound SQL scripts, re-generates source code, and installs bound data. Works exclusively with updated or new packages and their schemas. Requires the-user,-password,-destinationPath,-confRuntimeParentDirectoryand-sourcePathparameters.Since version 8.3.1, Creatio applies the same validation rules as for app installation via the Application Hub.Added the following validation rules:Creatio version compatibilityMissing dependenciesMinimum required version of dependent apps"
    ],
    [
      "InstallZipPackage",
      "Install a dedicated package from *.zip archive into the configuration without generating the source code and installing dependencies. The utility runs bound SQL scripts and installs bound data. Works exclusively with updated or new packages and their schemas. Requires the-destinationPath,-confRuntimeParentDirectoryand-sourcePathparameters. Restart the application pool after executing theInstallZipPackageoperation to ensure Creatio works correctly.Since version 8.3.1, Creatio applies the same validation rules as for app installation via the Application Hub. Added the validation rule for missing dependencies."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>LoadLicResponse</p></td><td><p>Upload licenses to the database specified in the connection string. The only operation that does not require the <code>-workspaceName</code> parameter.</p></td></tr><tr><td><p>SaveRepositoryContent</p></td><td><p>Save the *.zip package archives specified in the <code>-contentTypes</code> parameter from the directory specified in the <code>-sourcePath</code> parameter to the directory specified in the <code>-destinationPath</code> parameter.</p></td></tr><tr><td><p>SaveDBContent</p></td><td><p>Save the database content to the file system. The <code>-contentTypes</code> parameter determines the content type. The <code>-destinationPath</code> parameter determines the content export path in the file system. Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter.</p></td></tr><tr><td><p>SaveVersionSvnContent</p></td><td><p>Dump the package hierarchy as a set of *.zip archives. The <code>-destinationPath</code> parameter determines the content export path in the file system. The <code>-sourcePath</code> parameter specifies the SVN repositories.</p></td></tr><tr><td><p>RegenerateSchemaSources</p></td><td><p>Regenerate the source code and compile it. Requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>InstallFromRepository</p></td><td><p>Install the package from *.zip archives into the configuration. If needed, the utility runs bound SQL scripts, regenerates source code, and installs bound data. Works exclusively with updated or new packages and their schemas. Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter. Also requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>InstallBundlePackages</p></td><td><p>Install the bundle of packages listed in the <code>-packageName</code> comma-separated list to the workplace specified in the <code>-workspaceName</code> parameter. Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter. Also requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>PrevalidateInstallFromRepository</p></td><td><p>Check if installing packages from *.zip archives is possible.</p></td></tr><tr><td><p>ConcatRepositories</p></td><td><p>Merge several repositories.</p></td></tr><tr><td><p>ConcatSVNRepositories</p></td><td><p>Merge several SVN repositories.</p></td></tr><tr><td><p>ExecuteProcess</p></td><td><p>Run the business process in the configuration if the utility detects such a process. Requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>UpdatePackages</p></td><td><p>Update the packages (<code>-packageName</code> parameter) in the database. Only packages included in the product package hierarchy will be updated. Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter. Also requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>BuildWorkspace</p></td><td><p>Compile the workplace (configuration). Use when developing schemas in Visual Studio. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.3&amp;id=15111&amp;anchor=title-2098-11\" rel=\"noopener noreferrer\" target=\"_blank\">Write C# code</a>. Requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>ReBuildWorkspace</p></td><td><p>Recompile the workplace (configuration). Use when developing schemas in Visual Studio. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.3&amp;id=15111&amp;anchor=title-2098-11\" rel=\"noopener noreferrer\" target=\"_blank\">Write C# code</a>. Requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>UpdateWorkspaceSolution</p></td><td><p>Update the solution and files of the Visual Studio project. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.3&amp;id=15111&amp;anchor=title-2098-11\" rel=\"noopener noreferrer\" target=\"_blank\">Write C# code</a>.</p></td></tr><tr><td><p>BuildConfiguration</p></td><td><p>Generate the static content in the file system. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.3&amp;id=15111&amp;anchor=title-2098-6\" rel=\"noopener noreferrer\" target=\"_blank\">Set up WorkspaceConsole for compilation</a>. Uses the following parameters:</p><ul>\n<li><code>-workspaceName</code></li>\n<li><code>-destinationPath</code></li>\n<li><code>-webApplicationPath</code></li>\n<li><code>-logPath</code></li>\n<li><code>-force</code></li>\n<li><code>-configurationPath</code></li>\n</ul><p>Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter.</p></td></tr><tr><td><p>RestoreConfiguration</p></td><td><p>Restore the configuration from the package backup. Requires the <code>BackupConfiguration</code> operation to be performed. Requires the <code>-installPackageData</code> and <code>-backupPath</code> parameters.</p></td></tr><tr><td><p>UpdateConfiguration</p></td><td><p>Update the configuration.</p></td></tr><tr><td><p>DeletePackages</p></td><td><p>Delete the packages from configuration. Requires the <code>-packagesToDelete</code> parameter.</p></td></tr><tr><td><p>ChangeFeatureState</p></td><td><p>Change the feature status. Requires the <code>-featureCode</code>, <code>-featureState</code>, <code>-adminUnitName</code> parameters.</p></td></tr><tr><td><p>ExecuteScript</p></td><td><p>Run out-of-the-box or custom executable code (*.dll).</p></td></tr><tr><td><p>SetFileStorageConnectionString</p></td><td><p>Change the connection settings for an external file storage, for example, S3 or Azure Blob. This is useful to arrange automation, such as rotating credentials regularly. Requires the <code>-storageCode</code> and <code>-storageConnectionString</code> parameters.</p></td></tr><tr><td><p>InstallApp</p></td><td><p>Install the app from *.zip archives into the configuration. If needed, the utility runs bound SQL scripts, re-generates source code, and installs bound data. Works exclusively with updated or new packages and their schemas. Requires the <code>-user</code>, <code>-password</code>, <code>-destinationPath</code>, <code>-confRuntimeParentDirectory</code> and <code>-sourcePath</code> parameters.</p><p>Since version 8.3.1, Creatio applies the same validation rules as for app installation via the Application Hub.</p><p>Added the following validation rules:</p><ul>\n<li>Creatio version compatibility</li>\n<li>Missing dependencies</li>\n<li>Minimum required version of dependent apps</li>\n</ul></td></tr><tr><td><p>InstallZipPackage</p></td><td><p>Install a dedicated package from *.zip archive into the configuration without generating the source code and installing dependencies. The utility runs bound SQL scripts and installs bound data. Works exclusively with updated or new packages and their schemas. Requires the <code>-destinationPath</code>, <code>-confRuntimeParentDirectory</code> and <code>-sourcePath</code> parameters. Restart the application pool after executing the <code>InstallZipPackage</code> operation to ensure Creatio works correctly.</p><p>Since version 8.3.1, Creatio applies the same validation rules as for app installation via the Application Hub. Added the validation rule for missing dependencies.</p></td></tr></tbody></table>"
}