{
  "headers": [],
  "rows": [
    [
      "Name",
      "Description"
    ],
    [
      "Number",
      "Define the sequence of stages in the sales pipeline. The column is hidden out of the box. You can add it manually. Learn more:Set up columns."
    ],
    [
      "Description",
      "Elaborate when to transfer the opportunity to the next stage. The column is hidden out of the box. You can add it manually. You can add it manually. Learn more:Set up columns."
    ],
    [
      "Final",
      "Select the checkbox if the stage is the last stage of the opportunity."
    ],
    [
      "Successful",
      "Select the checkbox for final stages of won opportunities. The field is non-editable if theFinalcheckbox is cleared."
    ],
    [
      "Show in funnel",
      "Select the checkbox to display the stage in the Sales Pipeline dashboard. Learn more:Sales pipeline."
    ],
    [
      "Show in progress bar",
      "Select the checkbox to display the stage in the progress bar on the opportunity page. The column is hidden out of the box. You can add it manually. Learn more:Set up columns."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Name</p></th><th><p>Description</p></th></tr><tr><td><p>Number</p></td><td><p>Define the sequence of stages in the sales pipeline. The column is hidden out of the box. You can add it manually. Learn more: <a href=\"https://academy.creatio.com/documents?id=1016#title-756-6\" rel=\"noopener noreferrer\" target=\"_blank\">Set up columns</a>.</p></td></tr><tr><td><p>Description</p></td><td><p>Elaborate when to transfer the opportunity to the next stage. The column is hidden out of the box. You can add it manually. You can add it manually. Learn more: <a href=\"https://academy.creatio.com/documents?id=1016#title-756-6\" rel=\"noopener noreferrer\" target=\"_blank\">Set up columns</a>.</p></td></tr><tr><td><p>Final</p></td><td><p>Select the checkbox if the stage is the last stage of the opportunity.</p></td></tr><tr><td><p>Successful</p></td><td><p>Select the checkbox for final stages of won opportunities. The field is non-editable if the <strong>Final</strong> checkbox is cleared.</p></td></tr><tr><td><p>Show in funnel</p></td><td><p>Select the checkbox to display the stage in the Sales Pipeline dashboard. Learn more: <a href=\"https://academy.creatio.com/documents?id=1572\" rel=\"noopener noreferrer\" target=\"_blank\">Sales pipeline</a>.</p></td></tr><tr><td><p>Show in progress bar</p></td><td><p>Select the checkbox to display the stage in the progress bar on the opportunity page. The column is hidden out of the box. You can add it manually. Learn more: <a href=\"https://academy.creatio.com/documents?id=1016#title-756-6\" rel=\"noopener noreferrer\" target=\"_blank\">Set up columns</a>.</p></td></tr></tbody></table>"
}