{
  "headers": [],
  "rows": [
    [
      "Importance",
      "Creatio populates thePriorityfield of the corresponding email activity with the value of this property."
    ],
    [
      "Ignore errors on sending",
      "If this checkbox is selected, the process will progress further even if sending errors occur. If the checkbox is not selected, and errors occur, theSend emailelement will end with an error and will not activate its outgoing flows. You can view any process-related errors in theProcess logsection."
    ],
    [
      "Run following elements in the background",
      "If the checkbox is selected, the process will run the element in the background without displaying the loading mask."
    ],
    [
      "Create an activity",
      "If the checkbox is selected, the process will create a corresponding activity when executing this process step. Selecting the checkbox will make theEmail connectionsfield group available."
    ],
    [
      "Email connections",
      "Connect the task to other Creatio entities. For example, an account. Creatio will display the task on theActivitiesdetail of the connected record. By default, the element setup area displays account and contact connections. Click thebutton to connect the task to other Creatio entities."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p><strong>Importance</strong></p></td><td><p>Creatio populates the <strong>Priority</strong> field of the corresponding email activity with the value of this property.</p></td></tr><tr><td><p><strong>Ignore errors on sending</strong></p></td><td><p>If this checkbox is selected, the process will progress further even if sending errors occur. If the checkbox is not selected, and errors occur, the <strong>Send email</strong> element will end with an error and will not activate its outgoing flows. You can view any process-related errors in the <strong>Process log</strong> section.</p></td></tr><tr><td><p><strong>Run following elements in the background</strong></p></td><td><p>If the checkbox is selected, the process will run the element in the background without displaying the loading mask.</p></td></tr><tr><td><p><strong>Create an activity</strong></p></td><td><p>If the checkbox is selected, the process will create a corresponding activity when executing this process step. Selecting the checkbox will make the <strong>Email connections</strong> field group available.</p></td></tr><tr><td><p><strong>Email connections</strong></p></td><td><p>Connect the task to other Creatio entities. For example, an account. Creatio will display the task on the <strong>Activities</strong> detail of the connected record. By default, the element setup area displays account and contact connections. Click the <img alt=\"btn_button_connections.png\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/docs/sites/en/files/images/BPM_Tools/send_email/btn_button_connections.png\"/> button to connect the task to other Creatio entities.</p></td></tr></tbody></table>"
}