{
  "headers": [],
  "rows": [
    [
      "Template message",
      "Select a template from theEmail templateslookup. Click thebutton to open the selected template in theContent Designer. You can send localized emails using multilingual templates. If you specify contacts with different languages or contacts without the preferred language in theTofield, Creatio will send the template in the default language to all recipients. Learn more:Work with message templates."
    ],
    [
      "Record for macros",
      "The record to use as a source for email template macros. For example, if the template contains macros like#Contact.Name#and#Contact.Mobile phone#, the actual name and phone number in the email will correspond to the contact specified in theRecord for macrosfield. Learn more:Process parameters.This field is linked to theMacro sourcefield in the selected email template record. For example, if you specify \"Contact\" in theMacro sourcefield, the value in theRecord for macrosfield will be a specific contact record.You can retrieve a macro source record in several ways:Map a process parameter. The parameter must have a \"Lookup\" type, and the lookup itself must correspond to the object selected in theMacro sourcefield in the email template.Select a record from a lookup.Select a system setting of a \"Lookup\" type, whose lookup corresponds to the one selected in theMacro sourcefield in the email template. For example, \"Test email recipient.\" Select \"Current user contact\" to generate macros based on the data of the user who runs the process."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p><strong>Template message</strong></p></td><td><p>Select a template from the <strong>Email templates</strong> lookup. Click the <img alt=\"\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/docs/sites/en/files/images/BPM_Tools/send_email/btn_chapter_designer_user_task_designer_task.png\"/> button to open the selected template in the <a href=\"https://academy.creatio.com/documents?id=1974\" rel=\"noopener noreferrer\" target=\"_blank\">Content Designer</a>. You can send localized emails using multilingual templates. If you specify contacts with different languages or contacts without the preferred language in the <strong>To</strong> field, Creatio will send the template in the default language to all recipients. Learn more: <a href=\"https://academy.creatio.com/documents?id=2357&amp;anchor=title-2050-10\" rel=\"noopener noreferrer\" target=\"_blank\">Work with message templates</a>.</p></td></tr><tr><td><p><strong>Record for macros</strong></p></td><td><p>The record to use as a source for email template macros. For example, if the template contains macros like <strong>#Contact.Name#</strong> and <strong>#Contact.Mobile phone#</strong>, the actual name and phone number in the email will correspond to the contact specified in the <strong>Record for macros</strong> field. Learn more: <a href=\"https://academy.creatio.com/documents?id=7054\" rel=\"noopener noreferrer\" target=\"_blank\">Process parameters</a>.</p><p>This field is linked to the <strong>Macro source</strong> field in the selected email template record. For example, if you specify \"Contact\" in the <strong>Macro source</strong> field, the value in the <strong>Record for macros</strong> field will be a specific contact record.</p><p>You can retrieve a macro source record in several ways:</p><ul>\n<li>Map a process parameter. The parameter must have a \"Lookup\" type, and the lookup itself must correspond to the object selected in the <strong>Macro source</strong> field in the email template.</li>\n<li>Select a record from a lookup.</li>\n<li>Select a system setting of a \"Lookup\" type, whose lookup corresponds to the one selected in the <strong>Macro source</strong> field in the email template. For example, \"Test email recipient.\" Select \"Current user contact\" to generate macros based on the data of the user who runs the process.</li>\n</ul></td></tr></tbody></table>"
}