{
  "headers": [],
  "rows": [
    [
      "Who performs the task?",
      "Select one of the options and fill out the field that opens:\"User\" – specify the user who will see the email edit page in theContactfield.\"Employee’s manager\" – specify the user whose manager will see the email edit page in theContactfield.\"Role\" – specify the role the users with which will see the email edit page in theRolefield.You can specify a dynamic parameter value or select a constant in the parameter value box.Once the process reaches theSend Emailelement, the email edit page will open for the user or role if theShow page automaticallycheckbox is selected. If not, the email task will be displayed on the user or role's communication panel."
    ],
    [
      "User hints",
      "A text hint for the user who performs this process task. The user can view the hint by clicking thebutton on the email page."
    ],
    [
      "Show page automatically",
      "If this checkbox is selected, the email edit page will open for the user selected in theWho is the sender?property once the process reaches theSend Emailelement.Note that if theRun following elements in the backgroundcheckbox is selected for a preceding element, the edit page will not open once the process reaches theSend email element, even if theShow page automaticallycheckbox is selected."
    ],
    [
      "Run following elements in the background",
      "If this checkbox is selected, all process elements connected to the outgoing flows will run in the background without displaying the loading mask or opening the corresponding pages."
    ],
    [
      "Email connections",
      "Use this property to connect the email to other Creatio records. Creatio will display the connected records in theConnected toblock of the email page and in the form of links on theEmailtab of the communication panel. Click thebutton to add different record types."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p><strong>Who performs the task?</strong></p></td><td><p>Select one of the options and fill out the field that opens:</p><ul>\n<li>\"User\" – specify the user who will see the email edit page in the <strong>Contact</strong> field.</li>\n<li>\"Employee’s manager\" – specify the user whose manager will see the email edit page in the <strong>Contact</strong> field.</li>\n<li>\"Role\" – specify the role the users with which will see the email edit page in the <strong>Role</strong> field.</li>\n</ul><p>You can specify a dynamic parameter value or select a constant in the parameter value box.</p><p>Once the process reaches the <strong>Send Email</strong> element, the email edit page will open for the user or role if the <strong>Show page automatically</strong> checkbox is selected. If not, the email task will be displayed on the user or role's communication panel.</p></td></tr><tr><td><p><strong>User hints</strong></p></td><td><p>A text hint for the user who performs this process task. The user can view the hint by clicking the <img alt=\"\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/docs/sites/en/files/images/BPM_Tools/send_email/btn_com_information.png\"/> button on the email page.</p></td></tr><tr><td><p><strong>Show page automatically</strong></p></td><td><p>If this checkbox is selected, the email edit page will open for the user selected in the <strong>Who is the sender?</strong> property once the process reaches the <strong>Send Email</strong> element.</p><p>Note that if the <strong>Run following elements in the background</strong> checkbox is selected for a preceding element, the edit page will not open once the process reaches the <strong>Send email element</strong>, even if the <strong>Show page automatically</strong> checkbox is selected.</p></td></tr><tr><td><p><strong>Run following elements in the background</strong></p></td><td><p>If this checkbox is selected, all process elements connected to the outgoing flows will run in the background without displaying the loading mask or opening the corresponding pages.</p></td></tr><tr><td><p><strong>Email connections</strong></p></td><td><p>Use this property to connect the email to other Creatio records. Creatio will display the connected records in the <strong>Connected to</strong> block of the email page and in the form of links on the <strong>Email</strong> tab of the communication panel. Click the <img alt=\"\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/docs/sites/en/files/images/BPM_Tools/send_email/btn_button_preconfigured_new.png\"/> button to add different record types.</p></td></tr></tbody></table>"
}