{
  "headers": [],
  "rows": [
    [
      "The object from which to read data",
      "Select a section, detail, or lookup object, whose records will be added or updated on the pre-configured page. For example, select the \"Contact\" object to set up a page where the user will be able to add or modify a contact record."
    ],
    [
      "Data source name",
      "If necessary, enter a custom name for the data source. Creatio will display this name in the Page Designer menu."
    ],
    [
      "The parameter of the page to which the current record is transferred",
      "Enter the name of thePre-configured pageelement parameter that will store the Id of the added or modified data source object's record.Select an existing parameter from the lookup or add a new parameter by entering its name. Creatio will add the corresponding field to thePage parametersmenu of the Page Designer, as well as thePage parametersblock of thePre-configured pageelement setup area.The parameter value depends on whether you need to add a new record to the data source object or modify an existing record.Leave this parameter emptyto add new recordsusing the pre-configured page. In this case, any information the user enters in the data source fields will be saved as a new record. Creatio will pass the Id of the saved record to this parameter when thePre-configured pageelement completes its execution.Map this parameter to theId of the needed recordto modify existing records. In this case, the data source fields will display the values of the selected record's fields. Modifying these values on the page will modify the corresponding record."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p><strong>The object from which to read data</strong></p></td><td><p>Select a section, detail, or lookup object, whose records will be added or updated on the pre-configured page. For example, select the \"Contact\" object to set up a page where the user will be able to add or modify a contact record.</p></td></tr><tr><td><p><strong>Data source name</strong></p></td><td><p>If necessary, enter a custom name for the data source. Creatio will display this name in the Page Designer menu.</p></td></tr><tr><td><p><strong>The parameter of the page to which the current record is transferred</strong></p></td><td><p>Enter the name of the <strong>Pre-configured page</strong> element parameter that will store the Id of the added or modified data source object's record.</p><p>Select an existing parameter from the lookup or add a new parameter by entering its name. Creatio will add the corresponding field to the <strong>Page parameters</strong> menu of the Page Designer, as well as the <strong>Page parameters</strong> block of the <strong>Pre-configured page</strong> element setup area.</p><p>The parameter value depends on whether you need to add a new record to the data source object or modify an existing record.</p><ul>\n<li>Leave this parameter empty <strong>to add new records</strong> using the pre-configured page. In this case, any information the user enters in the data source fields will be saved as a new record. Creatio will pass the Id of the saved record to this parameter when the <strong>Pre-configured page</strong> element completes its execution.</li>\n<li>Map this parameter to the <a href=\"https://academy.creatio.com/documents?id=7054\" rel=\"noopener noreferrer\" target=\"_blank\">Id of the needed record</a> <strong>to modify existing records</strong>. In this case, the data source fields will display the values of the selected record's fields. Modifying these values on the page will modify the corresponding record.</li>\n</ul></td></tr></tbody></table>"
}