{
  "headers": [],
  "rows": [
    [
      "Parameter",
      "Value",
      "Description"
    ],
    [
      "-operation",
      "BuildConfiguration",
      "Generates the static content in the file system. Requires either the-webApplicationPathor-configurationPathparameter."
    ],
    [
      "-workspaceName",
      "Workspace name",
      "The name of the workspace (configuration) where the exported packages are specified. By default, all users work in theDefaultworkspace."
    ],
    [
      "-destinationPath",
      "Path to a local directory",
      "Path to a local directory. The utility will export the *.gz package archives specified in the-sourcePathparameter to this directory."
    ],
    [
      "-webApplicationPath",
      "Path to a local directory",
      "Path to the Creatio installation directory. The utility follows this path to fetch the database connection information from theConnectionStrings.configfile. If you omit this parameter, the utility connects to the database specified in the connection string in the utility’s configuration file."
    ],
    [
      "-confRuntimeParentDirectory",
      "Path to a local directory",
      "Path to the parent directory of the..\\Terrasoft.WebApp\\confdirectory."
    ],
    [
      "-logPath",
      "Path to a local directory",
      "The utility saves the operation log file to this directory. The file name consists of the operation start date and time. Optional."
    ],
    [
      "-force",
      "trueorfalse",
      "Sets the conditions of the file content generation If set totrue, the utility generates the file content for all schemas. If set tofalse, the utility generates the file content for updated schemas. The default value isfalse. Requires either the-webApplicationPathor-configurationPathparameter."
    ],
    [
      "-configurationPath",
      "Path to a local directory",
      "Path to the..\\Terrasoft.WebApp\\Terrasoft.Configurationdirectory. The utility exports the source code and resources of user-made package schemas to this directory in thefile systemdevelopment mode."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Parameter</p></th><th><p>Value</p></th><th><p>Description</p></th></tr><tr><td><p>-operation</p></td><td><p><code>BuildConfiguration</code></p></td><td><p><a href=\"https://academy.creatio.com/documents?ver=8.2&amp;id=15126\" rel=\"noopener noreferrer\" target=\"_blank\">Generates the static content in the file system</a>. Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter.</p></td></tr><tr><td><p>-workspaceName</p></td><td><p>Workspace name</p></td><td><p>The name of the workspace (configuration) where the exported packages are specified. By default, all users work in the <code>Default</code> workspace.</p></td></tr><tr><td><p>-destinationPath</p></td><td><p>Path to a local directory</p></td><td><p>Path to a local directory. The utility will export the *.gz package archives specified in the <code>-sourcePath</code> parameter to this directory.</p></td></tr><tr><td><p>-webApplicationPath</p></td><td><p>Path to a local directory</p></td><td><p>Path to the Creatio installation directory. The utility follows this path to fetch the database connection information from the <code>ConnectionStrings.config</code> file. If you omit this parameter, the utility connects to the database specified in the connection string in the utility’s configuration file.</p></td></tr><tr><td><p>-confRuntimeParentDirectory</p></td><td><p>Path to a local directory</p></td><td><p>Path to the parent directory of the <code>..\\Terrasoft.WebApp\\conf</code> directory.</p></td></tr><tr><td><p>-logPath</p></td><td><p>Path to a local directory</p></td><td><p>The utility saves the operation log file to this directory. The file name consists of the operation start date and time. Optional.</p></td></tr><tr><td><p>-force</p></td><td><p><code>true</code> or <code>false</code></p></td><td><p>Sets the conditions of the file content generation If set to <code>true</code>, the utility generates the file content for all schemas. If set to <code>false</code>, the utility generates the file content for updated schemas. The default value is <code>false</code>. Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter.</p></td></tr><tr><td><p>-configurationPath</p></td><td><p>Path to a local directory</p></td><td><p>Path to the <code>..\\Terrasoft.WebApp\\Terrasoft.Configuration</code> directory. The utility exports the source code and resources of user-made package schemas to this directory in the <a href=\"https://academy.creatio.com/documents?ver=8.2&amp;id=15111\" rel=\"noopener noreferrer\" target=\"_blank\">file system</a> development mode.</p></td></tr></tbody></table>"
}