{
  "headers": [],
  "rows": [
    [
      "From",
      "An email account integrated with Creatio and used for sending emails. Fill out this parameter with the values from theMailbox synchronization settingslookup. There are several ways to retrieve the parameter values:Specify the email account directly by selecting it from theMailbox synchronization settingslookup.Specify a system setting that uses theMailbox synchronization settingslookup values. For example, \"Mailbox for sending email with information on approval\" (\"VisaMailboxSettings\" code).Map any other process parameter that uses theMailbox synchronization settingslookup values. Learn more:Process parameters.If the element sends the email automatically, theFromparameter is required. If the process user sends the email, the parameter is optional. The user may select an email account from the list on the email edit page."
    ],
    [
      "To",
      "The recipient's email addresses. Click thebutton to add carbon copy (Cc) and/or hidden copy (Bcc) recipients.You can populate the To/Cc/Bcc fields in several ways:Enter the emails manually (e. g.,john_best_business@yahoo.com). Click thebutton and specify other addresses to add multiple recipients manually.Select accounts/contacts from a lookup.Select system settings, whose values are email addresses. For example, \"1st-line support.\"Select the account or contact email of the user who runs the process (\"Current user account,\" \"Current user contact\").Retrieve the email from another process parameter. You can map any parameter of the \"text\" type. Note that the value of the mapped parameter must still be a valid email address, otherwise the element will not execute properly. Learn more:Process parameters.If you select either a contact or an account, Creatio will pull the email from theCommunication optionsdetail. If there are multiple emails specified for an account/contact, Creatio will use the most recent email added to the detail."
    ],
    [
      "What is the message?",
      "Select \"Custom message\" to create a unique email for the business process in theContent Designer.Select \"Template message\" to use one of the templates from theEmail templateslookup."
    ],
    [
      "How is the message sent?",
      "If you select \"Send email manually,\" the email edit page will open (or the email activity will be created) for the process user once theSend Emailelement is activated on the process diagram.If you select \"Send email automatically,\" Creatio will send the email automatically from the mailbox specified in theFromfield once theSend Emailelement is activated on the process diagram."
    ],
    [
      "Subject",
      "Enter the email subject. You can populate the field in several ways:Enter the subject manually.Map a process parameter of the \"text\" type. Learn more:Process parameters.Select a system setting of the \"text\" type.Use a formula to create a personalized subject, e. g., \"Hi, John Best!,\" where the name \"John Best\" is received from the previous process element. Learn more:Process formulas.The subject text is also displayed on theBusiness process taskstab of the communication panel. If you select a template, Creatio will populate theSubjectfield with the subject specified in the template."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p><strong>From</strong></p></td><td><p>An email account integrated with Creatio and used for sending emails. Fill out this parameter with the values from the <strong>Mailbox synchronization settings</strong> lookup. There are several ways to retrieve the parameter values:</p><ul>\n<li>Specify the email account directly by selecting it from the <strong>Mailbox synchronization settings</strong> lookup.</li>\n<li>Specify a system setting that uses the <strong>Mailbox synchronization settings</strong> lookup values. For example, \"Mailbox for sending email with information on approval\" (\"VisaMailboxSettings\" code).</li>\n<li>Map any other process parameter that uses the <strong>Mailbox synchronization settings</strong> lookup values. Learn more: <a href=\"https://academy.creatio.com/documents?id=7054\" rel=\"noopener noreferrer\" target=\"_blank\">Process parameters</a>.</li>\n</ul><p>If the element sends the email automatically, the <strong>From</strong> parameter is required. If the process user sends the email, the parameter is optional. The user may select an email account from the list on the email edit page.</p></td></tr><tr><td><p><strong>To</strong></p></td><td><p>The recipient's email addresses. Click the <img alt=\"\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/docs/sites/en/files/images/BPM_Tools/send_email/btn_button_preconfigured_new.png\"/> button to add carbon copy (Cc) and/or hidden copy (Bcc) recipients.</p><p>You can populate the To/Cc/Bcc fields in several ways:</p><ul>\n<li>Enter the emails manually (e. g., <code>john_best_business@yahoo.com</code>). Click the <img alt=\"\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/docs/sites/en/files/images/BPM_Tools/send_email/btn_button_preconfigured_new.png\"/> button and specify other addresses to add multiple recipients manually.</li>\n<li>Select accounts/contacts from a lookup.</li>\n<li>Select system settings, whose values are email addresses. For example, \"1st-line support.\"</li>\n<li>Select the account or contact email of the user who runs the process (\"Current user account,\" \"Current user contact\").</li>\n<li>Retrieve the email from another process parameter. You can map any parameter of the \"text\" type. Note that the value of the mapped parameter must still be a valid email address, otherwise the element will not execute properly. Learn more: <a href=\"https://academy.creatio.com/documents?id=7054\" rel=\"noopener noreferrer\" target=\"_blank\">Process parameters</a>.</li>\n</ul><p>If you select either a contact or an account, Creatio will pull the email from the <strong>Communication options</strong> detail. If there are multiple emails specified for an account/contact, Creatio will use the most recent email added to the detail.</p></td></tr><tr><td><p><strong>What is the message?</strong></p></td><td><p>Select \"Custom message\" to create a unique email for the business process in the <a href=\"https://academy.creatio.com/documents?id=1974\" rel=\"noopener noreferrer\" target=\"_blank\">Content Designer</a>.</p><p>Select \"Template message\" to use one of the templates from the <strong>Email templates</strong> lookup.</p></td></tr><tr><td><p><strong>How is the message sent?</strong></p></td><td><p>If you select \"Send email manually,\" the email edit page will open (or the email activity will be created) for the process user once the <strong>Send Email</strong> element is activated on the process diagram.</p><p>If you select \"Send email automatically,\" Creatio will send the email automatically from the mailbox specified in the <strong>From</strong> field once the <strong>Send Email</strong> element is activated on the process diagram.</p></td></tr><tr><td><p><strong>Subject</strong></p></td><td><p>Enter the email subject. You can populate the field in several ways:</p><ul>\n<li>Enter the subject manually.</li>\n<li>Map a process parameter of the \"text\" type. Learn more: <a href=\"https://academy.creatio.com/documents?id=7054\" rel=\"noopener noreferrer\" target=\"_blank\">Process parameters</a>.</li>\n<li>Select a system setting of the \"text\" type.</li>\n<li>Use a formula to create a personalized subject, e. g., \"Hi, John Best!,\" where the name \"John Best\" is received from the previous process element. Learn more: <a href=\"https://academy.creatio.com/documents?id=7003\" rel=\"noopener noreferrer\" target=\"_blank\">Process formulas</a>.</li>\n</ul><p>The subject text is also displayed on the <strong>Business process tasks</strong> tab of the communication panel. If you select a template, Creatio will populate the <strong>Subject</strong> field with the subject specified in the template.</p></td></tr></tbody></table>"
}