{
  "headers": [],
  "rows": [
    [
      "Parameter",
      "Parameter description"
    ],
    [
      "name*",
      "Name of the integration that Creatio and logs will use. Find the parameter value in theNamecolumn on theOAuth integrated applicationspage."
    ],
    [
      "redirectUrl",
      "Redirect URIs to receive authorization codes when authorizing integrated app. Find the parameter value in theAuthorized redirect URIsexpanded list on the integration page.API lets you specify one redirect URI in one request while adding OAuth integration. You can extend the list of redirect URIs. If you omit the parameter value, no URI is authorized to receive authorization code, and the request will be rejected. Requires theauthorization_codevalue of thegrantTypeparameter."
    ],
    [
      "applicationUrl*",
      "The URL of the external app or web service. Find the parameter value in theApplication URLcolumn on theOAuth integrated applicationspage."
    ],
    [
      "systemUserId",
      "ID of technical user created for the integration. Find the parameter value in theIdcolumn on theTechnical userspage. Requires theclient_credentialsvalue of thegrantTypeparameter."
    ],
    [
      "grant_type*",
      "OAuth 2.0 authorization type. Find the parameter value in theGrant typecolumn on theOAuth integrated applicationspage.Available valuesclient_credentialsClient credentials grant (server-to-server).authorization_codeAuthorization code grant (on behalf of a user).",
      "client_credentials",
      "Client credentials grant (server-to-server).",
      "authorization_code",
      "Authorization code grant (on behalf of a user)."
    ],
    [
      "client_credentials",
      "Client credentials grant (server-to-server)."
    ],
    [
      "authorization_code",
      "Authorization code grant (on behalf of a user)."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Parameter</p></th><th><p>Parameter description</p></th></tr><tr><td><p>name<font color=\"#FF0000\">*</font></p></td><td><p>Name of the integration that Creatio and logs will use. Find the parameter value in the <strong>Name</strong> column on the <strong>OAuth integrated applications</strong> page.</p></td></tr><tr><td><p>redirectUrl</p></td><td><p>Redirect URIs to receive authorization codes when authorizing integrated app. Find the parameter value in the <strong>Authorized redirect URIs</strong> expanded list on the integration page.</p><p>API lets you specify one redirect URI in one request while adding OAuth integration. You can extend the list of redirect URIs. If you omit the parameter value, no URI is authorized to receive authorization code, and the request will be rejected. Requires the <code>authorization_code</code> value of the <code>grantType</code> parameter.</p></td></tr><tr><td><p>applicationUrl<font color=\"#FF0000\">*</font></p></td><td><p>The URL of the external app or web service. Find the parameter value in the <strong>Application URL</strong> column on the <strong>OAuth integrated applications</strong> page.</p></td></tr><tr><td><p>systemUserId</p></td><td><p>ID of technical user created for the integration. Find the parameter value in the <strong>Id</strong> column on the <strong>Technical users</strong> page. Requires the <code>client_credentials</code> value of the <code>grantType</code> parameter.</p></td></tr><tr><td><p>grant_type<font color=\"#FF0000\">*</font></p></td><td><p>OAuth 2.0 authorization type. Find the parameter value in the <strong>Grant type</strong> column on the <strong>OAuth integrated applications</strong> page.</p><details class=\"details_lb9f isBrowser_bmU9 alert alert--info details_b_Ee\" data-collapsed=\"false\" open=\"\"><summary>Available values</summary><div style=\"display: block; overflow: visible; height: auto; will-change: height; transition: height 254ms ease-in-out;\"><div class=\"collapsibleContent_i85q\"><div><table><tbody><tr><td><p>client_credentials</p></td><td><p>Client credentials grant (server-to-server).</p></td></tr><tr><td><p>authorization_code</p></td><td><p>Authorization code grant (on behalf of a user).</p></td></tr></tbody></table></div></div></div></details></td></tr></tbody></table>"
}