{
  "headers": [],
  "rows": [
    [
      "Name",
      "Description",
      "Classes and interfaces"
    ],
    [
      "Controller",
      "Controls the copying process",
      "IHierarchyDataCopyingControllerHierarchyDataCopyingControllercontrols the copying of the database record and the connected database data."
    ],
    [
      "Obtainer",
      "Obtains the structure of the current table and connected tables from the database",
      "HierarchyDataStructureObtainerContextselects the algorithm to obtain the hierarchical structure of the table and connected tables.IHierarchyDataStructureObtainerHierarchyDataStructureObtainerobtains the hierarchical structure of the table and connected tablesBaseHierarchyDataStructureObtainerProductHierarchyDataStructureObtainerobtains the hierarchical structure of the[Product]table and connected tables."
    ],
    [
      "Container",
      "Saves the structure of the current table and connected tables",
      "HierarchyDataStructuresaves the information about the hierarchical data structure."
    ],
    [
      "Mapper",
      "Manages the structure",
      "IEntityCollectionMappingProcessorEntityCollectionMappingProcessorobtains the structure from the database and copies data."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Name</p></th><th><p>Description</p></th><th><p>Classes and interfaces</p></th></tr><tr><td><p>Controller</p></td><td><p>Controls the copying process</p></td><td><p><code>IHierarchyDataCopyingController</code> <code>HierarchyDataCopyingController</code> controls the copying of the database record and the connected database data.</p></td></tr><tr><td><p>Obtainer</p></td><td><p>Obtains the structure of the current table and connected tables from the database</p></td><td><p><code>HierarchyDataStructureObtainerContext</code> selects the algorithm to obtain the hierarchical structure of the table and connected tables.\n<code>IHierarchyDataStructureObtainer</code> <code>HierarchyDataStructureObtainer</code> obtains the hierarchical structure of the table and connected tables <code>BaseHierarchyDataStructureObtainer</code> <code>ProductHierarchyDataStructureObtainer</code> obtains the hierarchical structure of the <code>[Product]</code> table and connected tables.</p></td></tr><tr><td><p>Container</p></td><td><p>Saves the structure of the current table and connected tables</p></td><td><p><code>HierarchyDataStructure</code> saves the information about the hierarchical data structure.</p></td></tr><tr><td><p>Mapper</p></td><td><p>Manages the structure</p></td><td><p><code>IEntityCollectionMappingProcessor</code> <code>EntityCollectionMappingProcessor</code> obtains the structure from the database and copies data.</p></td></tr></tbody></table>"
}