{
  "headers": [],
  "rows": [
    [
      "Setting",
      "Description"
    ],
    [
      "\"Creatio cloud services API key\" (CloudServicesAPIKeycode) system setting",
      "Authenticate the Creatio instance in cloud services."
    ],
    [
      "ML problem types(MLProblemTypecode) lookup",
      "Address of the implemented prediction service, i. e., the lookup record that has theService endpoint Urlfield populated."
    ],
    [
      "ML model(MLModelcode) lookup",
      "Information about selected data for the model, the training period, the current training status, etc. For each model, theML problem typefield in theML model(MLModelcode) lookup includes a reference to the corresponding record in theML problem types(MLProblemTypecode) lookup."
    ],
    [
      "\"Periodicity of machine learning model training job\" (MLModelTrainingPeriodMinutescode) system setting",
      "Determine the frequency of model synchronization launch."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Setting</p></th><th><p>Description</p></th></tr><tr><td><p>\"Creatio cloud services API key\" (<code>CloudServicesAPIKey</code> code) system setting</p></td><td><p>Authenticate the Creatio instance in cloud services.</p></td></tr><tr><td><p><strong>ML problem types</strong> (<code>MLProblemType</code> code) lookup</p></td><td><p>Address of the implemented prediction service, i. e., the lookup record that has the <strong>Service endpoint Url</strong> field populated.</p></td></tr><tr><td><p><strong>ML model</strong> (<code>MLModel</code> code) lookup</p></td><td><p>Information about selected data for the model, the training period, the current training status, etc. For each model, the <strong>ML problem type</strong> field in the <strong>ML model</strong> (<code>MLModel</code> code) lookup includes a reference to the corresponding record in the <strong>ML problem types</strong> (<code>MLProblemType</code> code) lookup.</p></td></tr><tr><td><p>\"Periodicity of machine learning model training job\" (<code>MLModelTrainingPeriodMinutes</code> code) system setting</p></td><td><p>Determine the frequency of model synchronization launch.</p></td></tr></tbody></table>"
}