{
  "headers": [],
  "rows": [
    [
      "Method",
      "Description",
      "Browser"
    ],
    [
      "Google Chrome",
      "Microsoft Firefox",
      "Microsoft Edge"
    ],
    [
      "console.trace()",
      "Displays the call stack from the breakpoint and calls the method. The call stack contains file names, line numbers, and a count oftrace()method calls from the same breakpoint.",
      "+",
      "+",
      "+ (11+)"
    ],
    [
      "console.assert(expression[, object, ...])",
      "Checks the expression passed as theexpressionparameter. If the expression is invalid, the console displays the error along with the call stack (console.error()). Otherwise, it displays nothing. This ensures the code rules are followed and lets you verify that the actual results of code execution are as expected. The method lets youtest the code. If the execution result is false, an exception is thrown.",
      "+",
      "+ (28+)",
      "+"
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th rowspan=\"2\"><p>Method</p></th><th rowspan=\"2\"><p>Description</p></th><th colspan=\"3\"><p>Browser</p></th></tr><tr><th><p>Google Chrome</p></th><th><p>Microsoft Firefox</p></th><th><p>Microsoft Edge</p></th></tr><tr><th><p><code>console.trace()</code></p></th><td><p>Displays the call stack from the breakpoint and calls the method. The call stack contains file names, line numbers, and a count of <code>trace()</code> method calls from the same breakpoint.</p></td><td><p>+</p></td><td><p>+</p></td><td><p>+ (11+)</p></td></tr><tr><th><p><code>console.assert(expression[, object, ...])</code></p></th><td><p>Checks the expression passed as the <code>expression</code> parameter. If the expression is invalid, the console displays the error along with the call stack (<code>console.error()</code>). Otherwise, it displays nothing. This ensures the code rules are followed and lets you verify that the actual results of code execution are as expected. The method lets you <strong>test the code</strong>. If the execution result is false, an exception is thrown.</p></td><td><p>+</p></td><td><p>+ (28+)</p></td><td><p>+</p></td></tr></tbody></table>"
}