{
  "headers": [],
  "rows": [
    [
      "Execution",
      "When its incoming flow is activated, theSub-processelement starts looping through the data collection. For each item of the data collection, theSub-processelement runs a new instance of the process specified in theWhich process to run?field by activating theSimplestart eventof the sub-process.As a result, the currently actual version of the sub-process launches as a new sub-process instance for each item in the data collection as soon as the previous sub-process instance is complete. Read more in the “Working with collections” article.The incoming and bidirectionalsub-process parameters(specified in theProcess parametersblock of theSub-processelement) can be mapped either to process elements from the same data collection or to non-collection elements. Non-collection process parameters will be re-used in all sub-process instances.If you save another version of the sub-process as “actual” after theSub-processelement has been launched, any new sub-process instance will use the newest actual version to date. This means that the first instance of the sub-process and any other instances that ran before updating the actual version of the sub-process will use the previous version. We do not recommend saving another sub-process version as actual until all instances of the sub-process are either complete or canceled.Note that the sub-process creates a separate instance in theProcess Logsection, which displays the sub-process tasks in itsProcess elementsdetail in the order of their execution. The parent process instance displays the link to the list of sub-process instances as a regular clickable process task in its ownProcess elementsdetail."
    ],
    [
      "Completion",
      "Upon completion of all sub-process instances, the element creates an entry in the outgoing data collection and populates the entry with parameter values from the corresponding parameters of the completed sub-process instance. After that, the next sub-process instance will be launched.TheSub-processelement is considered complete when the last sub-process instance is complete. Upon completion of the last instance, theSub-processelement updates the outgoing data collection and activates its own outgoing flows. Read more in the “Working with collections” article."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>Execution</p></td><td><p>When its incoming flow is activated, the <strong>Sub-process</strong> element starts looping through the data collection. For each item of the data collection, the <strong>Sub-process</strong> element runs a new instance of the process specified in the <strong>Which process to run?</strong> field by activating the  <a href=\"https://academy.creatio.com/documents/technic-bpms/7-16/simple-start-event#HT_chapter_process_designer_elements_events_simple_start\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Simple</strong> start event</a> of the sub-process.<br/>\n<!-- -->As a result, the currently actual version of the sub-process launches as a new sub-process instance for each item in the data collection as soon as the previous sub-process instance is complete. Read more in the “<a href=\"https://academy.creatio.com/documents/technic-bpms/7-16/working-collections#XREF_43102_Working_with\" rel=\"noopener noreferrer\" target=\"_blank\">Working with collections</a>” article.<br/>\n<!-- -->The incoming and bidirectional <a href=\"https://academy.creatio.com/documents?product=bpms&amp;ver=7&amp;id=7172\" rel=\"noopener noreferrer\" target=\"_blank\">sub-process parameters</a> (specified in the <strong>Process parameters</strong> block of the <strong>Sub-process</strong> element) can be mapped either to process elements from the same data collection or to non-collection elements. Non-collection process parameters will be re-used in all sub-process instances.<br/>\n<!-- -->If you save another version of the sub-process as “actual” after the <strong>Sub-process</strong> element has been launched, any new sub-process instance will use the newest actual version to date. This means that the first instance of the sub-process and any other instances that ran before updating the actual version of the sub-process will use the previous version. We do not recommend saving another sub-process version as actual until all instances of the sub-process are either complete or canceled.<br/>\n<!-- -->Note that the sub-process creates a separate instance in the  <a href=\"https://academy.creatio.com/documents/technic-bpms/7-16/process-log-section#HT_specs_process_log\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Process Log</strong> section</a>, which displays the sub-process tasks in its <strong>Process elements</strong> detail in the order of their execution. The parent process instance displays the link to the list of sub-process instances as a regular clickable process task in its own <strong>Process elements</strong> detail.</p></td></tr><tr><td><p>Completion</p></td><td><p>Upon completion of all sub-process instances, the element creates an entry in the outgoing data collection and populates the entry with parameter values from the corresponding parameters of the completed sub-process instance. After that, the next sub-process instance will be launched.<br/>\n<!-- -->The <strong>Sub-process</strong> element is considered complete when the last sub-process instance is complete. Upon completion of the last instance, the <strong>Sub-process</strong> element updates the outgoing data collection and activates its own outgoing flows. Read more in the “<a href=\"https://academy.creatio.com/documents/technic-bpms/7-16/working-collections#XREF_43102_Working_with\" rel=\"noopener noreferrer\" target=\"_blank\">Working with collections</a>” article.</p></td></tr></tbody></table>"
}