{
  "headers": [],
  "rows": [
    [
      "Method address parameter",
      "Use these parameters as variables to generate the request method address.Enclose the parameter names in curly braces in theMethod addressfield to add them to the method address. For instance: {parameterName1}/{parameterName2}, etc.\nUpon a web service call, Creatio will replace these variables with the actual method address parameter values specified in the correspondingCall web servicebusiness process element. For instance:http://web.service.uri/parameterValue1/parameterValue2.If you do not specify the parameter value in the element properties yet fill out theDefault valuefield, Creatio will use the default value.TheRequiredcheckbox is selected and non-editable for this parameter type."
    ],
    [
      "Body parameter",
      "Creatio uses this parameter type to send data of any type (includingcollections) in the request body. Learn more about the POST request method inWikipedia.The parameter is not available for the GET method"
    ],
    [
      "Query parameter",
      "Creatio will add this parameter type to the request after the method address and the \"?\" character. Learn more about this parameter inWikipedia."
    ],
    [
      "Header parameter",
      "Creatio uses this parameter type to generate request headers. Learn more about HTTP headers inWikipedia."
    ],
    [
      "Cookies parameter",
      "Creatio uses this parameter type to pass cookie files in the requests. For example, you can pass a previously-received authentication cookie. Learn more about cookies inWikipedia."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Method address parameter</p></th><td><p>Use these parameters as variables to generate the request method address.<br/>\n<!-- -->Enclose the parameter names in curly braces in the <strong>Method address</strong> field to add them to the method address. For instance: {parameterName1}/{parameterName2}, etc.\nUpon a web service call, Creatio will replace these variables with the actual method address parameter values specified in the corresponding <a href=\"https://academy.creatio.com/documents?product=bpms&amp;ver=7&amp;id=7141\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Call web service</strong></a> business process element. For instance: <code>http://web.service.uri/parameterValue1/parameterValue2</code>.<br/>\n<!-- -->If you do not specify the parameter value in the element properties yet fill out the <strong>Default value</strong> field, Creatio will use the default value.<br/>\n<!-- -->The <strong>Required</strong> checkbox is selected and non-editable for this parameter type.</p></td></tr><tr><th><p>Body parameter</p></th><td><p>Creatio uses this parameter type to send data of any type (including <a href=\"https://academy.creatio.com#HT_chapter_web_service_integration_collection\" rel=\"noopener noreferrer\" target=\"_blank\">collections</a>) in the request body. Learn more about the POST request method in <a href=\"https://en.wikipedia.org/wiki/POST_(HTTP)\" rel=\"noopener noreferrer\" target=\"_blank\">Wikipedia</a>.<br/>\n<!-- -->The parameter is not available for the GET method</p></td></tr><tr><th><p>Query parameter</p></th><td><p>Creatio will add this parameter type to the request after the method address and the \"?\" character. Learn more about this parameter in <a href=\"https://en.wikipedia.org/wiki/Query_string\" rel=\"noopener noreferrer\" target=\"_blank\">Wikipedia</a>.</p></td></tr><tr><th><p>Header parameter</p></th><td><p>Creatio uses this parameter type to generate request headers. Learn more about HTTP headers in <a href=\"https://en.wikipedia.org/wiki/List_of_HTTP_header_fields\" rel=\"noopener noreferrer\" target=\"_blank\">Wikipedia</a>.</p></td></tr><tr><th><p>Cookies parameter</p></th><td><p>Creatio uses this parameter type to pass cookie files in the requests. For example, you can pass a previously-received authentication cookie. Learn more about cookies in <a href=\"https://en.wikipedia.org/wiki/HTTP_cookie\" rel=\"noopener noreferrer\" target=\"_blank\">Wikipedia</a>.</p></td></tr></tbody></table>"
}