{
  "headers": [],
  "rows": [
    [
      "Which process to run?",
      "Specify a business process to use as the sub-process:you can select an existing Creatio business process to use it as a sub-process from the drop-down listyou can add a new process via the Process Designer by clickingif the needed process is not available on the list– opens the process selected as a sub-process in a new Process Designer window.Note that to be eligible as a sub-process, a business process must start with aSimplestart event."
    ],
    [
      "Execution method",
      "Only available in the multi-instance mode. To enable the multi-instance mode, map at least one of the process parameters to a data collection. Read more in the “Working with collections” article.Select one of the two execution methods:Sequential. Sub-process instances run successively; a new sub-process instance runs upon completion of the previous instance. This is the default method.Parallel. Sub-process instances run simultaneously; theSub-processelement does not wait for the completion of the already running instances before running a new instance. Sub-process instances may complete in a different order."
    ],
    [
      "Process parameters",
      "When you select an existing Creatio process from the list, the parameters of the selected process are displayed in this block of theSub-processsetup area. You can populate the parameter values to run the sub-process with these values. During the execution of the sub-process, these values can be populated or updated, based on the logic of each specific sub-process. You can also map subsequent elements of the parent process to these parameters.To add/edit/delete the element parameters, modify the process selected in theWhich process to run?field.Before making any changes to a business process, which is used as a sub-process, make sure that such changes will not affect other processes. For example, if you edit the data type of a parameter and change it from the “Lookup” value to “Boolean” in a business process, this may lead to errors in any processes that use it as a sub-process.Please check theUsed as sub-process in processesdetail of theLaunch optionstabin the Process Library before modifying an existing process. If this process has any sub-processes of its own, they will be displayed in theSub-processesdetail of theSub-processestab."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>Which process to run?</p></td><td><p>Specify a business process to use as the sub-process:</p><ul>\n<li>you can select an existing Creatio business process to use it as a sub-process from the drop-down list</li>\n<li>you can add a new process via the Process Designer by clicking <img alt=\"btn_button_connections00035.png\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/sites/default/files/documents/docs_en/technic/BPMS/7.16.0/BPMonlineHelp/chapter_process_designer/btn_button_connections00035.png\"/> if the needed process is not available on the list</li>\n</ul><p><img alt=\"btn_chapter_designer_user_task_designer_task00036.png\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/sites/default/files/documents/docs_en/technic/BPMS/7.16.0/BPMonlineHelp/chapter_process_designer/btn_chapter_designer_user_task_designer_task00036.png\"/> – opens the process selected as a sub-process in a new Process Designer window.<br/>\n<!-- -->Note that to be eligible as a sub-process, a business process must start with a  <a href=\"https://academy.creatio.com/documents/technic-bpms/7-16/simple-start-event#HT_chapter_process_designer_elements_events_simple_start\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Simple</strong> start event</a>.</p></td></tr><tr><td><p>Execution method</p></td><td><p>Only available in the multi-instance mode. To enable the multi-instance mode, map at least one of the process parameters to a data collection. Read more in the “<a href=\"https://academy.creatio.com/documents/technic-bpms/7-16/working-collections#XREF_43102_Working_with\" rel=\"noopener noreferrer\" target=\"_blank\">Working with collections</a>” article.<br/>\n<!-- -->Select one of the two execution methods:</p><ul>\n<li><strong>Sequential</strong>. Sub-process instances run successively; a new sub-process instance runs upon completion of the previous instance. This is the default method.</li>\n<li><strong>Parallel</strong>. Sub-process instances run simultaneously; the <strong>Sub-process</strong> element does not wait for the completion of the already running instances before running a new instance. Sub-process instances may complete in a different order.</li>\n</ul></td></tr><tr><td><p>Process parameters</p></td><td><p>When you select an existing Creatio process from the list, the parameters of the selected process are displayed in this block of the <strong>Sub-process</strong> setup area. You can populate the parameter values to run the sub-process with these values. During the execution of the sub-process, these values can be populated or updated, based on the logic of each specific sub-process. You can also map subsequent elements of the parent process to these parameters.<br/>\n<!-- -->To add/edit/delete the element parameters, modify the process selected in the <strong>Which process to run?</strong> field.<br/>\n<!-- -->Before making any changes to a business process, which is used as a sub-process, make sure that such changes will not affect other processes. For example, if you edit the data type of a parameter and change it from the “Lookup” value to “Boolean” in a business process, this may lead to errors in any processes that use it as a sub-process.<br/>\n<!-- -->Please check the <strong>Used as sub-process in processes</strong> detail of the <a href=\"https://academy.creatio.com/documents/technic-bpms/7-16/process-properties-page#HT_section_process_library_launch_options_tab\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Launch options</strong> tab</a> in the Process Library before modifying an existing process. If this process has any sub-processes of its own, they will be displayed in the <strong>Sub-processes</strong> detail of the <a href=\"https://academy.creatio.com/documents/technic-bpms/7-16/process-properties-page#HT_section_process_library_sub_processes_tab\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Sub-processes</strong> tab</a>.</p></td></tr></tbody></table>"
}