{
  "headers": [],
  "rows": [
    [
      "Parameter",
      "Parameter value"
    ],
    [
      "Detail",
      "Select a detail to add. Required. Some of the existing details are designed for specific sections. Be sure to select the version of a detail whose name specifically indicates that the detail was designed for this particular section. For example, when adding theAttachmentsdetail to theAccountssection page, select the “Account attachments” detail."
    ],
    [
      "Title",
      "Specify the detail title."
    ],
    [
      "Detail column",
      "Select the column that connects detail records to the current record in the section. Required. For example, records on theAccount addressesdetail in theAccountssection are connected to theAccountssection by theAccountcolumn."
    ],
    [
      "Object column",
      "Specify the column that contains the section ID. Required. Out of the box, it is “Id.”"
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p><strong>Parameter</strong></p></td><td><p><strong>Parameter value</strong></p></td></tr><tr><td><p>Detail</p></td><td><p>Select a detail to add. Required. Some of the existing details are designed for specific sections. Be sure to select the version of a detail whose name specifically indicates that the detail was designed for this particular section. For example, when adding the <strong>Attachments</strong> detail to the <strong>Accounts</strong> section page, select the “Account attachments” detail.</p></td></tr><tr><td><p>Title</p></td><td><p>Specify the detail title.</p></td></tr><tr><td><p>Detail column</p></td><td><p>Select the column that connects detail records to the current record in the section. Required. For example, records on the <strong>Account addresses</strong> detail in the <strong>Accounts</strong> section are connected to the <strong>Accounts</strong> section by the <strong>Account</strong> column.</p></td></tr><tr><td><p>Object column</p></td><td><p>Specify the column that contains the section ID. Required. Out of the box, it is “Id.”</p></td></tr></tbody></table>"
}