{
  "headers": [],
  "rows": [
    [
      "Database table",
      "Description"
    ],
    [
      "ContactAddress",
      "The index of contact address values. Linked to theAddressTypedatabase table via theAddressTypeIdcolumn."
    ],
    [
      "AddressType",
      "The index of contact address types. TheNamecolumn contains the index of address type values in the primary language."
    ],
    [
      "SysAddressTypeLcz",
      "The index of contact address types in additional languages. Generated automatically. Linked to theAddressTypedatabase table via theRecordIdcolumn and to theSysCulturedatabase table via theSysCultureIdcolumn. TheNamecolumn contains the index of localizable values of contact address types for the language culture that is specified in theSysCultureIdcolumn of the current table."
    ],
    [
      "SysCulture",
      "The index of language cultures."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Database table</p></th><th><p>Description</p></th></tr><tr><td><p>ContactAddress</p></td><td><p>The index of contact address values. Linked to the <code>AddressType</code> database table via the <code>AddressTypeId</code> column.</p></td></tr><tr><td><p>AddressType</p></td><td><p>The index of contact address types. The <code>Name</code> column contains the index of address type values in the primary language.</p></td></tr><tr><td><p>SysAddressTypeLcz</p></td><td><p>The index of contact address types in additional languages. Generated automatically. Linked to the <code>AddressType</code> database table via the <code>RecordId</code> column and to the <code>SysCulture</code> database table via the <code>SysCultureId</code> column. The <code>Name</code> column contains the index of localizable values of contact address types for the language culture that is specified in the <code>SysCultureId</code> column of the current table.</p></td></tr><tr><td><p>SysCulture</p></td><td><p>The index of language cultures.</p></td></tr></tbody></table>"
}