{
  "headers": [],
  "rows": [
    [
      "Activation",
      "TheEvent sub-processelement executes each time theMessagestart eventis triggered by the correspondingThrow messageevent(Fig. 2). Same event sub-process can be activated several times in a single process instance."
    ],
    [
      "Execution",
      "When the corresponding message is thrown by the processThrow messageevent, theMessagestart event activates its outgoing flow and enables the execution of the other actions in the event sub-process flow.The event sub-process actions are executed as regular elements of the current business process and do not interrupt its execution.Pending user actions of both the event sub-process and the regular process can be performed in any order by the users.Unlike regularSub-processes, event sub-processes do not create a separate process instance in theProcess Logsection. The event sub-process tasks are displayed in theProcess elementsdetail of the process log as regular business process tasks, in the order of their execution."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>Activation</p></td><td><p>The <strong>Event sub-process</strong> element executes each time the <a href=\"https://academy.creatio.com#HT_chapter_process_designer_elements_events_message_start\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Message</strong> start event</a> is triggered by the corresponding <a href=\"https://academy.creatio.com#HT_chapter_process_designer_elements_events_intermediate_throwing_message\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Throw message</strong> event</a> (Fig. 2). Same event sub-process can be activated several times in a single process instance.</p></td></tr><tr><td><p>Execution</p></td><td><p>When the corresponding message is thrown by the process <strong>Throw message</strong> event, the <strong>Message</strong> start event activates its outgoing flow and enables the execution of the other actions in the event sub-process flow.<br/>\n<!-- -->The event sub-process actions are executed as regular elements of the current business process and do not interrupt its execution.<br/>\n<!-- -->Pending user actions of both the event sub-process and the regular process can be performed in any order by the users.<br/>\n<!-- -->Unlike regular <a href=\"https://academy.creatio.com#HT_chapter_process_designer_elements_sub_process\" rel=\"noopener noreferrer\" target=\"_blank\">Sub-processes</a>, event sub-processes do not create a separate process instance in the <strong>Process Log</strong> section. The event sub-process tasks are displayed in the <strong>Process elements</strong> detail of the process log as regular business process tasks, in the order of their execution.</p></td></tr></tbody></table>"
}