{
  "headers": [],
  "rows": [
    [
      "Field",
      "Field value"
    ],
    [
      "Object",
      "Enter the Creatio object to be used as a data source. For example, select the \"Activity\" object to calculate the average call duration (calls are activities of the \"Call\" category). The field is required."
    ],
    [
      "Function",
      "Select how the chart will process the source data. The field is required. You can select from the following options:\"count.\" Use this option to generate a chart by the number of Creatio object's records. For example, you can check the number of activities by type.\"sum.\" Use this option to display the sum of values in a numeric column. For instance, you can calculate the duration of employee's activities within a week.\"average,\" \"maximum,\" and \"minimum.\" Use these options the check the corresponding values of the data source's numeric column or a date column. For example, you can calculate the average employee activity duration."
    ],
    [
      "Column",
      "Select the column the function will use for the calculations. You can specify a numeric or a date column. For example, specify the \"Duration (minutes)\" column to calculate the average call duration by manager (Fig. 3). Creatio does not display this field if you select \"count\" in theFunctionfield. The field is required for all other options."
    ],
    [
      "Chart type",
      "Change the chart structure if needed, for example, to \"Bar\" or \"Doughnut.\" The field is required."
    ],
    [
      "With stacked",
      "Select this checkbox to display the chart as a stacked area chart. These kinds of charts display each column/bar as a total sum of separate data categories. The size of each column is proportionate to the value of the corresponding data element. Stacked area charts are useful if you need to compare not only the separate data values but also the total sums. For example, the chart can simultaneously display the total sum of opportunity amounts on each stage by different employees or the contribution of each stage to the total sum.TheWith stackedcheckbox is available for the \"Column\" and \"Bar\" chart types. If you set up a chart that have multipleseries, they will share the sameWith stackedvalue. For instance, if you select this checkbox for one of the series, the chart automatically selects it for all other series that have the \"Column\" or \"Bar\" chart types. Similarly, if you deselect it in one of the series, the chart automatically deselects them for all other series."
    ],
    [
      "Show legend",
      "Select the checkbox to display the chart legend. The legend displays the chart color and the text from theIndex number captionfield at the bottom of the chart setup page. If theIndex number captionfield is empty, the legend displays the name of the object used as a data source.TheShow legendcheckbox is available for the following chart types: \"Spline,\" \"Line,\" \"Bar,\" \"Area,\" \"Column,\" and \"Scatter.\""
    ],
    [
      "Show values",
      "Clear the checkbox to not display the values of individual bars and columns.TheShow valuescheckbox is available for \"Bar\" and \"Column\" chart types."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><th><p>Field</p></th><th><p>Field value</p></th></tr><tr><td><p>Object</p></td><td><p>Enter the Creatio object to be used as a data source. For example, select the \"Activity\" object to calculate the average call duration (calls are activities of the \"Call\" category). The field is required.</p></td></tr><tr><td><p>Function</p></td><td><p>Select how the chart will process the source data. The field is required. You can select from the following options:</p><ul>\n<li>\"count.\" Use this option to generate a chart by the number of Creatio object's records. For example, you can check the number of activities by type.</li>\n<li>\"sum.\" Use this option to display the sum of values in a numeric column. For instance, you can calculate the duration of employee's activities within a week.</li>\n<li>\"average,\" \"maximum,\" and \"minimum.\" Use these options the check the corresponding values of the data source's numeric column or a date column. For example, you can calculate the average employee activity duration.</li>\n</ul></td></tr><tr><td><p>Column</p></td><td><p>Select the column the function will use for the calculations. You can specify a numeric or a date column. For example, specify the \"Duration (minutes)\" column to calculate the average call duration by manager (Fig. 3). Creatio does not display this field if you select \"count\" in the <strong>Function</strong> field. The field is required for all other options.</p></td></tr><tr><td><p>Chart type</p></td><td><p>Change the chart structure if needed, for example, to \"Bar\" or \"Doughnut.\" The field is required.</p></td></tr><tr><td><p>With stacked</p></td><td><p>Select this checkbox to display the chart as a stacked area chart. These kinds of charts display each column/bar as a total sum of separate data categories. The size of each column is proportionate to the value of the corresponding data element. Stacked area charts are useful if you need to compare not only the separate data values but also the total sums. For example, the chart can simultaneously display the total sum of opportunity amounts on each stage by different employees or the contribution of each stage to the total sum.</p><p>The <strong>With stacked</strong> checkbox is available for the \"Column\" and \"Bar\" chart types. If you set up a chart that have multiple <a href=\"#title-184-3\">series</a>, they will share the same <strong>With stacked</strong> value. For instance, if you select this checkbox for one of the series, the chart automatically selects it for all other series that have the \"Column\" or \"Bar\" chart types. Similarly, if you deselect it in one of the series, the chart automatically deselects them for all other series.</p></td></tr><tr><td><p>Show legend</p></td><td><p>Select the checkbox to display the chart legend. The legend displays the chart color and the text from the <strong>Index number caption</strong> field at the bottom of the chart setup page. If the <strong>Index number caption</strong> field is empty, the legend displays the name of the object used as a data source.</p><p>The <strong>Show legend</strong> checkbox is available for the following chart types: \"Spline,\" \"Line,\" \"Bar,\" \"Area,\" \"Column,\" and \"Scatter.\"</p></td></tr><tr><td><p>Show values</p></td><td><p>Clear the checkbox to not display the values of individual bars and columns.</p><p>The <strong>Show values</strong> checkbox is available for \"Bar\" and \"Column\" chart types.</p></td></tr></tbody></table>"
}