{
  "headers": [],
  "rows": [
    [
      "Property",
      "Function"
    ],
    [
      "Breadcrumb navigation (1)",
      "Use \"breadcrumbs\" at the top of the setup area to navigate the parent (column, section, banner, block and template) elements."
    ],
    [
      "Link to open",
      "Provide the URL to the desired destination in theLink to openfield."
    ],
    [
      "Font",
      "Use this settings group to configure the font settings of the link.Content builder font set– select the font family of the menu link from the list of registered font families. To modify the list of fonts used in your template, update the \"Content builder font set\" lookup. Read more in theSet up fonts in the Content Designerarticle.Size, px– specify the width and height of the font in pixels. Clickto open the color picker and select the font color.Line height, px– specify the spacing between the lines and the borders of the button. The maximum line height is 250px; the minimum line height cannot be less than the size of the font."
    ],
    [
      "Padding, px",
      "Specify the distance (in pixels) between the text and each of the borders of the container. Padding is specified separately for each side."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><th><p>Property</p></th><th><p>Function</p></th></tr><tr><td><p>Breadcrumb navigation (1)</p></td><td><p>Use \"breadcrumbs\" at the top of the setup area to navigate the parent (column, section, banner, block and template) elements.</p></td></tr><tr><td><p>Link to open</p></td><td><p>Provide the URL to the desired destination in the <strong>Link to open</strong> field.</p></td></tr><tr><td><p>Font</p></td><td><p>Use this settings group to configure the font settings of the link.</p><p><strong>Content builder font set</strong> – select the font family of the menu link from the list of registered font families. To modify the list of fonts used in your template, update the \"Content builder font set\" lookup. Read more in the <a href=\"https://academy.creatio.com/documents?id=2061\" rel=\"noopener noreferrer\" target=\"_blank\">Set up fonts in the Content Designer</a> article.</p><p><strong>Size, px</strong> – specify the width and height of the font in pixels. Click  <img alt=\"\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/sites/default/files/documents/docs_en/product/bpm'online%20marketing/marketing/7.16.0/BPMonlineHelp/section_email/font_color_picker00070.png\"/> to open the color picker and select the font color.</p><p><strong>Line height, px</strong> – specify the spacing between the lines and the borders of the button. The maximum line height is 250px; the minimum line height cannot be less than the size of the font.</p></td></tr><tr><td><p>Padding, px</p></td><td><p>Specify the distance (in pixels) between the text and each of the borders of the container. Padding is specified separately for each side.</p></td></tr></tbody></table>"
}