{
  "headers": [],
  "rows": [
    [
      "Which type of signal is received?",
      "Choose which signal activates the event:Select \"Custom signal\" if the event is activated by aThrow signalintermediate eventin any business process (the current business process or any other).Select \"Record signal\" if the event is activated whenever an object record is modified or deleted in Creatio.The selected option determines what following parameters will appear in the element setup area."
    ],
    [
      "Run following elements in the background",
      "Select this checkbox, if you want any \"User action\" elements activated with the outgoing flows of the current element to run \"in the background.\" When process elements are executed in the background, their loading mask is not displayed, no windows pop up for the user, etc. The user will be able to interact with the elements via theBusiness process taskstab of the communication panel."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>Which type of signal is received?</p></td><td><p>Choose which signal activates the event:</p><ul>\n<li>Select \"Custom signal\" if the event is activated by a <a href=\"https://academy.creatio.com/documents?id=7034\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Throw signal</strong> intermediate event</a> in any business process (the current business process or any other).</li>\n<li>Select \"Record signal\" if the event is activated whenever an object record is modified or deleted in Creatio.</li>\n</ul><p>The selected option determines what following parameters will appear in the element setup area.</p></td></tr><tr><td><p>Run following elements in the background</p></td><td><p>Select this checkbox, if you want any \"User action\" elements activated with the outgoing flows of the current element to run \"in the background.\" When process elements are executed in the background, their loading mask is not displayed, no windows pop up for the user, etc. The user will be able to interact with the elements via the <strong>Business process tasks</strong> tab of the communication panel.</p></td></tr></tbody></table>"
}