{
  "headers": [],
  "rows": [
    [
      "Parameter",
      "Value",
      "Description"
    ],
    [
      "-operation",
      "InstallFromRepository",
      "Imports the package content and properties from *.zip archives into the configuration. If needed, the utility runs bound SQL scripts, re-generates source code, and installs bound data. Works only with updated or new packages and their elements. Requires either the-webApplicationPathor-configurationPathparameter. Also requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "-packageName",
      "Package name",
      "In the-workspaceNameparameter, specify the package name in the configuration. The utility downloads the packages on which the current package depends as well. If you omit the parameter, the utility downloads all packages of the configuration."
    ],
    [
      "-workspaceName",
      "Workspace name",
      "The name of the workspace (configuration) where the operation is performed. By default, all users work in theDefaultworkspace."
    ],
    [
      "-sourcePath",
      "Path to a local directory",
      "Path to a local directory. The directory must contain the *.gz package archives to install."
    ],
    [
      "-destinationPath",
      "Path to a local directory",
      "Path to a temporary local directory. The utility unpacks the package archives specified in the-sourcePathparameter to this directory."
    ],
    [
      "-skipConstraints",
      "false",
      "Skips the creation of foreign keys in database tables. Can betrueorfalse."
    ],
    [
      "-skipValidateActions",
      "true",
      "Skips checking if table indexes can be created when updating the database structure. Can betrueorfalse."
    ],
    [
      "-regenerateSchemaSources",
      "true",
      "Specifies whether to re-generate the source code after saving the packages to the database. Can betrueorfalse. The default value istrue."
    ],
    [
      "-updateDBStructure",
      "true",
      "Specifies whether to update the database structure after saving the packages. Can betrueorfalse. The default value istrue."
    ],
    [
      "-updateSystemDBStructure",
      "true",
      "Specifies whether to modify the structure of the system schema database before installing the packages. Also creates the missing indexes in the system tables. Can betrueorfalse."
    ],
    [
      "-installPackageSqlScript",
      "true",
      "Specifies whether to run the SQL scripts before and after saving the packages. Can betrueorfalse. The default value istrue."
    ],
    [
      "-installPackageData",
      "true",
      "Specifies whether to install the bound package data after saving the packages. Can betrueorfalse. The default value istrue."
    ],
    [
      "-continueIfError",
      "true",
      "Specifies whether to abort the installation after encountering the first error. If set totrue, the installation process goes through to the end. You will receive the list of the errors encountered. Can betrueorfalse. The default value isfalse."
    ],
    [
      "-webApplicationPath",
      "Path to a local directory",
      "Path to the Creatio installation directory. The utility follows this path to fetch the database connection information from theConnectionStrings.configfile. If you omit this parameter, the utility connects to the database specified in the connection string in the utility’s configuration file."
    ],
    [
      "-confRuntimeParentDirectory",
      "Path to a local directory",
      "Path to the parent directory of the..\\Terrasoft.WebApp\\confdirectory."
    ],
    [
      "-logPath",
      "Path to a local directory",
      "The utility saves the operation log file to this directory. The file name consists of the operation start date and time. Optional."
    ],
    [
      "-configurationPath",
      "Path to a local directory",
      "Path to the..\\Terrasoft.WebApp\\Terrasoft.Configurationdirectory. The utility exports the source code and resources of user-made package schemas to this directory in thefile systemdevelopment mode."
    ],
    [
      "-backupConfiguration",
      "true",
      "Specifies whether to back up the configuration before package installation. Available in Creatio version 8.0.2 and later. The default value istrue."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Parameter</p></th><th><p>Value</p></th><th><p>Description</p></th></tr><tr><th><p><code>-operation</code></p></th><td><p><code>InstallFromRepository</code></p></td><td><p>Imports the package content and properties from *.zip archives into the configuration. If needed, the utility runs bound SQL scripts, re-generates source code, and installs bound data. Works only with updated or new packages and their elements. Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter. Also requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><th><p><code>-packageName</code></p></th><td><p><strong>Package name</strong></p></td><td><p>In the <code>-workspaceName</code> parameter, specify the package name in the configuration. The utility downloads the packages on which the current package depends as well. If you omit the parameter, the utility downloads all packages of the configuration.</p></td></tr><tr><th><p><code>-workspaceName</code></p></th><td><p><strong>Workspace name</strong></p></td><td><p>The name of the workspace (configuration) where the operation is performed. By default, all users work in the <code>Default</code> workspace.</p></td></tr><tr><th><p><code>-sourcePath</code></p></th><td><p><strong>Path to a local directory</strong></p></td><td><p>Path to a local directory. The directory must contain the *.gz package archives to install.</p></td></tr><tr><th><p><code>-destinationPath</code></p></th><td><p><strong>Path to a local directory</strong></p></td><td><p>Path to a temporary local directory. The utility unpacks the package archives specified in the <code>-sourcePath</code> parameter to this directory.</p></td></tr><tr><th><p><code>-skipConstraints</code></p></th><td><p><code>false</code></p></td><td><p>Skips the creation of foreign keys in database tables. Can be <code>true</code> or <code>false</code>.</p></td></tr><tr><th><p><code>-skipValidateActions</code></p></th><td><p><code>true</code></p></td><td><p>Skips checking if table indexes can be created when updating the database structure. Can be <code>true</code> or <code>false</code>.</p></td></tr><tr><th><p><code>-regenerateSchemaSources</code></p></th><td><p><code>true</code></p></td><td><p>Specifies whether to re-generate the source code after saving the packages to the database. Can be <code>true</code> or <code>false</code>. The default value is <code>true</code>.</p></td></tr><tr><th><p><code>-updateDBStructure</code></p></th><td><p><code>true</code></p></td><td><p>Specifies whether to update the database structure after saving the packages. Can be <code>true</code> or <code>false</code>. The default value is <code>true</code>.</p></td></tr><tr><th><p><code>-updateSystemDBStructure</code></p></th><td><p><code>true</code></p></td><td><p>Specifies whether to modify the structure of the system schema database before installing the packages. Also creates the missing indexes in the system tables. Can be <code>true</code> or <code>false</code>.</p></td></tr><tr><th><p><code>-installPackageSqlScript</code></p></th><td><p><code>true</code></p></td><td><p>Specifies whether to run the SQL scripts before and after saving the packages. Can be <code>true</code> or <code>false</code>. The default value is <code>true</code>.</p></td></tr><tr><th><p><code>-installPackageData</code></p></th><td><p><code>true</code></p></td><td><p>Specifies whether to install the bound package data after saving the packages. Can be <code>true</code> or <code>false</code>. The default value is <code>true</code>.</p></td></tr><tr><th><p><code>-continueIfError</code></p></th><td><p><code>true</code></p></td><td><p>Specifies whether to abort the installation after encountering the first error. If set to <code>true</code>, the installation process goes through to the end. You will receive the list of the errors encountered. Can be <code>true</code> or <code>false</code>. The default value is <code>false</code>.</p></td></tr><tr><th><p><code>-webApplicationPath</code></p></th><td><p><strong>Path to a local directory</strong></p></td><td><p>Path to the Creatio installation directory. The utility follows this path to fetch the database connection information from the <code>ConnectionStrings.config</code> file. If you omit this parameter, the utility connects to the database specified in the connection string in the utility’s configuration file.</p></td></tr><tr><th><p><code>-confRuntimeParentDirectory</code></p></th><td><p><strong>Path to a local directory</strong></p></td><td><p>Path to the parent directory of the <code>..\\Terrasoft.WebApp\\conf</code> directory.</p></td></tr><tr><th><p><code>-logPath</code></p></th><td><p><strong>Path to a local directory</strong></p></td><td><p>The utility saves the operation log file to this directory. The file name consists of the operation start date and time. Optional.</p></td></tr><tr><th><p><code>-configurationPath</code></p></th><td><p><strong>Path to a local directory</strong></p></td><td><p>Path to the <code>..\\Terrasoft.WebApp\\Terrasoft.Configuration</code> directory. The utility exports the source code and resources of user-made package schemas to this directory in the <a href=\"https://academy.creatio.com/documents?ver=8.0&amp;id=15126\" rel=\"noopener noreferrer\" target=\"_blank\">file system</a> development mode.</p></td></tr><tr><th><p><code>-backupConfiguration</code></p></th><td><p><code>true</code></p></td><td><p>Specifies whether to back up the configuration before package installation. Available in Creatio version 8.0.2 and later. The default value is <code>true</code>.</p></td></tr></tbody></table>"
}