{
  "headers": [],
  "rows": [
    [
      "Property",
      "Property value",
      "Property description"
    ],
    [
      "Code*",
      "The schema name",
      "Matches theCodeproperties specified in the Freedom UI Designer."
    ],
    [
      "Title*",
      "The localizable schema title",
      "Matches thePage titleproperty specified in the Freedom UI Designer."
    ],
    [
      "Parent object",
      "The object whose properties the module inherits",
      "Creatio populates the property automatically based on the template selected when adding the Freedom UI page in theConfigurationsection. We do not recommend editing theParent objectproperty after you add elements to the schema. This can cause page malfunction."
    ],
    [
      "Package",
      "The user-made package where you create the schema",
      "Matches thePackageproperty specified in the Freedom UI Designer. The property is populated automatically and non-editable."
    ],
    [
      "Description",
      "The localizable schema description",
      "Matches theDescriptionproperty specified in the Freedom UI Designer."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Property</p></th><th><p>Property value</p></th><th><p>Property description</p></th></tr><tr><td><p>Code<font color=\"#FF0000\">*</font></p></td><td><p>The schema name</p></td><td><p>Matches the <strong>Code</strong> properties specified in the Freedom UI Designer.</p></td></tr><tr><td><p>Title<font color=\"#FF0000\">*</font></p></td><td><p>The localizable schema title</p></td><td><p>Matches the <strong>Page title</strong> property specified in the Freedom UI Designer.</p></td></tr><tr><td><p>Parent object</p></td><td><p>The object whose properties the module inherits</p></td><td><p>Creatio populates the property automatically based on the template selected when adding the Freedom UI page in the <strong>Configuration</strong> section. We do not recommend editing the <strong>Parent object</strong> property after you add elements to the schema. This can cause page malfunction.</p></td></tr><tr><td><p>Package</p></td><td><p>The user-made package where you create the schema</p></td><td><p>Matches the <strong>Package</strong> property specified in the Freedom UI Designer. The property is populated automatically and non-editable.</p></td></tr><tr><td><p>Description</p></td><td><p>The localizable schema description</p></td><td><p>Matches the <strong>Description</strong> property specified in the Freedom UI Designer.</p></td></tr></tbody></table>"
}