{
  "headers": [],
  "rows": [
    [
      "LoadLicResponse",
      "Uploads licenses to the database specified in the connection string. The only operation that does not require the-workspaceNameparameter."
    ],
    [
      "SaveRepositoryContent",
      "Saves the *.zip package archives specified in the-contentTypesparameter from the directory specified in the-sourcePathparameter to the directory specified in the-destinationPathparameter."
    ],
    [
      "SaveDBContent",
      "Saves the database content to the file system. The-contentTypesparameter determines the content type. The-destinationPathparameter determines the content export path in the file system. Requires either the-webApplicationPathor-configurationPathparameter."
    ],
    [
      "SaveVersionSvnContent",
      "Dumps the package hierarchy as a set of *.zip archives. The-destinationPathparameter determines the content export path in the file system. The-sourcePathparameter specifies the SVN repositories."
    ],
    [
      "RegenerateSchemaSources",
      "Re-generates the source code and compiles it. Requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "InstallFromRepository",
      "Imports the package content and properties from *.zip archives into the configuration. If needed, the utility runs bound SQL scripts, re-generates source code, and installs bound data. Works exclusively with updated or new packages and their elements. Requires either the-webApplicationPathor-configurationPathparameter. Also requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "InstallBundlePackages",
      "Installs the bundle of packages listed in the-packageNamecomma-separated list to the workspace specified in the-workspaceNameparameter. Requires either the-webApplicationPathor-configurationPathparameter. Also requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "PrevalidateInstallFromRepository",
      "Checks if installing packages from *.zip archives is possible."
    ],
    [
      "ConcatRepositories",
      "Merges several repositories."
    ],
    [
      "ConcatSVNRepositories",
      "Merges several SVN repositories."
    ],
    [
      "ExecuteProcess",
      "Runs the business process in the configuration if the utility detects such a process. Requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "UpdatePackages",
      "Updates the packages (-packageNameparameter) in the database. Will only update the packages included in the product package hierarchy (-productPackageNameparameter). Requires either the-webApplicationPathor-configurationPathparameter. Also requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "BuildWorkspace",
      "Compiles the workspace (configuration). Use when developing schemas in Visual Studio. Learn more:Write C# code. Requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "ReBuildWorkspace",
      "Recompiles the workspace (configuration). Use when developing schemas in Visual Studio. Learn more:Write C# code. Requires the-confRuntimeParentDirectoryparameter."
    ],
    [
      "UpdateWorkspaceSolution",
      "Updates the solution and files of the Visual Studio project. Learn more:Write C# code."
    ],
    [
      "BuildConfiguration",
      "Generates the static content in the file system. Learn more:Set up WorkspaceConsole for compilation. Uses the following parameters:-workspaceName-destinationPath-webApplicationPath-logPath-force-configurationPathRequires either the-webApplicationPathor-configurationPathparameter."
    ],
    [
      "RestoreConfiguration",
      "Restores the configuration from the package backup. Requires theBackupConfigurationoperation to be performed. Requires the-installPackageDataand-backupPathparameters."
    ],
    [
      "UpdateConfiguration",
      "Updates the configuration."
    ],
    [
      "DeletePackages",
      "Deletes the packages from configuration. Requires the-packagesToDeleteparameter."
    ],
    [
      "ChangeFeatureState",
      "Changes the feature status. Requires the-featureCode,-featureState,-adminUnitNameparameters."
    ],
    [
      "ExecuteScript",
      "Runs out-of-the-box or custom executable code (*.dll)."
    ],
    [
      "SetFileStorageConnectionString",
      "Changes connection settings for external file storage, for example, S3 or Azure Blob. This is useful to arrange automation, such as rotating credentials regularly. Requires the-storageCodeand-storageConnectionStringparameters."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>LoadLicResponse</p></td><td><p>Uploads licenses to the database specified in the connection string. The only operation that does not require the <code>-workspaceName</code> parameter.</p></td></tr><tr><td><p>SaveRepositoryContent</p></td><td><p>Saves the *.zip package archives specified in the <code>-contentTypes</code> parameter from the directory specified in the <code>-sourcePath</code> parameter to the directory specified in the <code>-destinationPath</code> parameter.</p></td></tr><tr><td><p>SaveDBContent</p></td><td><p>Saves the database content to the file system. The <code>-contentTypes</code> parameter determines the content type. The <code>-destinationPath</code> parameter determines the content export path in the file system. Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter.</p></td></tr><tr><td><p>SaveVersionSvnContent</p></td><td><p>Dumps the package hierarchy as a set of *.zip archives. The <code>-destinationPath</code> parameter determines the content export path in the file system. The <code>-sourcePath</code> parameter specifies the SVN repositories.</p></td></tr><tr><td><p>RegenerateSchemaSources</p></td><td><p>Re-generates the source code and compiles it. Requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>InstallFromRepository</p></td><td><p>Imports the package content and properties from *.zip archives into the configuration. If needed, the utility runs bound SQL scripts, re-generates source code, and installs bound data. Works exclusively with updated or new packages and their elements. Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter. Also requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>InstallBundlePackages</p></td><td><p>Installs the bundle of packages listed in the <code>-packageName</code> comma-separated list to the workspace specified in the <code>-workspaceName</code> parameter. Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter. Also requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>PrevalidateInstallFromRepository</p></td><td><p>Checks if installing packages from *.zip archives is possible.</p></td></tr><tr><td><p>ConcatRepositories</p></td><td><p>Merges several repositories.</p></td></tr><tr><td><p>ConcatSVNRepositories</p></td><td><p>Merges several SVN repositories.</p></td></tr><tr><td><p>ExecuteProcess</p></td><td><p>Runs the business process in the configuration if the utility detects such a process. Requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>UpdatePackages</p></td><td><p>Updates the packages (<code>-packageName</code> parameter) in the database. Will only update the packages included in the product package hierarchy (<code>-productPackageName</code> parameter). Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter. Also requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>BuildWorkspace</p></td><td><p>Compiles the workspace (configuration). Use when developing schemas in Visual Studio. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.2&amp;id=15111&amp;anchor=title-2098-11\" rel=\"noopener noreferrer\" target=\"_blank\">Write C# code</a>. Requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>ReBuildWorkspace</p></td><td><p>Recompiles the workspace (configuration). Use when developing schemas in Visual Studio. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.2&amp;id=15111&amp;anchor=title-2098-11\" rel=\"noopener noreferrer\" target=\"_blank\">Write C# code</a>. Requires the <code>-confRuntimeParentDirectory</code> parameter.</p></td></tr><tr><td><p>UpdateWorkspaceSolution</p></td><td><p>Updates the solution and files of the Visual Studio project. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.2&amp;id=15111&amp;anchor=title-2098-11\" rel=\"noopener noreferrer\" target=\"_blank\">Write C# code</a>.</p></td></tr><tr><td><p>BuildConfiguration</p></td><td><p>Generates the static content in the file system. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.2&amp;id=15111&amp;anchor=title-2098-6\" rel=\"noopener noreferrer\" target=\"_blank\">Set up WorkspaceConsole for compilation</a>. Uses the following parameters:</p><ul>\n<li><code>-workspaceName</code></li>\n<li><code>-destinationPath</code></li>\n<li><code>-webApplicationPath</code></li>\n<li><code>-logPath</code></li>\n<li><code>-force</code></li>\n<li><code>-configurationPath</code></li>\n</ul><p>Requires either the <code>-webApplicationPath</code> or <code>-configurationPath</code> parameter.</p></td></tr><tr><td><p>RestoreConfiguration</p></td><td><p>Restores the configuration from the package backup. Requires the <code>BackupConfiguration</code> operation to be performed. Requires the <code>-installPackageData</code> and <code>-backupPath</code> parameters.</p></td></tr><tr><td><p>UpdateConfiguration</p></td><td><p>Updates the configuration.</p></td></tr><tr><td><p>DeletePackages</p></td><td><p>Deletes the packages from configuration. Requires the <code>-packagesToDelete</code> parameter.</p></td></tr><tr><td><p>ChangeFeatureState</p></td><td><p>Changes the feature status. Requires the <code>-featureCode</code>, <code>-featureState</code>, <code>-adminUnitName</code> parameters.</p></td></tr><tr><td><p>ExecuteScript</p></td><td><p>Runs out-of-the-box or custom executable code (*.dll).</p></td></tr><tr><td><p>SetFileStorageConnectionString</p></td><td><p>Changes connection settings for external file storage, for example, S3 or Azure Blob. This is useful to arrange automation, such as rotating credentials regularly. Requires the <code>-storageCode</code> and <code>-storageConnectionString</code> parameters.</p></td></tr></tbody></table>"
}