{
  "headers": [],
  "rows": [
    [
      "disabled",
      "activity of the column. Iftrue, the control associated with the column will be inactive and disabled for operation"
    ],
    [
      "readOnly",
      "\"Read only\" flag. Iftrue, the control associated with the column will be available only for reading. Iffalse– the access for reading and writing"
    ],
    [
      "hidden",
      "column visibility. Iftrue, the control associated with the column will be hidden. Iffalse– the control will be displayed"
    ],
    [
      "addFilter",
      "add filter. If the property is specified, it should have a filter of theTerrasoft.Filtertype that will be added to the column filtration. Property is used only for lookup fields"
    ],
    [
      "removeFilter",
      "remove the filter. If the property is specified, it should have a name of the filter that will be removed from the column filtration. Property is used only for lookup fields"
    ],
    [
      "isValid",
      "flag of column validity. If the property is specified, it will change the validity flag of the control associated with the column. If the column is invalid, then this can mean canceling of saving the record, and can also lead to the determining the record as invalid"
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>disabled</p></td><td><p>activity of the column. If <code>true</code>, the control associated with the column will be inactive and disabled for operation</p></td></tr><tr><td><p>readOnly</p></td><td><p>\"Read only\" flag. If <code>true</code>, the control associated with the column will be available only for reading. If <code>false</code> – the access for reading and writing</p></td></tr><tr><td><p>hidden</p></td><td><p>column visibility. If <code>true</code>, the control associated with the column will be hidden. If <code>false</code> – the control will be displayed</p></td></tr><tr><td><p>addFilter</p></td><td><p>add filter. If the property is specified, it should have a filter of the <code>Terrasoft.Filter</code> type that will be added to the column filtration. Property is used only for lookup fields</p></td></tr><tr><td><p>removeFilter</p></td><td><p>remove the filter. If the property is specified, it should have a name of the filter that will be removed from the column filtration. Property is used only for lookup fields</p></td></tr><tr><td><p>isValid</p></td><td><p>flag of column validity. If the property is specified, it will change the validity flag of the control associated with the column. If the column is invalid, then this can mean canceling of saving the record, and can also lead to the determining the record as invalid</p></td></tr></tbody></table>"
}