{
  "headers": [],
  "rows": [
    [
      "Parameter",
      "Parameter description"
    ],
    [
      "client_id*",
      "TheClientIdparameter value retrieved while configuring authorization code grant. Find the parameter value in theClient Idfield on the integration page. Learn more:Generate OAuth 2.0 client credentials(user documentation)."
    ],
    [
      "redirect_uri*",
      "Redirect URIs to receive authorization codes when authorizing integrated app. Find the parameter value in theAuthorized redirect URIsexpanded list on the integration page."
    ],
    [
      "response_type*",
      "Requires thecodeparameter value."
    ],
    [
      "scope*",
      "The scope of the request execution. Represents the list of permissions that external app receives after granting the consent. Creatio supports the following scopes:offline accessto work with OAuth refresh tokenapplication accessto access Creatio instance inside context of user who grants consent. Application access value is unique for each Creatio instance. Find the parameter value in theNamecolumn of theOAuth resourcelookup.Use percent-encoded space (%20) as a delimiter of scope list."
    ],
    [
      "state*",
      "If you usean existing external app, the external app must populate thestateparameter value.If you usecustom external app, implement business logic that generates arbitrary sequence of characters every time you use thestateparameter to ensure CSRF protection. Ensure that Creatio returns the same value of thestateparameter to custom external app after user confirm access to Creatio from integrated app. If returned and sent parameter values are different, recognize it as potential attack."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Parameter</p></th><th><p>Parameter description</p></th></tr><tr><td><p>client_id<font color=\"#FF0000\">*</font></p></td><td><p>The <code>ClientId</code> parameter value retrieved while configuring authorization code grant. Find the parameter value in the <strong>Client Id</strong> field on the integration page. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.3&amp;id=2576&amp;anchor=title-2576-3\" rel=\"noopener noreferrer\" target=\"_blank\">Generate OAuth 2.0 client credentials</a> (user documentation).</p></td></tr><tr><td><p>redirect_uri<font color=\"#FF0000\">*</font></p></td><td><p>Redirect URIs to receive authorization codes when authorizing integrated app. Find the parameter value in the <strong>Authorized redirect URIs</strong> expanded list on the integration page.</p></td></tr><tr><td><p>response_type<font color=\"#FF0000\">*</font></p></td><td><p>Requires the <code>code</code> parameter value.</p></td></tr><tr><td><p>scope<font color=\"#FF0000\">*</font></p></td><td><p>The scope of the request execution. Represents the list of permissions that external app receives after granting the consent. Creatio supports the following scopes:</p><ul>\n<li><strong>offline access</strong> to work with OAuth refresh token</li>\n<li><strong>application access</strong> to access Creatio instance inside context of user who grants consent. Application access value is unique for each Creatio instance. Find the parameter value in the <strong>Name</strong> column of the <strong>OAuth resource</strong> lookup.</li>\n</ul><p>Use percent-encoded space (<code>%20</code>) as a delimiter of scope list.</p></td></tr><tr><td><p>state<font color=\"#FF0000\">*</font></p></td><td><ul>\n<li>If you use <strong>an existing external app</strong>, the external app must populate the <code>state</code> parameter value.</li>\n<li>If you use <strong>custom external app</strong>, implement business logic that generates arbitrary sequence of characters every time you use the <code>state</code> parameter to ensure CSRF protection. Ensure that Creatio returns the same value of the <code>state</code> parameter to custom external app after user confirm access to Creatio from integrated app. If returned and sent parameter values are different, recognize it as potential attack.</li>\n</ul></td></tr></tbody></table>"
}