{
  "headers": [],
  "rows": [
    [
      "Parameter",
      "Parameter description"
    ],
    [
      "client_id*",
      "TheClientIdparameter value retrieved while configuring authorization code grant. Find the parameter value in theClient Idfield on the integration page. Learn more:Generate OAuth 2.0 client credentials(user documentation)."
    ],
    [
      "client_secret*",
      "TheClient secretparameter value retrieved while configuring authorization code grant. Find the parameter value in theClient secretfield on the integration page. Learn more:Generate OAuth 2.0 client credentials(user documentation)."
    ],
    [
      "grant_type*",
      "OAuth 2.0 authorization type. Find the parameter value in theGrant typecolumn on theOAuth integrated applicationspage. Requires theauthorization_codevalue of thegrantTypeparameter to retrieve access and refresh OAuth tokens for authorization code grant."
    ],
    [
      "scope*",
      "The scope of the request execution. Represents the list of permissions that external app receives after granting the consent. Creatio supports the following scopes:offline accessto work with OAuth refresh tokenapplication accessto access Creatio instance inside context of user who grants consent. Application access value is unique for each Creatio instance. Find the parameter value in theNamecolumn of theOAuth resourcelookup.Use percent-encoded space (%20) as a delimiter of scope list."
    ],
    [
      "redirect_uri*",
      "Redirect URIs to receive authorization codes when authorizing integrated app. Find the parameter value in theAuthorized redirect URIsexpanded list on the integration page."
    ],
    [
      "code*",
      "The authorization code retrieved on the previous step."
    ],
    [
      "content-type*",
      "Requires theapplication/x-www-form-urlencodedparameter value."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Parameter</p></th><th><p>Parameter description</p></th></tr><tr><td><p>client_id<font color=\"#FF0000\">*</font></p></td><td><p>The <code>ClientId</code> parameter value retrieved while configuring authorization code grant. Find the parameter value in the <strong>Client Id</strong> field on the integration page. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.3&amp;id=2576&amp;anchor=title-2576-3\" rel=\"noopener noreferrer\" target=\"_blank\">Generate OAuth 2.0 client credentials</a> (user documentation).</p></td></tr><tr><td><p>client_secret<font color=\"#FF0000\">*</font></p></td><td><p>The <code>Client secret</code> parameter value retrieved while configuring authorization code grant. Find the parameter value in the <strong>Client secret</strong> field on the integration page. Learn more: <a href=\"https://academy.creatio.com/documents?ver=8.3&amp;id=2576&amp;anchor=title-2576-3\" rel=\"noopener noreferrer\" target=\"_blank\">Generate OAuth 2.0 client credentials</a> (user documentation).</p></td></tr><tr><td><p>grant_type<font color=\"#FF0000\">*</font></p></td><td><p>OAuth 2.0 authorization type. Find the parameter value in the <strong>Grant type</strong> column on the <strong>OAuth integrated applications</strong> page. Requires the <code>authorization_code</code> value of the <code>grantType</code> parameter to retrieve access and refresh OAuth tokens for authorization code grant.</p></td></tr><tr><td><p>scope<font color=\"#FF0000\">*</font></p></td><td><p>The scope of the request execution. Represents the list of permissions that external app receives after granting the consent. Creatio supports the following scopes:</p><ul>\n<li><strong>offline access</strong> to work with OAuth refresh token</li>\n<li><strong>application access</strong> to access Creatio instance inside context of user who grants consent. Application access value is unique for each Creatio instance. Find the parameter value in the <strong>Name</strong> column of the <strong>OAuth resource</strong> lookup.</li>\n</ul><p>Use percent-encoded space (<code>%20</code>) as a delimiter of scope list.</p></td></tr><tr><td><p>redirect_uri<font color=\"#FF0000\">*</font></p></td><td><p>Redirect URIs to receive authorization codes when authorizing integrated app. Find the parameter value in the <strong>Authorized redirect URIs</strong> expanded list on the integration page.</p></td></tr><tr><td><p>code<font color=\"#FF0000\">*</font></p></td><td><p>The authorization code retrieved on the previous step.</p></td></tr><tr><td><p>content-type<font color=\"#FF0000\">*</font></p></td><td><p>Requires the <code>application/x-www-form-urlencoded</code> parameter value.</p></td></tr></tbody></table>"
}