{
  "headers": [],
  "rows": [
    [
      "Action",
      "Action description"
    ],
    [
      "Revert changes",
      "The action reverts all changes and deletes the record from the synchronization log. If you select the action, the record in the Mobile Creatio will be overwritten with the corresponding record from the main Creatio app. For example, a system administrator removed user rights to edit an account type. A conflict occurs when you edit theTypefield and try to synchronize with the main Creatio app. To solve the conflict, decline the changes and re-synchronize the Mobile Creatio data. Learn more about solving synchronization conflicts:Mobile Creatio FAQ."
    ],
    [
      "Go to record",
      "The action opens the record page. For example, an empty field is required. When you create a record whose required field is empty, a conflict occurs. To solve the conflict, open the record page, populate the required field, and re-synchronize Mobile Creatio data."
    ],
    [
      "Request access",
      "The action opens a default mobile mail client and creates a request template to provide the permissions required for synchronization."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Action</p></th><th><p>Action description</p></th></tr><tr><td><p>Revert changes</p></td><td><p>The action reverts all changes and deletes the record from the synchronization log. If you select the action, the record in the Mobile Creatio will be overwritten with the corresponding record from the main Creatio app. For example, a system administrator removed user rights to edit an account type. A conflict occurs when you edit the <strong>Type</strong> field and try to synchronize with the main Creatio app. To solve the conflict, decline the changes and re-synchronize the Mobile Creatio data. Learn more about solving synchronization conflicts: <a href=\"https://academy.creatio.com/documents?id=1668&amp;anchor=title-771-2\" rel=\"noopener noreferrer\" target=\"_blank\">Mobile Creatio FAQ</a>.</p></td></tr><tr><td><p>Go to record</p></td><td><p>The action opens the record page. For example, an empty field is required. When you create a record whose required field is empty, a conflict occurs. To solve the conflict, open the record page, populate the required field, and re-synchronize Mobile Creatio data.</p></td></tr><tr><td><p>Request access</p></td><td><p>The action opens a default mobile mail client and creates a request template to provide the permissions required for synchronization.</p></td></tr></tbody></table>"
}