{
  "headers": [],
  "rows": [
    [
      "Parameter",
      "Description"
    ],
    [
      "General description",
      "This license is designed for company employees who to perform one type of tasks in Creatio. For example, send requests to the HR department. Users can access only one section  fully as well as read data fromKnowledge basesection and some lookups of your choice. Different user groups can have different sections available. This license type is most suitable for automation of internal processes."
    ],
    [
      "Key benefits",
      "No restrictions for features within the available section. Users can read data fromKnowledge basesections and some lookups of your choice."
    ],
    [
      "Feature restrictions",
      "Users have access to a single section.Chats, email synchronization, and telephony are not available."
    ],
    [
      "App creation and customization",
      "Not available"
    ],
    [
      "User type",
      "Сompany employees"
    ],
    [
      "Available for Creatio version",
      "8.1.1 and later"
    ],
    [
      "Access to purchased composable apps without issuing a license",
      "Yes"
    ],
    [
      "Access to Creatio mobile app",
      "Yes"
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Parameter</p></th><th><p>Description</p></th></tr><tr><td><p>General description</p></td><td><p>This license is designed for company employees who to perform one type of tasks in Creatio. For example, send requests to the HR department. Users can access only one section  fully as well as read data from <strong>Knowledge base</strong> section and some lookups of your choice. Different user groups can have different sections available. This license type is most suitable for automation of internal processes.</p></td></tr><tr><td><p>Key benefits</p></td><td><p>No restrictions for features within the available section. Users can read data from <strong>Knowledge base</strong> sections and some lookups of your choice.</p></td></tr><tr><td><p>Feature restrictions</p></td><td><ul>\n<li>Users have access to a single section.</li>\n<li>Chats, email synchronization, and telephony are not available.</li>\n</ul></td></tr><tr><td><p>App creation and customization</p></td><td><p>Not available</p></td></tr><tr><td><p>User type</p></td><td><p>Сompany employees</p></td></tr><tr><td><p>Available for Creatio version</p></td><td><p>8.1.1 and later</p></td></tr><tr><td><p>Access to purchased composable apps without issuing a license</p></td><td><p>Yes</p></td></tr><tr><td><p>Access to Creatio mobile app</p></td><td><p>Yes</p></td></tr></tbody></table>"
}