{
  "headers": [],
  "rows": [
    [
      "Service",
      "The service provided under the selected agreement."
    ],
    [
      "Response time",
      "Estimated response and resolution time used for processing service-related cases under the corresponding service agreement. Out of the box, Creatio populates the fields using the response and resolution time values specified on the service page of theServicessection. However, you can set other values for the selected service. Creatio will use the entered data to calculate the response and resolution time values for cases under the selected service agreement."
    ],
    [
      "Resolution time"
    ],
    [
      "Status",
      "Status of the service provided under the selected service agreement."
    ],
    [
      "Calendar",
      "The calendar that is used for providing services under the selected service agreement. If this field is empty, Creatio will calculate the case-related response and resolution time values using the calendar specified in theCalendarfield of the service agreement page."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Service</p></td><td><p>The service provided under the selected agreement.</p></td></tr><tr><td><p>Response time</p></td><td rowspan=\"2\"><p>Estimated response and resolution time used for processing service-related cases under the corresponding service agreement. Out of the box, Creatio populates the fields using the response and resolution time values specified on the service page of the <a href=\"https://academy.creatio.com/documents?id=1061\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Services</strong> section</a>. However, you can set other values for the selected service. Creatio will use the entered data to calculate the response and resolution time values for cases under the selected service agreement.</p></td></tr><tr><td><p>Resolution time</p></td></tr><tr><td><p>Status</p></td><td><p>Status of the service provided under the selected service agreement.</p></td></tr><tr><td><p>Calendar</p></td><td><p>The calendar that is used for providing services under the selected service agreement. If this field is empty, Creatio will calculate the case-related response and resolution time values using the calendar specified in the <strong>Calendar</strong> field of the service agreement page.</p></td></tr></tbody></table>"
}