{
  "headers": [],
  "rows": [
    [
      "Project",
      "The name of the current project. This is a non-editable field."
    ],
    [
      "Name",
      "Resource name. For example, an employee's name or role in the project: \"Analyst,\" \"Developer,\" or \"Designer.\" The field is required."
    ],
    [
      "Contact",
      "A Creatio contact who will work with the project. The field is required."
    ],
    [
      "Expected working time, h",
      "Employee's planned working hours within the project. The field is non-editable and is calculated by the system automatically as a sum of all planned working hours of the project tasks within the project. Planned working time for the project task is stored on theResourcesdetail."
    ],
    [
      "Actual working time, h",
      "The number of hours actually spent on the project by the employee. This is a non-editable field. TheCalculate actual working timeaction automatically calculates the value for this field."
    ],
    [
      "Wage",
      "The prime cost of the resource for the company. The field is filled in automatically if the external fee specified on theWagesdetail for the selected contact is valid at the project start date."
    ],
    [
      "External fee",
      "Cost of employee's work for the customer. The field is filled in automatically if an external fee, valid at the project start date, is specified on theExternal feesdetail for the selected contact."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Project</p></td><td><p>The name of the current project. This is a non-editable field.</p></td></tr><tr><td><p>Name</p></td><td><p>Resource name. For example, an employee's name or role in the project: \"Analyst,\" \"Developer,\" or \"Designer.\" The field is required.</p></td></tr><tr><td><p>Contact</p></td><td><p>A Creatio contact who will work with the project. The field is required.</p></td></tr><tr><td><p>Expected working time, h</p></td><td><p>Employee's planned working hours within the project. The field is non-editable and is calculated by the system automatically as a sum of all planned working hours of the project tasks within the project. Planned working time for the project task is stored on the <strong>Resources</strong> detail.</p></td></tr><tr><td><p>Actual working time, h</p></td><td><p>The number of hours actually spent on the project by the employee. This is a non-editable field. The <strong>Calculate actual working time</strong> action automatically calculates the value for this field.</p></td></tr><tr><td><p>Wage</p></td><td><p>The prime cost of the resource for the company. The field is filled in automatically if the external fee specified on the <strong>Wages</strong> detail for the selected contact is valid at the project start date.</p></td></tr><tr><td><p>External fee</p></td><td><p>Cost of employee's work for the customer. The field is filled in automatically if an external fee, valid at the project start date, is specified on the <strong>External fees</strong> detail for the selected contact.</p></td></tr></tbody></table>"
}