{
  "headers": [],
  "rows": [
    [
      "Indicator type",
      "Select the type of the financial indicator, for example, \"Revenue\" or \"Number of open accounts\". The field is required. To add a new indicator to the lookup, click, then clickNewin the dialog box. Specify the name of the indicator on the page that opens and clickSaveto apply the changes."
    ],
    [
      "Value",
      "Specify a numeric value of the financial indicator, for example, the amount of funds."
    ],
    [
      "Currency",
      "Select the currency that the amount of funds is specified in, for example, \"Euro.\""
    ],
    [
      "Type of value",
      "Select the value type of the financial indicator, for example, \"Actual\" or \"Planned.\" The field is required."
    ],
    [
      "Time period",
      "Specify the time period of the financial indicator. Select the value from the time period lookup. The field is filled in automatically if the values specified in theStart dateandEnd datefields match a period specified in the lookup. If the lookup does not contain the needed time period, you can add it manually. To add a period to the lookup, click, thenNewin the dialog box. Populate the required fields on the page that opens and clickSaveto apply the changes. You can also add a time period when saving the financial indicator page if the values in theStart dateandEnd datefields do not match any period specified in the lookup. The system will ask you to confirm adding the time period."
    ],
    [
      "Start date",
      "Populate the start and end dates of the period. These required fields are populated automatically when a value is selected in theTime periodfield. Once theTime periodfield is filled in, the fields become non-editable."
    ],
    [
      "End date"
    ],
    [
      "Time period type",
      "The field is populated automatically based on the period specified in theStart dateandEnd datefields. The field is non-editable if theTime periodfield is filled in."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Indicator type</p></td><td><p>Select the type of the financial indicator, for example, \"Revenue\" or \"Number of open accounts\". The field is required. To add a new indicator to the lookup, click <img alt=\"btn_com_lookup.png\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/sites/default/files/documents/docs/product/bpm'online%20bank%20sales/bank%20sales/7.12.0/BPMonlineHelp/section_financial_indicators/btn_com_lookup.png\"/>, then click <strong>New</strong> in the dialog box. Specify the name of the indicator on the page that opens and click <strong>Save</strong> to apply the changes.</p></td></tr><tr><td><p>Value</p></td><td><p>Specify a numeric value of the financial indicator, for example, the amount of funds.</p></td></tr><tr><td><p>Currency</p></td><td><p>Select the currency that the amount of funds is specified in, for example, \"Euro.\"</p></td></tr><tr><td><p>Type of value</p></td><td><p>Select the value type of the financial indicator, for example, \"Actual\" or \"Planned.\" The field is required.</p></td></tr><tr><td><p>Time period</p></td><td><p>Specify the time period of the financial indicator. Select the value from the time period lookup. The field is filled in automatically if the values specified in the <strong>Start date</strong> and <strong>End date</strong> fields match a period specified in the lookup. If the lookup does not contain the needed time period, you can add it manually. To add a period to the lookup, click <img alt=\"btn_com_lookup00001.png\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/sites/default/files/documents/docs/product/bpm'online%20bank%20sales/bank%20sales/7.12.0/BPMonlineHelp/section_financial_indicators/btn_com_lookup00001.png\"/>, then <strong>New</strong> in the dialog box. Populate the required fields on the page that opens and click <strong>Save</strong> to apply the changes. You can also add a time period when saving the financial indicator page if the values in the <strong>Start date</strong> and <strong>End date</strong> fields do not match any period specified in the lookup. The system will ask you to confirm adding the time period.</p></td></tr><tr><td><p>Start date</p></td><td colspan=\"1\" rowspan=\"2\"><p>Populate the start and end dates of the period. These required fields are populated automatically when a value is selected in the <strong>Time period</strong> field. Once the <strong>Time period</strong> field is filled in, the fields become non-editable.</p></td></tr><tr><td><p>End date</p></td></tr><tr><td><p>Time period type</p></td><td><p>The field is populated automatically based on the period specified in the <strong>Start date</strong> and <strong>End date</strong> fields. The field is non-editable if the <strong>Time period</strong> field is filled in.</p></td></tr></tbody></table>"
}