{
  "headers": [],
  "rows": [
    [
      "Parameter",
      "Value"
    ],
    [
      "Start mode",
      "Campaign start/stop options. You can start and stop campaigns manually or set up automatic start and end of a campaign at the specified time.\"manual\": the campaign will be started/stopped manually by clicking theStart campaign/Stop campaignbutton. Use this option for testing purposes or when you want full control over the flow progress.\"at the specified time\": select this option to start/stop the campaign automatically at the specific date and time. Creatio displays the start/end time of a campaign in the time zone of the user who created the campaign. Use this option when you need to run the campaign at specific time periods, such as for promotions or during times of increased user activity.\nSelecting this option enables additionalScheduled start date/Scheduled end datefields where you can specify the scheduled start and end time."
    ],
    [
      "End mode"
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Parameter</p></td><td><p>Value</p></td></tr><tr><td><p>Start mode</p></td><td rowspan=\"2\"><p>Campaign start/stop options. You can start and stop campaigns manually or set up automatic start and end of a campaign at the specified time.</p><ul>\n<li>\"manual\": the campaign will be started/stopped manually by clicking the <strong>Start campaign</strong> / <strong>Stop campaign</strong> button. Use this option for testing purposes or when you want full control over the flow progress.</li>\n<li>\"at the specified time\": select this option to start/stop the campaign automatically at the specific date and time. Creatio displays the start/end time of a campaign in the time zone of the user who created the campaign. Use this option when you need to run the campaign at specific time periods, such as for promotions or during times of increased user activity.\nSelecting this option enables additional <strong>Scheduled start date</strong> / <strong>Scheduled end date</strong> fields where you can specify the scheduled start and end time.</li>\n</ul></td></tr><tr><td><p>End mode</p></td></tr></tbody></table>"
}