{
  "headers": [],
  "rows": [
    [
      "Photo",
      "Employee’s photo. Photos are pulled from the corresponding contact pages. Owner photos can only be changed on the correspondingcontact page."
    ],
    [
      "Full name",
      "First and last name of the employee. The field displays information from the contact page. If you change the name on the employee page, the data on the contact page will also be updated."
    ],
    [
      "Position",
      "Employee's current position (e.g. \"Director\" or \"Head of Department\"). The field is populated with theEmployee jobslookup values."
    ],
    [
      "Full job title",
      "The field is populated automatically – it duplicates the title selected in theEmployee jobslookup. If necessary, the title may be edited."
    ],
    [
      "Organizational unit",
      "Company’s organizational unit where the employee works. The field is populated with theOrganization structure itemslookup values. If the manager of the organizational unit is specified in the lookup, their data will be automatically displayed in the manager’s profile on the employee's page."
    ],
    [
      "Account",
      "The employer’s account name is specified in this field. You may only select the accounts with the \"Our Company\" type. If you update this field, the account field of the contact page will also be updated."
    ],
    [
      "Business phone",
      "Employee's business phone number. The field displays theCommunication optionsdetail value of theContact infotab of the employee and contact pages."
    ],
    [
      "Email",
      "Employee's email address. The field displays theCommunication optionsdetail value of theContact infotab of the employee and contact pages."
    ],
    [
      "Birthdate",
      "Employee's birth date. The field displays theNoteworthy eventsdetail value of theContact infotab of the employee and contact pages."
    ],
    [
      "Gender",
      "Employee’s gender. The field displays the value of theContact infotab of the contact page. This field can’t be edited on the employee page."
    ],
    [
      "Owner",
      "The Creatio user who is the author of this record in theEmployeessection and maintains the information about this employee. The field is populated automatically once the record is created."
    ]
  ],
  "caption": "",
  "html": "<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td><p>Photo</p></td><td><p>Employee’s photo. Photos are pulled from the corresponding contact pages. Owner photos can only be changed on the corresponding <a href=\"https://academy.creatio.com/documents?id=1002\" rel=\"noopener noreferrer\" target=\"_blank\">contact page</a>.</p></td></tr><tr><td><p>Full name</p></td><td><p>First and last name of the employee. The field displays information from the contact page. If you change the name on the employee page, the data on the contact page will also be updated.</p></td></tr><tr><td><p>Position</p></td><td><p>Employee's current position (e.g. \"Director\" or \"Head of Department\"). The field is populated with the <strong>Employee jobs</strong> lookup values.</p></td></tr><tr><td><p>Full job title</p></td><td><p>The field is populated automatically – it duplicates the title selected in the <strong>Employee jobs</strong> lookup. If necessary, the title may be edited.</p></td></tr><tr><td><p>Organizational unit</p></td><td><p>Company’s organizational unit where the employee works. The field is populated with the <strong>Organization structure items</strong> lookup values. If the manager of the organizational unit is specified in the lookup, their data will be automatically displayed in the manager’s profile on the employee's page.</p></td></tr><tr><td><p>Account</p></td><td><p>The employer’s account name is specified in this field. You may only select the accounts with the \"Our Company\" type. If you update this field, the account field of the contact page will also be updated.</p></td></tr><tr><td><p>Business phone</p></td><td><p>Employee's business phone number. The field displays the <strong>Communication options</strong> detail value of the <strong>Contact info</strong> tab of the employee and contact pages.</p></td></tr><tr><td><p>Email</p></td><td><p>Employee's email address. The field displays the <strong>Communication options</strong> detail value of the <strong>Contact info</strong> tab of the employee and contact pages.</p></td></tr><tr><td><p>Birthdate</p></td><td><p>Employee's birth date. The field displays the <strong>Noteworthy events</strong> detail value of the <strong>Contact info</strong> tab of the employee and contact pages.</p></td></tr><tr><td><p>Gender</p></td><td><p>Employee’s gender. The field displays the value of the <strong>Contact info</strong> tab of the contact page. This field can’t be edited on the employee page.</p></td></tr><tr><td><p>Owner</p></td><td><p>The Creatio user who is the author of this record in the <strong>Employees</strong> section and maintains the information about this employee. The field is populated automatically once the record is created.</p></td></tr></tbody></table>"
}