{
  "headers": [],
  "rows": [
    [
      "Title",
      "Name of the service agreement."
    ],
    [
      "Type",
      "Type of service agreement:SLA: service level agreement. Use this type to define the service parameters for the end users.OLA: operational level agreement. Use this type to indicate the internal service agreements of your company. For example, the agreements between departments or employee groups.UC: underpinning contract. These are the agreements between your company and its suppliers. If you select the \"UC\" type on theContract provisionstab"
    ],
    [
      "Status",
      "Current status of the service agreement, for example, \"New\" or \"Active\"."
    ],
    [
      "Start/End",
      "The start and end dates of the service agreement validity."
    ],
    [
      "Calendar",
      "The calendar that determines workdays and business hours of the support team. Creatio uses calendars tocalculate the response and resolution timefor service-related cases. Out of the box, the field is populated with the value specified in the \"Base calendar\" (BaseCalendar) system setting. Use theCalendarslookup to set up custom calendars. Learn more:Manage lookup values."
    ],
    [
      "Owner",
      "Name of the user responsible for managing and updating information about the service agreement."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Title</p></td><td><p>Name of the service agreement.</p></td></tr><tr><td><p>Type</p></td><td><p>Type of service agreement:</p><ul>\n<li>SLA: service level agreement. Use this type to define the service parameters for the end users.</li>\n<li>OLA: operational level agreement. Use this type to indicate the internal service agreements of your company. For example, the agreements between departments or employee groups.</li>\n<li>UC: underpinning contract. These are the agreements between your company and its suppliers. If you select the \"UC\" type on the <strong>Contract provisions</strong> tab</li>\n</ul></td></tr><tr><td><p>Status</p></td><td><p>Current status of the service agreement, for example, \"New\" or \"Active\".</p></td></tr><tr><td><p>Start/End</p></td><td><p>The start and end dates of the service agreement validity.</p></td></tr><tr><td><p>Calendar</p></td><td><p>The calendar that determines workdays and business hours of the support team. Creatio uses calendars to <a href=\"https://academy.creatio.com/documents?id=1552\" rel=\"noopener noreferrer\" target=\"_blank\">calculate the response and resolution time</a> for service-related cases. Out of the box, the field is populated with the value specified in the \"Base calendar\" (BaseCalendar) system setting. Use the <strong>Calendars</strong> lookup to set up custom calendars. Learn more: <a href=\"https://academy.creatio.com/documents?id=271\" rel=\"noopener noreferrer\" target=\"_blank\">Manage lookup values</a>.</p></td></tr><tr><td><p>Owner</p></td><td><p>Name of the user responsible for managing and updating information about the service agreement.</p></td></tr></tbody></table>"
}