{
  "headers": [],
  "rows": [
    [
      "Check-in",
      "Creatio receives GPS coordinates of the sales rep's location and the visit status is changed to \"In progress\"."
    ],
    [
      "Presentation",
      "Opens a PowerPoint or PDF presentation on the sales rep's mobile device (the presentation must be added to theAttachments and notesdetail of the visit record in theActivitiessection). If several presentations have been added to the detail, the sales rep will have to select the needed one."
    ],
    [
      "Order placement",
      "Creates a new order for the sales outlet account and opens the product selection page on the sales rep's mobile device."
    ],
    [
      "SKU Monitoring",
      "Opens the SKU monitoring window for the sales rep to enter changes in SKU (stock-keeping units), specify whether the products are on display in the sales outlet. The sales rep’s mobile device will display the SKU monitoring window."
    ],
    [
      "Check-out",
      "Creatio receives the GPS coordinates of the sales rep's location and the visit status is changed to \"Completed\"."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>Check-in</p></td><td><p>Creatio receives GPS coordinates of the sales rep's location and the visit status is changed to \"In progress\".</p></td></tr><tr><td><p>Presentation</p></td><td><p>Opens a PowerPoint or PDF presentation on the sales rep's mobile device (the presentation must be added to the <strong>Attachments and notes</strong> detail of the visit record in the <strong>Activities</strong> section). If several presentations have been added to the detail, the sales rep will have to select the needed one.</p></td></tr><tr><td><p>Order placement</p></td><td><p>Creates a new order for the sales outlet account and opens the product selection page on the sales rep's mobile device.</p></td></tr><tr><td><p>SKU Monitoring</p></td><td><p>Opens the SKU monitoring window for the sales rep to enter changes in SKU (stock-keeping units), specify whether the products are on display in the sales outlet. The sales rep’s mobile device will display the SKU monitoring window.</p></td></tr><tr><td><p>Check-out</p></td><td><p>Creatio receives the GPS coordinates of the sales rep's location and the visit status is changed to \"Completed\".</p></td></tr></tbody></table>"
}