{
  "headers": [],
  "rows": [
    [
      "Country",
      "The location of the configuration item. TheState/provinceandCityfields are connected to theCountryfield. For example, theCountryfield will be populated automatically when you populate theCityfield. Similarly, if you enter a state, Creatio will populate theCountryfield automatically. When you populate theCountryfield, theStateandCityfields will display only those states and cities that correspond to the selected country. You can associate a state/province with a certain country in theStates/provinceslookup and associate a city with a country – in theCitieslookup."
    ],
    [
      "Region"
    ],
    [
      "City"
    ],
    [
      "Street"
    ],
    [
      "Start",
      "The time when the configuration item is on the location."
    ],
    [
      "End"
    ],
    [
      "Address",
      "The full address of the configuration item location. Creatio populates the field automatically based on the information in theCountry,Region,City,Streetfields/ You can change the field value manually."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Country</p></td><td rowspan=\"4\"><p>The location of the configuration item. The <strong>State/province</strong> and <strong>City</strong> fields are connected to the <strong>Country</strong> field. For example, the <strong>Country</strong> field will be populated automatically when you populate the <strong>City</strong> field. Similarly, if you enter a state, Creatio will populate the <strong>Country</strong> field automatically. When you populate the <strong>Country</strong> field, the <strong>State</strong> and <strong>City</strong> fields will display only those states and cities that correspond to the selected country. You can associate a state/province with a certain country in the <strong>States/provinces</strong> lookup and associate a city with a country – in the <strong>Cities</strong> lookup.</p></td></tr><tr><td><p>Region</p></td></tr><tr><td><p>City</p></td></tr><tr><td><p>Street</p></td></tr><tr><td><p>Start</p></td><td rowspan=\"2\"><p>The time when the configuration item is on the location.</p></td></tr><tr><td><p>End</p></td></tr><tr><td><p>Address</p></td><td><p>The full address of the configuration item location. Creatio populates the field automatically based on the information in the <strong>Country</strong>, <strong>Region</strong>, <strong>City</strong>, <strong>Street</strong> fields/ You can change the field value manually.</p></td></tr></tbody></table>"
}