{
  "headers": [],
  "rows": [
    [
      "Title",
      "The goal of the activity, for example, \"Prepare documents\" or \"Present an offer.\""
    ],
    [
      "Start",
      "The date and time when the activity should be started and finished. By default, theDuefield value is set to 30 days after theStartfield value. Use theicon when planning activities for participants in different time zones."
    ],
    [
      "Due"
    ],
    [
      "Status",
      "Activity status. For example, \"In progress\" or \"Completed.\""
    ],
    [
      "Role",
      "Any user with the role will be able to complete the task."
    ],
    [
      "Owner",
      "The user who is responsible for completing the activity. If you specify a role on the previous step, you will be able to select only the users with the corresponding role in this field. If you leave theRolefield empty, you will be able to specify any system user in theOwnerfield."
    ],
    [
      "Category",
      "Activity category. For example, \"Meeting\" or \"Paperwork.\""
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Title</p></td><td><p>The goal of the activity, for example, \"Prepare documents\" or \"Present an offer.\"</p></td></tr><tr><td><p>Start</p></td><td rowspan=\"2\"><p>The date and time when the activity should be started and finished. By default, the <strong>Due</strong> field value is set to 30 days after the <strong>Start</strong> field value. Use the <img alt=\"timezone_symbol.png\" class=\"img_ev3q\" decoding=\"async\" loading=\"lazy\" src=\"https://academy.creatio.com/sites/default/files/documents/docs/product/bpm'online%20sales/enterprise/7.16.0/BPMonlineHelp/specs_activities/timezone_symbol.png\"/> icon when planning activities for participants in different time zones.</p></td></tr><tr><td><p>Due</p></td></tr><tr><td><p>Status</p></td><td><p>Activity status. For example, \"In progress\" or \"Completed.\"</p></td></tr><tr><td><p>Role</p></td><td><p>Any user with the role will be able to complete the task.</p></td></tr><tr><td><p>Owner</p></td><td><p>The user who is responsible for completing the activity. If you specify a role on the previous step, you will be able to select only the users with the corresponding role in this field. If you leave the <strong>Role</strong> field empty, you will be able to specify any system user in the <strong>Owner</strong> field.</p></td></tr><tr><td><p>Category</p></td><td><p>Activity category. For example, \"Meeting\" or \"Paperwork.\"</p></td></tr></tbody></table>"
}