{
  "headers": [],
  "rows": [
    [
      "Address type",
      "Type of address of an employee, e.g. \"Home\" or \"Work.\" Defined when a record is added. You can change it afterward."
    ],
    [
      "Address",
      "Street, building number, and other details of an employee's address."
    ],
    [
      "City",
      "Employee location. TheState/provinceandCityfields are connected to theCountryfield. For example, theCountryfield will be populated automatically when you populate theCityfield. Similarly, if you enter a province in theState/province, theCountryfield will be populated automatically. When you fill in theCountryfield, theState/provinceandCityfields will display only those regions and cities, which correspond to the selected country. You can associate a region with a certain country in theStates/provinceslookup, and associate a city with a country – in theCitieslookup."
    ],
    [
      "Country"
    ],
    [
      "ZIP",
      "Postal code of an employee."
    ]
  ],
  "caption": "",
  "html": "<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td><p>Address type</p></td><td><p>Type of address of an employee, e.g. \"Home\" or \"Work.\" Defined when a record is added. You can change it afterward.</p></td></tr><tr><td><p>Address</p></td><td><p>Street, building number, and other details of an employee's address.</p></td></tr><tr><td><p>City</p></td><td colspan=\"1\" rowspan=\"2\"><p>Employee location. The <strong>State/province</strong> and <strong>City</strong> fields are connected to the <strong>Country</strong> field. For example, the <strong>Country</strong> field will be populated automatically when you populate the <strong>City</strong> field. Similarly, if you enter a province in the <strong>State/province</strong>, the <strong>Country</strong> field will be populated automatically. When you fill in the <strong>Country</strong> field, the <strong>State/province</strong> and <strong>City</strong> fields will display only those regions and cities, which correspond to the selected country. You can associate a region with a certain country in the <strong>States/provinces</strong> lookup, and associate a city with a country – in the <strong>Cities</strong> lookup.</p></td></tr><tr><td><p>Country</p></td></tr><tr><td><p>ZIP</p></td><td><p>Postal code of an employee.</p></td></tr></tbody></table>"
}