{
  "headers": [],
  "rows": [
    [
      "Way to eliminate cyclic chains",
      "Example"
    ],
    [
      "If you use the wrong elements by mistake, which caused a cyclic chain, you can delete them or replace them with new elements that do not cause a cyclic chain. After that, save the changes to readd the dependencies.Objects or business processes that use methods andScript taskelement cannot be published before you eliminate the cyclic chain issue.",
      "TheRead databusiness process element reads a redundant column or uses it in filtering conditions. To eliminate the cyclic chain, simply delete the column and save the business process."
    ],
    [
      "If the elements that cause a cyclic chain are not critical to the app operation or you made the changes by mistake, simply revert the changes to eliminate all newly introduced cyclic chains.",
      "You replaced theUsrObjectobject both in the \"UserApplication\" app package and theCustompackage. TheColumnobject column created in theCustompackage has a differentNameproperty in the \"UserApplication\" package. Since you made the changes in the dependent package, this caused a cyclic chain. To eliminate it, simply return the property to its original state and save the updated object."
    ],
    [
      "If you cannot edit or delete the elements that caused a cyclic chain, move them:to the package that contains the dependent schemas of the elementsto the package from which the package that contains the schemas inherits.Learn more in a different section:Move the functionality between packages.",
      "A cyclic chain was made when you used theUsrLookuplookup of theCustompackage in the \"UserApplication\" app. The lookup is the data source for theUsrEntityobject’s lookup column. To fix the error, move theUsrLookuplookup to the \"UserApplication\" app package."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Way to eliminate cyclic chains</p></th><th><p>Example</p></th></tr><tr><td><p>If you use the wrong elements by mistake, which caused a cyclic chain, you can delete them or replace them with new elements that do not cause a cyclic chain. After that, save the changes to readd the dependencies.<br/>\n<!-- -->Objects or business processes that use methods and <strong>Script task</strong> element cannot be published before you eliminate the cyclic chain issue.</p></td><td><p>The <strong>Read data</strong> business process element reads a redundant column or uses it in filtering conditions. To eliminate the cyclic chain, simply delete the column and save the business process.</p></td></tr><tr><td><p>If the elements that cause a cyclic chain are not critical to the app operation or you made the changes by mistake, simply revert the changes to eliminate all newly introduced cyclic chains.</p></td><td><p>You replaced the <strong>UsrObject</strong> object both in the \"UserApplication\" app package and the <code>Custom</code> package. The <strong>Column</strong> object column created in the <code>Custom</code> package has a different <strong>Name</strong> property in the \"UserApplication\" package. Since you made the changes in the dependent package, this caused a cyclic chain. To eliminate it, simply return the property to its original state and save the updated object.</p></td></tr><tr><td><p>If you cannot edit or delete the elements that caused a cyclic chain, move them:</p><ul>\n<li>to the package that contains the dependent schemas of the elements</li>\n<li>to the package from which the package that contains the schemas inherits.</li>\n</ul><p>Learn more in a different section: <a href=\"https://academy.creatio.com/documents?id=2419&amp;anchor=title-2534-8\" rel=\"noopener noreferrer\" target=\"_blank\">Move the functionality between packages</a>.</p></td><td><p>A cyclic chain was made when you used the <strong>UsrLookup</strong> lookup of the <code>Custom</code> package in the \"UserApplication\" app. The lookup is the data source for the <strong>UsrEntity</strong> object’s lookup column. To fix the error, move the <strong>UsrLookup</strong> lookup to the \"UserApplication\" app package.</p></td></tr></tbody></table>"
}