{
  "headers": [],
  "rows": [
    [
      "Object",
      "Editing or otherwise modifying a record in this object will activate theSignalelement."
    ],
    [
      "Which event should trigger the signal?",
      "Select the \"Record modified\" event from the drop-down list. Whenever a column value changes in the specified object, the signal will be generated and the process will start."
    ],
    [
      "Changes expected",
      "You can start business process on any changes in the target object, or monitor only specific fields for changes:Select \"In any field\" to run business process automatically, upon changes in any field of the selected objectSelect \"In any of the selected fields\" to run business process automatically, upon changes in specific fields only. Click+Add columnand select the needed fields. For example, a business process can run only if an activity status is modified. If a change occurs in a different column (e.g. activity assignee is changed), the process will not start."
    ],
    [
      "The modified record must meet the filter conditions",
      "If the modified record does not meet the filter conditions, the process will not start. For example, you can run a process only if the status of an activity is changed to \"Closed.\""
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p>Object</p></td><td><p>Editing or otherwise modifying a record in this object will activate the <strong>Signal</strong> element.</p></td></tr><tr><td><p>Which event should trigger the signal?</p></td><td><p>Select the \"Record modified\" event from the drop-down list. Whenever a column value changes in the specified object, the signal will be generated and the process will start.</p></td></tr><tr><td><p>Changes expected</p></td><td><p>You can start business process on any changes in the target object, or monitor only specific fields for changes:</p><ul>\n<li>Select \"In any field\" to run business process automatically, upon changes in any field of the selected object</li>\n<li>Select \"In any of the selected fields\" to run business process automatically, upon changes in specific fields only. Click <strong>+Add column</strong> and select the needed fields. For example, a business process can run only if an activity status is modified. If a change occurs in a different column (e.g. activity assignee is changed), the process will not start.</li>\n</ul></td></tr><tr><td><p>The modified record must meet the filter conditions</p></td><td><p>If the modified record does not meet the filter conditions, the process will not start. For example, you can run a process only if the status of an activity is changed to \"Closed.\"</p></td></tr></tbody></table>"
}