{
  "headers": [],
  "rows": [
    [
      "Account",
      "Company or person connected to the activity. If you select a contact, Creatio will populate theAccountfield with the company specified on the contact page."
    ],
    [
      "Contact"
    ],
    [
      "Contract",
      "Contract connected to the activity."
    ],
    [
      "Opportunity",
      "An opportunity whose part the activity is. If you select an opportunity, Creatio will populate theAccountandContactfields with the data from the fields of the selected opportunity."
    ],
    [
      "Document",
      "Document connected to the activity."
    ],
    [
      "Invoice",
      "Invoice connected to the activity."
    ],
    [
      "Order",
      "Order connected to the activity."
    ],
    [
      "Lead",
      "A potential customer for whom you create the activity. If you select a lead, Creatio will populate theAccountandContactfields with values from the lead page."
    ],
    [
      "Project",
      "The project connected to the task. If you select a project, Creatio will populate theContact,Account, andOpportunityfields with the data from the fields of the selected project."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Account</p></td><td rowspan=\"2\"><p>Company or person connected to the activity. If you select a contact, Creatio will populate the <strong>Account</strong> field with the company specified on the contact page.</p></td></tr><tr><td><p>Contact</p></td></tr><tr><td><p>Contract</p></td><td><p>Contract connected to the activity.</p></td></tr><tr><td><p>Opportunity</p></td><td><p>An opportunity whose part the activity is. If you select an opportunity, Creatio will populate the <strong>Account</strong> and <strong>Contact</strong> fields with the data from the fields of the selected opportunity.</p></td></tr><tr><td><p>Document</p></td><td><p>Document connected to the activity.</p></td></tr><tr><td><p>Invoice</p></td><td><p>Invoice connected to the activity.</p></td></tr><tr></tr><tr><td><p>Order</p></td><td><p>Order connected to the activity.</p></td></tr><tr><td><p>Lead</p></td><td><p>A potential customer for whom you create the activity. If you select a lead, Creatio will populate the <strong>Account</strong> and <strong>Contact</strong> fields with values from the lead page.</p></td></tr><tr><td><p>Project</p></td><td><p>The project connected to the task. If you select a project, Creatio will populate the <strong>Contact</strong>, <strong>Account</strong>, and <strong>Opportunity</strong> fields with the data from the fields of the selected project.</p></td></tr><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table>"
}