{
  "headers": [],
  "rows": [
    [
      "Name",
      "Name of the configuration item."
    ],
    [
      "Category",
      "Configuration item category, for example, \"Peripherals\" or \"Software.\""
    ],
    [
      "Type",
      "Configuration item type, for example, \"Printer\" or \"Operating system.\" A list of possible values for this field depends on the selected configuration item. Configuration item type dependency on the category is defined in theCI typeslookup."
    ],
    [
      "Model",
      "Model of the configuration item. A list of possible values for this field depends on the type of the selected configuration item. Configuration item model dependency on the category is defined in theCI modelslookup."
    ],
    [
      "Status",
      "The current status of the configuration item, for example, \"Active\" or \"Under maintenance.\""
    ],
    [
      "Inventory number",
      "Configuration item inventory number defined by the company to manage infrastructure items."
    ],
    [
      "Serial number",
      "The serial number of the configuration item as specified by the manufacturer."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Name</p></td><td><p>Name of the configuration item.</p></td></tr><tr><td><p>Category</p></td><td><p>Configuration item category, for example, \"Peripherals\" or \"Software.\"</p></td></tr><tr><td><p>Type</p></td><td><p>Configuration item type, for example, \"Printer\" or \"Operating system.\" A list of possible values for this field depends on the selected configuration item. Configuration item type dependency on the category is defined in the <strong>CI types</strong> lookup.</p></td></tr><tr><td><p>Model</p></td><td><p>Model of the configuration item. A list of possible values for this field depends on the type of the selected configuration item. Configuration item model dependency on the category is defined in the <strong>CI models</strong> lookup.</p></td></tr><tr><td><p>Status</p></td><td><p>The current status of the configuration item, for example, \"Active\" or \"Under maintenance.\"</p></td></tr><tr><td><p>Inventory number</p></td><td><p>Configuration item inventory number defined by the company to manage infrastructure items.</p></td></tr><tr><td><p>Serial number</p></td><td><p>The serial number of the configuration item as specified by the manufacturer.</p></td></tr></tbody></table>"
}