{
  "headers": [],
  "rows": [
    [
      "Session start date",
      "Date and time when the first web action took place."
    ],
    [
      "Session duration",
      "Time between the session start date and time of the last web action, in seconds."
    ],
    [
      "Country",
      "Imported into \"Country\" (string), \"Country Code,\" and \"Country\" (lookup) fields. Creatio selects the lookup value based on the code from theCountrieslookup.You can add custom values to theCountrieslookup manually. Creatio does not add new lookup values if imported data contains values missing from the lookup."
    ],
    [
      "Region",
      "Imported into \"Region\" (string), \"Region Code,\" and \"Region\" (lookup) fields. Creatio selects the lookup value based on the code from theStates/provinceslookup.Creatio does not add new lookup values if imported data contains values missing from the lookup."
    ],
    [
      "City",
      "Imported into \"City\" (string) and \"City\" (lookup) fields. Creatio selects the lookup value based on the English name in theCitieslookup among the values filtered by the specifiedCountriesandStates/provinceslookup values.You can add custom values to the lookup. Creatio does not add new lookup values if imported data contains values missing from the lookup."
    ],
    [
      "Location",
      "Geographic latitude and longtitude imported as a string."
    ],
    [
      "Source",
      "Creatio selects the lookup value from theLead sourceslookup.Imported data is matched to the lookup values based on the following rules, from higher to lower priority:If data includes the utm_source code and the lookup of theSource codeobject maps the tag to aLead sourceslookup record, Creatio populates theSourcefield with the mapped lookup record.To edit the lookup of theSource codeobject, add the lookup manually in theLookupssection.If data includes the utm_campaign code and the lookup of theSource codeobject maps the tag to aLead sourceslookup record, Creatio populates theSourcefield with the mapped lookup record.If the first two rules do not apply, Creatio useslead source identification rules4 and 5.You can add custom values to theLead sourceslookup. Make sure to fill out theDefault channelfield of the lookup record if you add a custom value. Creatio does not add new lookup values if imported data contains values missing from the lookup."
    ],
    [
      "Channel",
      "Creatio selects the lookup value from theLead channelslookup.If the imported data includes the utm_medium code and the lookup of theChannel codeobject maps the tag to aLead channelslookup record, Creatio populates theChannelfield with the mapped lookup record.If the \"Channel\" field is not populated based on channel data, Creatio can populate it based on theLead sourcelookup.To edit the lookup of theChannel codeobject, add the lookup manually in theLookupssection.You can add custom values to theLead channelslookup. Creatio does not add new lookup values if imported data contains values missing from the lookup."
    ],
    [
      "Referrer type and name",
      "Imported into \"Referrer name\" (string) and \"Referrer type\" (lookup) fields. Creatio selects the lookup value based on the \"Matomo code\" field. The \"Referrer name\" (lookup) field is not populated.Developers can add custom values to the lookup. Creatio adds new lookup values if the imported data contains values missing from the lookup."
    ],
    [
      "Referrer keyword",
      "Keywords the user entered into search engine before loading the page referrer URL."
    ],
    [
      "Page referrer URL",
      "URL of the page from which the user went to your landing page."
    ],
    [
      "utm_id",
      "Marketing codes"
    ],
    [
      "utm_source"
    ],
    [
      "utm_medium"
    ],
    [
      "utm_campaign"
    ],
    [
      "utm_term"
    ],
    [
      "utm_content"
    ],
    [
      "Platform",
      "Operating system of the user"
    ],
    [
      "Device",
      ""
    ],
    [
      "IP address",
      ""
    ]
  ],
  "caption": "",
  "html": "<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><thead><tr><td><p><strong>Data type</strong></p></td><td><p><strong>Details</strong></p></td></tr></thead><tbody><tr><td><p><strong>Session start date</strong></p></td><td><p>Date and time when the first web action took place.</p></td></tr><tr><td><p><strong>Session duration</strong></p></td><td><p>Time between the session start date and time of the last web action, in seconds.</p></td></tr><tr><td><p><strong>Country</strong></p></td><td><p>Imported into \"Country\" (string), \"Country Code,\" and \"Country\" (lookup) fields. Creatio selects the lookup value based on the code from the <strong>Countries</strong> lookup.</p><p>You can add custom values to the <strong>Countries</strong> lookup manually. Creatio does not add new lookup values if imported data contains values missing from the lookup.</p></td></tr><tr><td><p><strong>Region</strong></p></td><td><p>Imported into \"Region\" (string), \"Region Code,\" and \"Region\" (lookup) fields. Creatio selects the lookup value based on the code from the <strong>States/provinces</strong> lookup.</p><p>Creatio does not add new lookup values if imported data contains values missing from the lookup.</p></td></tr><tr><td><p><strong>City</strong></p></td><td><p>Imported into \"City\" (string) and \"City\" (lookup) fields. Creatio selects the lookup value based on the English name in the <strong>Cities</strong> lookup among the values filtered by the specified <strong>Countries</strong> and <strong>States/provinces</strong> lookup values.</p><p>You can add custom values to the lookup. Creatio does not add new lookup values if imported data contains values missing from the lookup.</p></td></tr><tr><td><p><strong>Location</strong></p></td><td><p>Geographic latitude and longtitude imported as a string.</p></td></tr><tr><td><p><strong>Source</strong></p></td><td><p>Creatio selects the lookup value from the <strong>Lead sources</strong> lookup.</p><p>Imported data is matched to the lookup values based on the following rules, from higher to lower priority:</p><ol>\n<li>\n<p>If data includes the utm_source code and the lookup of the <strong>Source code</strong> object maps the tag to a <strong>Lead sources</strong> lookup record, Creatio populates the <strong>Source</strong> field with the mapped lookup record.</p>\n<p>To edit the lookup of the <strong>Source code</strong> object, add the lookup manually in the <strong>Lookups</strong> section.</p>\n</li>\n<li>\n<p>If data includes the utm_campaign code and the lookup of the <strong>Source code</strong> object maps the tag to a <strong>Lead sources</strong> lookup record, Creatio populates the <strong>Source</strong> field with the mapped lookup record.</p>\n</li>\n<li>\n<p>If the first two rules do not apply, Creatio uses <a href=\"https://academy.creatio.com/documents?id=1597#title-2960-14\">lead source identification rules</a> 4 and 5.</p>\n</li>\n</ol><p>You can add custom values to the <strong>Lead sources</strong> lookup. Make sure to fill out the <strong>Default channel</strong> field of the lookup record if you add a custom value. Creatio does not add new lookup values if imported data contains values missing from the lookup.</p></td></tr><tr><td><p><strong>Channel</strong></p></td><td><p>Creatio selects the lookup value from the <strong>Lead channels</strong> lookup.</p><p>If the imported data includes the utm_medium code and the lookup of the <strong>Channel code</strong> object maps the tag to a <strong>Lead channels</strong> lookup record, Creatio populates the <strong>Channel</strong> field with the mapped lookup record.</p><p>If the \"Channel\" field is not populated based on channel data, Creatio can populate it based on the <strong>Lead source</strong> lookup.</p><p>To edit the lookup of the <strong>Channel code</strong> object, add the lookup manually in the <strong>Lookups</strong> section.</p><p>You can add custom values to the <strong>Lead channels</strong> lookup. Creatio does not add new lookup values if imported data contains values missing from the lookup.</p></td></tr><tr><td><p><strong>Referrer type and name</strong></p></td><td><p>Imported into \"Referrer name\" (string) and \"Referrer type\" (lookup) fields. Creatio selects the lookup value based on the \"Matomo code\" field. The \"Referrer name\" (lookup) field is not populated.</p><p>Developers can add custom values to the lookup. Creatio adds new lookup values if the imported data contains values missing from the lookup.</p></td></tr><tr><td><p><strong>Referrer keyword</strong></p></td><td><p>Keywords the user entered into search engine before loading the page referrer URL.</p></td></tr><tr><td><p><strong>Page referrer URL</strong></p></td><td><p>URL of the page from which the user went to your landing page.</p></td></tr><tr><td><p><strong>utm_id</strong></p></td><td rowspan=\"6\"><p>Marketing codes</p></td></tr><tr><td><p><strong>utm_source</strong></p></td></tr><tr><td><p><strong>utm_medium</strong></p></td></tr><tr><td><p><strong>utm_campaign</strong></p></td></tr><tr><td><p><strong>utm_term</strong></p></td></tr><tr><td><p><strong>utm_content</strong></p></td></tr><tr><td><p><strong>Platform</strong></p></td><td><p>Operating system of the user</p></td></tr><tr><td><p><strong>Device</strong></p></td><td></td></tr><tr><td><p><strong>IP address</strong></p></td><td></td></tr></tbody></table>"
}