{
  "headers": [],
  "rows": [
    [
      "Business task",
      "Creatio task",
      "Process task"
    ],
    [
      "Schedule a task and make it easily identifiable in the calendar",
      "Create a new record in theActivitiessection with a certain value in theSubjectfield",
      "Manually enter the title of the task that must be created as the value of theWhat should be done?parameter of thePerform taskelement."
    ],
    [
      "Assign a task to the user who started the process",
      "TheOwnerfield of the record in theActivitiessection should be populated with the current user contact",
      "Set the \"Current user contact\" variable as the value of theWho performs the task?parameter of thePerform taskelement."
    ],
    [
      "Email the meeting contact immediately after the meeting has ended",
      "Create a new email whoseTofield will contain the email address of a contact who was specified in theContactfield of the meeting activity",
      "TheToparameter of theSend emailelementmust have the same value as theContactparameter of thePerform taskelement."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Business task</p></th><th><p>Creatio task</p></th><th><p>Process task</p></th></tr><tr><td><p>Schedule a task and make it easily identifiable in the calendar</p></td><td><p>Create a new record in the <strong>Activities</strong> section with a certain value in the <strong>Subject</strong> field</p></td><td><p>Manually enter the title of the task that must be created as the value of the <strong>What should be done?</strong> parameter of the <a href=\"https://academy.creatio.com/documents?id=7009\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Perform task</strong> element</a>.</p></td></tr><tr><td><p>Assign a task to the user who started the process</p></td><td><p>The <strong>Owner</strong> field of the record in the <strong>Activities</strong> section should be populated with the current user contact</p></td><td><p>Set the \"Current user contact\" variable as the value of the <strong>Who performs the task?</strong> parameter of the <strong>Perform task</strong> element.</p></td></tr><tr><td><p>Email the meeting contact immediately after the meeting has ended</p></td><td><p>Create a new email whose <strong>To</strong> field will contain the email address of a contact who was specified in the <strong>Contact</strong> field of the meeting activity</p></td><td><p>The <strong>To</strong> parameter of the <a href=\"https://academy.creatio.com/documents?id=7127\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Send email</strong> element</a> must have the same value as the <strong>Contact</strong> parameter of the <strong>Perform task</strong> element.</p></td></tr></tbody></table>"
}