{
  "headers": [],
  "rows": [
    [
      "Name",
      "Service name."
    ],
    [
      "Status",
      "Current service status. For example, \"Active\" or \"Under testing.\""
    ],
    [
      "Response time unit",
      "The time units used to measure the case response time, e.g., \"Working days,\" \"Calendar days,\" etc."
    ],
    [
      "Resolution time unit",
      "Time units used to measure the case resolution time, e.g., \"Working days,\" \"Calendar days,\" etc."
    ],
    [
      "Owner",
      "The employee responsible for the quality of the provided service. The field is only available forService Creatio, enterprise edition."
    ],
    [
      "Category",
      "The service category, for example, \"Hardware\" or \"Internal support.\" The field is only available forService Creatio, enterprise edition."
    ],
    [
      "Case category",
      "The category that will be assigned to the cases based on this service: \"Incident,\" \"Complaint,\"\"Claim,\" \"Consultation\" (available for TheFinancial Services Creatio, customer journey edition), \"Service request.\" When you create a new case and populate theServicefield, Creatio will specify the selected category in theCategoryfield of thecase page."
    ],
    [
      "Calendar",
      "The calendar that defines the work of the support team. Creatio calculates the response and resolution time for the service-related cases based on the selected calendar. By default, the field is populated with the value specified in the \"Base calendar\" (BaseCalendar) system setting. Custom calendars can be set up in the corresponding lookup"
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Name</p></td><td><p>Service name.</p></td></tr><tr><td><p>Status</p></td><td><p>Current service status. For example, \"Active\" or \"Under testing.\"</p></td></tr><tr><td><p>Response time unit</p></td><td><p>The time units used to measure the case response time, e.g., \"Working days,\" \"Calendar days,\" etc.</p></td></tr><tr><td><p>Resolution time unit</p></td><td><p>Time units used to measure the case resolution time, e.g., \"Working days,\" \"Calendar days,\" etc.</p></td></tr><tr><td><p>Owner</p></td><td><p>The employee responsible for the quality of the provided service. The field is only available for <strong>Service Creatio, enterprise edition</strong>.</p></td></tr><tr><td><p>Category</p></td><td><p>The service category, for example, \"Hardware\" or \"Internal support.\" The field is only available for <strong>Service Creatio, enterprise edition</strong>.</p></td></tr><tr><td><p>Case category</p></td><td><p>The category that will be assigned to the cases based on this service: \"Incident,\" \"Complaint,\"\"Claim,\" \"Consultation\" (available for The <strong>Financial Services Creatio, customer journey edition</strong>), \"Service request.\" When you create a new case and populate the <strong>Service</strong> field, Creatio will specify the selected category in the <strong>Category</strong> field of the <a href=\"https://academy.creatio.com/documents?product=service%20enterprise&amp;ver=7&amp;id=1550\" rel=\"noopener noreferrer\" target=\"_blank\">case page</a>.</p></td></tr><tr><td><p>Calendar</p></td><td><p>The calendar that defines the work of the support team. Creatio calculates the response and resolution time for the service-related cases based on the selected calendar. By default, the field is populated with the value specified in the \"Base calendar\" (BaseCalendar) system setting. Custom calendars can be set up in the corresponding lookup</p></td></tr></tbody></table>"
}