{
  "headers": [],
  "rows": [
    [
      "Database object",
      "The name of the campaign. Populating this field enables accessing the Campaign Designer."
    ],
    [
      "Start mode",
      "Campaign start/stop options: You can start and stop campaigns manually or set up automatic start and end of a campaign at the specified time.\"manual\" – the campaign will be started/stopped manually by clicking theStart campaign/Stop campaignbutton.\"at the specified time\" – select this option to start/stop the campaign automatically at the specific date and time.Selecting this option enables additionalScheduled start date/Scheduled end datefields, where you can specify the scheduled start and end time. Click theSchedule campaignbutton to finalize planning the campaign time frame (Fig. 1)."
    ],
    [
      "End mode"
    ],
    [
      "Owner",
      "Select the employee responsible for the campaign."
    ],
    [
      "utm_campaign",
      "The UTM-mark containing the campaign name. It is used to track the lead sources received as a result of the campaign."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Database object</p></td><td><p>The name of the campaign. Populating this field enables accessing the Campaign Designer.</p></td></tr><tr><td><p>Start mode</p></td><td rowspan=\"2\"><p>Campaign start/stop options: You can start and stop campaigns manually or set up automatic start and end of a campaign at the specified time.</p><ul>\n<li>\"manual\" – the campaign will be started/stopped manually by clicking the <strong>Start campaign</strong> / <strong>Stop campaign</strong> button.</li>\n<li>\"at the specified time\" – select this option to start/stop the campaign automatically at the specific date and time.</li>\n</ul><p>Selecting this option enables additional <strong>Scheduled start date</strong> / <strong>Scheduled end date</strong> fields, where you can specify the scheduled start and end time. Click the <strong>Schedule campaign</strong> button to finalize planning the campaign time frame (Fig. 1).</p></td></tr><tr><td><p>End mode</p></td></tr><tr><td><p>Owner</p></td><td><p>Select the employee responsible for the campaign.</p></td></tr><tr><td><p>utm_campaign</p></td><td><p>The UTM-mark containing the campaign name. It is used to track the lead sources received as a result of the campaign.</p></td></tr></tbody></table>"
}