{
  "headers": [],
  "rows": [
    [
      "Type",
      "Type of the account depending on its relations with your company, such as \"Customer\", \"Partner\" or \"Supplier.\" The account types can be used for filtering in other fields, so we do not recommend deleting the values from theAccount typeslookup."
    ],
    [
      "Owner",
      "The Creatio user, responsible for working with the account."
    ],
    [
      "Category",
      "The category of account defines how important the account is for your company. For example, \"A\" – top importance, \"D\" – low importance."
    ],
    [
      "Industry",
      "The field that the account operates in, for example, \"IT company,\" \"Business services,\" or \"Manufacturing and distribution.\""
    ],
    [
      "Price list",
      "A personal price list is used for orders where the current account is the customer. By default, thePrice listfield is hidden on the account page. You can add the field to a record profile or any of the record tabs (e.g., theGeneral informationtab), using the Section Wizard. Learn more about adding fields to record pages in the \"Set up page fields\" article. You can find the values for thePrice listfield in thePrice listslookup. The prices for each price list are specified in thePricesdetail of thePrices and availabilitytab on the product page. Learn more about using price lists in the \"Manage prices\" article. The field is available in Sales Creatio, commerce edition, and Sales Creatio, enterprise edition."
    ]
  ],
  "caption": "",
  "html": "<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td><p>Type</p></td><td><p>Type of the account depending on its relations with your company, such as \"Customer\", \"Partner\" or \"Supplier.\" The account types can be used for filtering in other fields, so we do not recommend deleting the values from the <strong>Account types</strong> lookup.</p></td></tr><tr><td><p>Owner</p></td><td><p>The Creatio user, responsible for working with the account.</p></td></tr><tr><td><p>Category</p></td><td><p>The category of account defines how important the account is for your company. For example, \"A\" – top importance, \"D\" – low importance.</p></td></tr><tr><td><p>Industry</p></td><td><p>The field that the account operates in, for example, \"IT company,\" \"Business services,\" or \"Manufacturing and distribution.\"</p></td></tr><tr><td><p>Price list</p></td><td><p>A personal price list is used for orders where the current account is the customer. By default, the <strong>Price list</strong> field is hidden on the account page. You can add the field to a record profile or any of the record tabs (e.g., the <strong>General information</strong> tab), using the Section Wizard. Learn more about adding fields to record pages in the \"<a href=\"https://academy.creatio.com/documents?product=administration&amp;ver=7&amp;id=1399\" rel=\"noopener noreferrer\" target=\"_blank\">Set up page fields</a>\" article. You can find the values for the <strong>Price list</strong> field in the <strong>Price lists</strong> lookup. The prices for each price list are specified in the <strong>Prices</strong> detail of the <strong>Prices and availability</strong> tab on the product page. Learn more about using price lists in the \"<a href=\"https://academy.creatio.com/documents?product=enterprise&amp;ver=7&amp;id=2047\" rel=\"noopener noreferrer\" target=\"_blank\">Manage prices</a>\" article. The field is available in Sales Creatio, commerce edition, and Sales Creatio, enterprise edition.</p></td></tr></tbody></table>"
}