{
  "headers": [],
  "rows": [
    [
      "Type",
      "Type: customer, supplier, contact person, or employee. If you populate this field on the previous step, the data will automatically display on theGeneral informationtab."
    ],
    [
      "Owner",
      "Name of the responsible employee."
    ],
    [
      "Title",
      "Honorific for the contact, for example, \"Mr\" or \"Mrs.\""
    ],
    [
      "Gender",
      "Gender of the contact."
    ],
    [
      "Salutation",
      "The preferred way to address the contact."
    ],
    [
      "Preferred language",
      "The language to use by default for automated communications with the contact. Affects the language of email notifications. If no preferred language is set for a contact, the notifications will be sent in English (the default language). The drop-down list of this field contains only languages whose status is set to \"Active\" in theCustomer languageslookup."
    ],
    [
      "Age",
      "Contact age. The field is populated automatically and is grayed out if automatic calculation of contact age is enabled. Creatio calculates a contact’s age based on the value in theBirthdatefield. If theBirthdatefield is empty, the value in theAgefield will be \"0.\" If you disable the automatic calculation of contact age, theAgefield will become editable. More information about age calculation is available in the \"Contact age calculation\" article."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><td><p>Type</p></td><td><p>Type: customer, supplier, contact person, or employee. If you populate this field on the previous step, the data will automatically display on the <strong>General information</strong> tab.</p></td></tr><tr><td><p>Owner</p></td><td><p>Name of the responsible employee.</p></td></tr><tr><td><p>Title</p></td><td><p>Honorific for the contact, for example, \"Mr\" or \"Mrs.\"</p></td></tr><tr><td><p>Gender</p></td><td><p>Gender of the contact.</p></td></tr><tr><td><p>Salutation</p></td><td><p>The preferred way to address the contact.</p></td></tr><tr><td><p>Preferred language</p></td><td><p>The language to use by default for automated communications with the contact. Affects the language of email notifications. If no preferred language is set for a contact, the notifications will be sent in English (the default language). The drop-down list of this field contains only languages whose status is set to \"Active\" in the <strong>Customer languages</strong> lookup.</p></td></tr><tr><td><p>Age</p></td><td><p>Contact age. The field is populated automatically and is grayed out if automatic calculation of contact age is enabled. Creatio calculates a contact’s age based on the value in the <strong>Birthdate</strong> field. If the <strong>Birthdate</strong> field is empty, the value in the <strong>Age</strong> field will be \"0.\" If you disable the automatic calculation of contact age, the <strong>Age</strong> field will become editable. More information about age calculation is available in the \"<a href=\"https://academy.creatio.com/documents?ver=7&amp;id=2046\" rel=\"noopener noreferrer\" target=\"_blank\">Contact age calculation</a>\" article.</p></td></tr></tbody></table>"
}