{
  "headers": [],
  "rows": [
    [
      "Field",
      "Field value"
    ],
    [
      "Object",
      "Enter the Creatio object to be used as a data source. The field is required."
    ],
    [
      "Function",
      "Specify how the metric will process the source data. The field is required. You can choose among the following options:\"count.\" Display the number of object records. For example, total number of employee records in Creatio.\"sum.\" Display the sum of values in a data column. For example, the total duration of employees' calls.\"average,\" \"minimum,\" \"maximum.\" Display the corresponding values of a data column. For example, the average duration of employees' calls. The \"average\" function is not available for all columns."
    ],
    [
      "Column",
      "Select the column the function will use for calculations. You can specify a numeric or a date column. For instance, select the \"Duration (minutes)\" column to calculate average call duration of your employees. The field is required. Creatio does not display the field if you select \"count\" in theFunctionfield."
    ]
  ],
  "caption": "",
  "html": "<table cellspacing=\"0\"><tbody><tr><th><p>Field</p></th><th><p>Field value</p></th></tr><tr><td><p>Object</p></td><td><p>Enter the Creatio object to be used as a data source. The field is required.</p></td></tr><tr><td><p>Function</p></td><td><p>Specify how the metric will process the source data. The field is required. You can choose among the following options:</p><ul>\n<li>\"count.\" Display the number of object records. For example, total number of employee records in Creatio.</li>\n<li>\"sum.\" Display the sum of values in a data column. For example, the total duration of employees' calls.</li>\n<li>\"average,\" \"minimum,\" \"maximum.\" Display the corresponding values of a data column. For example, the average duration of employees' calls. The \"average\" function is not available for all columns.</li>\n</ul></td></tr><tr><td><p>Column</p></td><td><p>Select the column the function will use for calculations. You can specify a numeric or a date column. For instance, select the \"Duration (minutes)\" column to calculate average call duration of your employees. The field is required. Creatio does not display the field if you select \"count\" in the <strong>Function</strong> field.</p></td></tr></tbody></table>"
}