{
  "headers": [],
  "rows": [
    [
      "Parameter name",
      "Parameter value"
    ],
    [
      "v",
      "Indicates the DMARC version used. Required. Set it tov=DMARC1."
    ],
    [
      "p",
      "Determines how to handle messages that fail DMARC authentication. Required. The following values are available:p=none(Monitor Mode). Emails that do not pass authentication are still delivered to the recipient's inbox. This is useful if you only want to monitor and collect data on messages that fail DMARC checks.p=quarantine(Quarantine Mode). Depending on the recipient server, emails that fail DMARC authentication are either sent to a separate spam/quarantine folder or rejected. This lets you review and analyze potentially fraudulent emails.p=reject(Reject Mode): Emails that fail DMARC checks are outright rejected by the recipient. This means that these messages are not delivered to the recipient's inbox, providing a higher level of protection against phishing and spoofing attacks.The exact mode to use depends on your business goals. However, if you want to use a stricter mode, we recommend using less strict modes first to ensure legitimate emails are not blocked inadvertently."
    ],
    [
      "rua",
      "Specifies the email address to send aggregate reports that let you gain insights into the authentication status of your domain's emails. Optional."
    ],
    [
      "ruf",
      "Specifies the email address to send forensic reports. Optional."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><td><p><strong>Parameter name</strong></p></td><td><p><strong>Parameter value</strong></p></td></tr><tr><td><p><strong>v</strong></p></td><td><p>Indicates the DMARC version used. Required. Set it to <code>v=DMARC1</code>.</p></td></tr><tr><td><p><strong>p</strong></p></td><td><p>Determines how to handle messages that fail DMARC authentication. Required. The following values are available:</p><ul>\n<li><code>p=none</code> (Monitor Mode). Emails that do not pass authentication are still delivered to the recipient's inbox. This is useful if you only want to monitor and collect data on messages that fail DMARC checks.</li>\n<li><code>p=quarantine</code> (Quarantine Mode). Depending on the recipient server, emails that fail DMARC authentication are either sent to a separate spam/quarantine folder or rejected. This lets you review and analyze potentially fraudulent emails.</li>\n<li><code>p=reject</code> (Reject Mode): Emails that fail DMARC checks are outright rejected by the recipient. This means that these messages are not delivered to the recipient's inbox, providing a higher level of protection against phishing and spoofing attacks.</li>\n</ul><p>The exact mode to use depends on your business goals. However, if you want to use a stricter mode, we recommend using less strict modes first to ensure legitimate emails are not blocked inadvertently.</p></td></tr><tr><td><p><strong>rua</strong></p></td><td><p>Specifies the email address to send aggregate reports that let you gain insights into the authentication status of your domain's emails. Optional.</p></td></tr><tr><td><p><strong>ruf</strong></p></td><td><p>Specifies the email address to send forensic reports. Optional.</p></td></tr></tbody></table>"
}