{
  "headers": [],
  "rows": [
    [
      "System operation name",
      "System operation code",
      "Description"
    ],
    [
      "Manage user list",
      "CanManageUsers",
      "Permissions to add, modify and deleteuser accountsin the System Designer's user and role management sections."
    ],
    [
      "Manage user licenses",
      "CanManageLicUsers",
      "Access to theLicense managersection. Out of the box, this permission is granted to users that have the \"Creatio Maintenance,\" \"Developer,\" \"Administrator,\" \"System administrators\" role. Users who have permission to manage licenses can still log in to Creatio and redistribute licenses even if the instance is locked due to exceeding the number of allocated licenses."
    ],
    [
      "Change delegated permissions",
      "CanChangeAdminUnitGrantedRight",
      "The ability to delegate the access rights of some users to others using theDelegate permissionsdetail on the user page."
    ],
    [
      "Change system operations permissions",
      "CanChangeAdminOperationGrantee",
      "Ability to manageaccess permissionsto system operations. The scope of rights granted by this operation includes the right to register additional system operations."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>System operation name</p></th><th><p>System operation code</p></th><th><p>Description</p></th></tr><tr><td><p>Manage user list</p></td><td><p>CanManageUsers</p></td><td><p>Permissions to add, modify and delete <a href=\"https://academy.creatio.com/documents?id=1426\" rel=\"noopener noreferrer\" target=\"_blank\">user accounts</a> in the System Designer's user and role management sections.</p></td></tr><tr><td><p>Manage user licenses</p></td><td><p>CanManageLicUsers</p></td><td><p>Access to the <a href=\"https://academy.creatio.com/documents?id=1472\" rel=\"noopener noreferrer\" target=\"_blank\">License manager</a> section. Out of the box, this permission is granted to users that have the \"Creatio Maintenance,\" \"Developer,\" \"Administrator,\" \"System administrators\" role. Users who have permission to manage licenses can still log in to Creatio and redistribute licenses even if the instance is locked due to exceeding the number of allocated licenses.</p></td></tr><tr><td><p>Change delegated permissions</p></td><td><p>CanChangeAdminUnitGrantedRight</p></td><td><p>The ability to delegate the access rights of some users to others using the <a href=\"https://academy.creatio.com/documents?id=1998\" rel=\"noopener noreferrer\" target=\"_blank\">Delegate permissions</a> detail on the user page.</p></td></tr><tr><td><p>Change system operations permissions</p></td><td><p>CanChangeAdminOperationGrantee</p></td><td><p>Ability to manage <a href=\"https://academy.creatio.com/documents?id=258\" rel=\"noopener noreferrer\" target=\"_blank\">access permissions</a> to system operations. The scope of rights granted by this operation includes the right to register additional system operations.</p></td></tr></tbody></table>"
}