{
  "headers": [],
  "rows": [
    [
      "Field",
      "Field value"
    ],
    [
      "Username",
      "Enter the Creatio user login. This is a required field."
    ],
    [
      "Email",
      "Enter the Creatio user login email. If you fill out this field, the user will be able to log in with either the username or the email."
    ],
    [
      "Password, Password confirmation",
      "Enter the password the user will use to log in to Creatio. These are required fields."
    ],
    [
      "Password expiration date",
      "The field is non-editable and displays the date when the password expires. The date is calculated based on theDefault valuefield of the \"Password validity term, days\" (\"MaxPasswordAge\" code) system setting. The value is set to \"0\" out of the box, in which case the password has no expiration date, and thePassword expiration datefield on the user page remains blank and locked."
    ],
    [
      "Reset password",
      "Select this checkbox if you want to force the user to change their password when logging in for the next time. If the checkbox is selected on the user page, Creatio will notify the user that their password has expired and request changing it at the next login attempt."
    ]
  ],
  "caption": "",
  "html": "<table><tbody><tr><th><p>Field</p></th><th><p>Field value</p></th></tr><tr><td><p>Username</p></td><td><p>Enter the Creatio user login. This is a required field.</p></td></tr><tr><td><p>Email</p></td><td><p>Enter the Creatio user login email. If you fill out this field, the user will be able to log in with either the username or the email.</p></td></tr><tr><td><p>Password, Password confirmation</p></td><td><p>Enter the password the user will use to log in to Creatio. These are required fields.</p></td></tr><tr><td><p>Password expiration date</p></td><td><p>The field is non-editable and displays the date when the password expires. The date is calculated based on the <strong>Default value</strong> field of the \"Password validity term, days\" (\"MaxPasswordAge\" code) system setting. The value is set to \"0\" out of the box, in which case the password has no expiration date, and the <strong>Password expiration date</strong> field on the user page remains blank and locked.</p></td></tr><tr><td><p>Reset password</p></td><td><p>Select this checkbox if you want to force the user to change their password when logging in for the next time. If the checkbox is selected on the user page, Creatio will notify the user that their password has expired and request changing it at the next login attempt.</p></td></tr></tbody></table>"
}