{
  "url": "https://academy.creatio.com/docs/8.x/creatio-apps/overview/sales-creatio-overview",
  "title": "Creatio Sales overview",
  "breadcrumbs": [
    {
      "text": "Overview",
      "href": "/docs/8.x/creatio-apps/category/overview"
    }
  ],
  "content_markdown": "Version: 8.3Sales\nOn this page\n**Creatio Sales** is an end-to-end platform to automate sales processes of any type using no-code and a maximum degree of freedom.\nCreatio Sales is built upon the Creatio Studio no-code platform, utilizing a composable architecture that streamlines app development and customization. The Freedom UI Designer, featuring a user-friendly drag-and-drop interface, empowers non-technical employees to effortlessly create and customize sales-related experiences without the need for coding skills.\nCreatio Sales features a business process management (BPM) engine that facilitates the creation and automation of sales processes of any complexity, regardless of the industry or type of business. The product also comes equipped with ready-to-use processes to manage the entire sales cycle, from the initial interaction with a potential customer to closing the deal and completing the corresponding order.\nDue to the unified Creatio architecture, Creatio Sales seamlessly integrates with other Creatio products and ready-made solutions on the Creatio Marketplace.\nCreatio provides a full-blown Creatio Sales product along with individual composable applications dedicated to sales, such as Customer 360, Productivity, Knowledge Base, Lead and Opportunity Management, and Order and Contract Management. Effortlessly tailor a sales solution to meet your unique business requirements by leveraging these composable applications.\nCurrently, the product includes the following **composable apps** :\n* Customer 360\n* Productivity\n* Knowledge Base\n* Lead And Opportunity Management\n* Order And Contract Management\n## Creatio Sales features​\nCreatio Sales incorporates a range of in-built tools and features designed to enhance and accelerate the sales process. Leveraging the no-code capabilities of the underlying Creatio Studio platform, the product maximizes efficiency and customization options for users.\nBelow are the key features of the Creatio Sales product:\n* 360° customer view\n* Lead management\n* Opportunity management\n* Sales forecasts\n* Order management\n* Contract management\n* Document flow management\n* Product management\n* Activity management\n* Sales efficiency evaluation\n* AI tools\n* Creatio Marketplace apps\n* Mobile sales\nCreatio Sales includes all technologies and tools available in Creatio Studio. Learn more: [Creatio Studio overview](https://academy.creatio.com/documents?id=1).\n### 360° customer view​\nCreatio Sales lets you manage a unified database of customer accounts and contacts. The all-encompassing customer overview not only includes essential details about accounts and contacts but also provides a complete history of engagements and collaborations. This capability is pivotal for forming a well-rounded understanding of the customer and facilitating the establishment of optimal and fruitful customer relationships.\nWithin the **Accounts** section, you'll discover information related to organizations or companies, including partners, contractors, suppliers, and other businesses. The account data includes the following:\n* categorization\n* communication preferences\n* payment details\n* contact persons\n* corporate structure\n* relationships with other accounts and contacts\nThe **Contacts** section provides details about individuals with whom your business engages or plans to engage. It includes the following data:\n* social and demographic information\n* preferred channels of communication\n* interaction history\n* links to social network profiles\nYou can segment the database of contacts and accounts based on diverse criteria, including industry, annual turnover, category, location, VIP status, and other factors.\nFig. 1 Account page\n![Fig. 1 Account page](https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_account_page.png)\nLearn more: [Customer 360](https://academy.creatio.com/docs/8.x/creatio-apps/category/customer-360).\n### Lead management​\nCreatio lets you handle the needs of both potential and existing customers effectively within the Leads section. It stores information regarding customer needs, monitors lead sources, and automates lead qualification, nurturing, and the seamless handoff to the sales team through a pre-configured, best-practice lead management process.\nWith Creatio, you can meticulously track and streamline lead management across all stages, from initial attraction to successfully closing a sale.\nFig. 2 Lead page\n![Fig. 2 Lead page](https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_lead_page.png)\nLearn more: [Leads](https://academy.creatio.com/docs/8.x/creatio-apps/category/leads).\n### Opportunity management​\nCreatio Sales employs reference business processes based on the most efficient sales practices for handling sales opportunities. These business processes serve as guides, directing sales representatives through a sequence of activities within the sales pipeline, ultimately leading to the successful closure of deals.\nThe tools for managing opportunities in Creatio let you:\n* Identify pivotal sales indicators.\n* Outline the sales tactics and adjust them as the sales progress.\n* Monitor connections and key influencers associated with the customer.\n* Compile a roster of primary sales competitors, outlining their strengths and weaknesses.\nCreatio Sales records the entire history of each sale, along with a detailed timeline of all interactions, including documents, calls, meetings, correspondence, feed discussions, files, and comments. Leverage this comprehensive sales profile to construct the most effective sales strategy tailored to your needs.\nFig. 3 Opportunity page\n![Fig. 3 Opportunity page](https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_opportunity_page.png)\nLearn more: [Opportunities](https://academy.creatio.com/docs/8.x/creatio-apps/category/opportunities).\n### Sales forecasts​\nSales forecasts in Creatio let you effortlessly project sales volumes based on sales associates, accounts, or industries by default. Creatio actively monitors real sales volumes, ensuring a clear and transparent alignment between forecasted values and actual metrics. You can create customized forecasts based on specific criteria, such as geographical zoning, brands, or customer categories in just a few clicks.\nForecasting is accessible for various periods, including monthly, quarterly, and annually. Custom forecasting periods can be configured as needed.\nCreatio offers user-friendly tools to align custom forecasts with actual metrics, featuring automated calculations of custom metrics using multiple database columns and formulas.\nLearn more: [Forecasting](https://academy.creatio.com/docs/8.x/creatio-apps/category/forecasting).\n### Order management​\nCreatio facilitates the management of B2C sales and e-commerce through user-friendly tools for product selection and order processing. Integration with websites, for example, online stores, lets you register and process orders automatically. Payment and delivery schedules automate shipment planning based on orders, and the versatile reporting functionality generates print-ready documents such as invoices, contracts, and product warranties.\nFig. 4 Order page\n![Fig. 4 Order page](https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_order_page.png)\nLearn more: [Order and Contract Management](https://academy.creatio.com/docs/8.x/creatio-apps/category/order-and-contract-management).\n### Contract management​\nThe Contracts section facilitates management of the entire contract signing process, including approvals, scanned copies, associated invoices, and subsidiary contracts. You can design templates to produce print-ready, personalized contract forms in accordance with your corporate brand book. Creatio automates the population of required fields while preserving the option for manual edits.\nFig. 5 Contract page\n![Fig. 5 Contract page](https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_contract_page.png)\nLearn more: [Order and Contract Management](https://academy.creatio.com/docs/8.x/creatio-apps/category/order-and-contract-management).\n### Document flow management​\nIn Creatio Sales, you can link contracts, specifications, and additional agreements to customers, opportunities, or orders. Use the Documents section to manage miscellaneous documents, such as meeting minutes and correspondence, as well as store external files, for example, document scans.\nSet up templates to generate print-ready, personalized contract forms that fully adhere to your corporate brand book. Creatio automatically fills in the necessary fields, while still allowing for manual edits.\nFig. 6 Document page\n![Fig. 6 Document page](https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_document_page.png)\nLearn more: [Order and Contract Management](https://academy.creatio.com/docs/8.x/creatio-apps/category/order-and-contract-management).\n### Product management​\nCreatio facilitates the automatic generation of a structured catalog for your products. Products in the catalog can be organized based on type, category, brand, or other relevant parameters. You can set up multiple price lists for each product and keep track of the inventory count. Additionally, you can add and update large volumes of products using Excel import in just a few clicks.\nSeamless integration with third-party accounting systems in Creatio ensures that your product catalog, warehouse stock, and prices stay up-to-date and can be synchronized effortlessly.\nThe Products section provides an array of grouping and filtering tools. For example, dynamic folders can be created based on filters, such as the date a product was added to the database, facilitating more efficient product selection for managers.\nYou can customize the product profile by adding custom elements. These additional product elements contribute to catalog structuring and accelerate the product selection process.\nFig. 7 Product page\n![Fig. 7 Product page](https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_product_page.png)\nLearn more: [Products and prices](https://academy.creatio.com/docs/8.x/creatio-apps/category/products-and-prices).\n### Activity management​\nUtilize the **Calendar** and **Tasks** sections to centralize the management of your tasks and meetings, ensuring optimal efficiency in your workflow.\nFig. 8 Calendar page\n![Fig. 8 Calendar page](https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_calendar_page.png)\nLearn more: [Productivity](https://academy.creatio.com/docs/8.x/creatio-apps/category/productivity).\n### Sales efficiency evaluation​\nCreatio Sales's analytics tools offer a real-time evaluation of work dynamics. The primary tool for analyzing sales managers' key performance indicators (KPIs) is the sales pipeline. It allows you to assess conversion rates between stages, evaluate pipeline completeness, and make comparisons between pipelines of individual representatives or sales teams.\nThe pipeline chart is available on the **Sales** and **Lead and Opportunity** homepages. You can also add new charts to any Freedom UI page and tailor existing charts without the need for coding.\nFig. 9 Dashboard page\n![Fig. 9 Dashboard page](https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_dashboard_page.png)\nLearn more: [Set up widgets](https://academy.creatio.com/documents?id=2144).\n### AI tools​\nAI tools contribute to accelerating routine tasks and enhancing employee performance. Creatio Sales incorporates various customizable machine learning models, catering to diverse needs. For example, here is how Creatio uses machine learning models to automate tasks for sales professionals:\n* The **predictive** scoring model assesses leads and opportunities by gauging the likelihood of a sale. It considers customer data, customer service history, past similar deals, and other historical data for its evaluation.\n* The **recommendation prediction** model creates a list of suggested products for an account or contact by analyzing their preferences and considering data on completed purchases made by similar customers.\n* You can set up additional machine learning models, for example, lookup value prediction or numeric prediction, if needed.\nMoreover, thanks to the integration with OpenAI, Creatio facilitates generative AI use cases. This includes the ability to develop no-code applications solely based on text prompts.\nLearn more: [AI tools](https://academy.creatio.com/docs/8.x/no-code-customization/category/ai-tools).\n### Creatio Marketplace apps​\nThe Creatio Marketplace provides a diverse selection of ready-to-use apps tailored for Creatio products. This curated collection is crafted to elevate sales and refine operational processes. Effortlessly acquire your preferred Marketplace app, seamlessly integrate it with your Creatio Sales product, and begin utilizing it immediately for enhanced efficiency.\nFurthermore, the Creatio Marketplace platform extends the opportunity for Creatio users to share their own apps and monetize them.\n### Mobile sales​\nCreatio provides a native mobile app empowering sellers to:\n* Access crucial sales data anytime, anywhere through comprehensive dashboards.\n* Interact with accounts and contacts.\n* Plan activities, meetings, or calls.\n* Effectively handle leads, opportunities, and much more.\nThe mobile app works both offline and online, allowing for seamless synchronization of modified data. It is compatible with Android and iOS devices.\nThe mobile app effortlessly synchronizes in real-time with the Creatio server. For instance, when a sales representative adds a task via the main application, the task promptly appears in the mobile app, and vice versa.",
  "code_examples": [],
  "tables": [],
  "callouts": [],
  "images": [
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_account_page.png",
      "alt": "Fig. 1 Account page",
      "title": "",
      "context": "You can segment the database of contacts and accounts based on diverse criteria, including industry,",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_overview_sales-creatio-overview_578e12989bc9.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_lead_page.png",
      "alt": "Fig. 2 Lead page",
      "title": "",
      "context": "With Creatio, you can meticulously track and streamline lead management across all stages, from init",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_overview_sales-creatio-overview_d6a20c919126.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_opportunity_page.png",
      "alt": "Fig. 3 Opportunity page",
      "title": "",
      "context": "Creatio Sales records the entire history of each sale, along with a detailed timeline of all interac",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_overview_sales-creatio-overview_c37f31b8f1aa.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_order_page.png",
      "alt": "Fig. 4 Order page",
      "title": "",
      "context": "Creatio facilitates the management of B2C sales and e-commerce through user-friendly tools for produ",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_overview_sales-creatio-overview_fa1fa4172cd8.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_contract_page.png",
      "alt": "Fig. 5 Contract page",
      "title": "",
      "context": "The Contracts section facilitates management of the entire contract signing process, including appro",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_overview_sales-creatio-overview_0b1e080166bc.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_document_page.png",
      "alt": "Fig. 6 Document page",
      "title": "",
      "context": "Set up templates to generate print-ready, personalized contract forms that fully adhere to your corp",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_overview_sales-creatio-overview_1fddc991ea7d.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_product_page.png",
      "alt": "Fig. 7 Product page",
      "title": "",
      "context": "You can customize the product profile by adding custom elements. These additional product elements c",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_overview_sales-creatio-overview_25155d55af21.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_calendar_page.png",
      "alt": "Fig. 8 Calendar page",
      "title": "",
      "context": "Utilize theCalendarandTaskssections to centralize the management of your tasks and meetings, ensurin",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_overview_sales-creatio-overview_4b70756a94d7.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Overview/sales_creatio_overview/scr_dashboard_page.png",
      "alt": "Fig. 9 Dashboard page",
      "title": "",
      "context": "The pipeline chart is available on theSalesandLead and Opportunityhomepages. You can also add new ch",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_overview_sales-creatio-overview_a261e89cc07b.png"
    }
  ],
  "videos": [],
  "downloadables": [],
  "headings": [
    {
      "level": 1,
      "text": "Creatio Sales overview",
      "anchor": ""
    },
    {
      "level": 2,
      "text": "Creatio Sales features​",
      "anchor": "title-2490-1"
    },
    {
      "level": 3,
      "text": "360° customer view​",
      "anchor": "title-2490-2"
    },
    {
      "level": 3,
      "text": "Lead management​",
      "anchor": "title-2490-3"
    },
    {
      "level": 3,
      "text": "Opportunity management​",
      "anchor": "title-2490-4"
    },
    {
      "level": 3,
      "text": "Sales forecasts​",
      "anchor": "title-2490-5"
    },
    {
      "level": 3,
      "text": "Order management​",
      "anchor": "title-2490-6"
    },
    {
      "level": 3,
      "text": "Contract management​",
      "anchor": "title-2490-7"
    },
    {
      "level": 3,
      "text": "Document flow management​",
      "anchor": "title-2490-8"
    },
    {
      "level": 3,
      "text": "Product management​",
      "anchor": "title-2490-9"
    },
    {
      "level": 3,
      "text": "Activity management​",
      "anchor": "title-2490-10"
    },
    {
      "level": 3,
      "text": "Sales efficiency evaluation​",
      "anchor": "title-2490-11"
    },
    {
      "level": 3,
      "text": "AI tools​",
      "anchor": "title-2490-12"
    },
    {
      "level": 3,
      "text": "Creatio Marketplace apps​",
      "anchor": "title-2490-13"
    },
    {
      "level": 3,
      "text": "Mobile sales​",
      "anchor": "title-2490-14"
    }
  ],
  "api_docs": null,
  "sidebar_items": [
    {
      "href": "/docs/8.x/",
      "text": "Guides",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/sales-creatio-overview",
      "text": "Sales",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/overview/sales-creatio-overview",
      "text": "8.2",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.1/overview/sales-creatio-overview",
      "text": "8.1",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/platform-basics/user-interface/creatio-interface",
      "text": "8.0",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/overview",
      "text": "Overview",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/platform-overview",
      "text": "PreviousCreatio Studio",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/marketing-creatio-overview",
      "text": "NextMarketing",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/service-creatio-overview",
      "text": "Service",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/financial-services-creatio-overview",
      "text": "Financial Services",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/platform",
      "text": "Platform",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/freedom-ui",
      "text": "Freedom UI",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/business-data",
      "text": "Business data",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/communications",
      "text": "Communications",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/running-business-processes",
      "text": "Running business processes",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/creatio-basics/use-two-factor-authentication",
      "text": "Use two-factor authentication",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/products",
      "text": "Products",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/common-features",
      "text": "Common features",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/marketing-tools",
      "text": "Marketing tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/sales-tools",
      "text": "Sales tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/service-tools",
      "text": "Service tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/finance-and-banking",
      "text": "Finance and banking",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/industry-cases",
      "text": "Industry cases",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/creatio-apps/category/customer-360",
      "text": "Customer 360",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/creatio-apps/category/leads",
      "text": "Leads",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/creatio-apps/category/opportunities",
      "text": "Opportunities",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/creatio-apps/category/forecasting",
      "text": "Forecasting",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/creatio-apps/category/order-and-contract-management",
      "text": "Order and Contract Management",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/creatio-apps/category/products-and-prices",
      "text": "Products and prices",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/creatio-apps/category/productivity",
      "text": "Productivity",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/no-code-customization/category/ai-tools",
      "text": "AI tools",
      "active": false
    }
  ],
  "related_links": [],
  "version": "8.x",
  "crawled_at": "2026-01-15T04:32:05.753036"
}