{
  "url": "https://academy.creatio.com/docs/8.x/no-code-customization/8.2/customization-tools/recommendations/best-practices",
  "title": "Best infrastructure practices for composable app development",
  "breadcrumbs": [
    {
      "text": "Customization tools",
      "href": "/docs/8.x/no-code-customization/8.2/category/customization-tools"
    },
    {
      "text": "Recommendations",
      "href": "/docs/8.x/no-code-customization/8.2/category/recommendations"
    }
  ],
  "content_markdown": "Version: 8.2All Creatio products\nOn this page\nLevel: beginner\nTo avoid irregularities in Creatio and critical errors, organize special infrastructure when developing composable apps. App development infrastructure differs from Creatio basic infrastructure. View the general app development infrastructure in the chart below. The chart comprises top-level blocks required for continuous development. While the exact technological solutions might differ, the basic set of blocks and tasks to complete remains the same for all cases.\n![](https://academy.creatio.com/sites/default/files/documentation/sdk/ru/BPMonlineWebSDK/Screenshots/BestPracticesForDevelopment/8.1/scr_GeneralStructure.png)\n## Roles within the development team​\nDepending on the complexity of the composable app to implement and whether the development team needs to work with the app source app code, one or more development teams that include people with different roles can develop the new or existing app. The major roles within the development team are as follows:\n* No-code creator. Read more >>>\n* Software developer. Read more >>>\n### No-code creator​\nA no-code creator customizes the app using no-code tools. For example, No-Code Designer, Freedom UI Designer, and Process Designer. No-code lets you retain a great deal of flexibility while accelerating the development process and making development accessible to any employee. The number of resources required for no-code development is much smaller than that for custom development due to the following reasons:\n* The development time is shorter. You can further reduce development time by developing generic component versions or using ready-made solutions available on the Creatio Marketplace.\n* You can train parts of your business function to develop apps. That said, coders might still be required in edge cases, for example, developing a connector to external software from scratch.\n* While you do have to provide support for the app, Creatio covers the platform functionality. The infrastructure can be provided by Creatio as well.\nA no-code creator can execute the following **actions** with the app:\n* customize business processes, record pages, app sections\n* create and modify app objects\n* change object columns and their names\n* organize the app package structure\n* manage updated apps\nLearn more: [No-Code Customization](https://academy.creatio.com/docs/8.x/no-code-customization/category/customization-tools).\n### Software developer​\nA software developer customizes the app using development tools. Classic development offers unparalleled flexibility. You can develop any app that fits your business goals as precisely as possible.\nHowever, this also requires a large number of resources that come in different forms:\n* Custom development takes time even in the best possible conditions.\n* You need a team of dedicated developers.\n* You must ensure the operability of the app, i. e., provide infrastructure and continuous support.\nSoftware developer can execute the following **actions** :\n* assist no-code creators with more complex tasks\n* work with the C# source code of assembly packages using all features of external IDEs\n* connect external libraries\n* implement custom Freedom UI and Classic UI components\n* implement custom business logic for Freedom UI pages\nThe need to involve software developers depends on the technical complexity of the solution, compliance requirements, and scale of usage.\nLearn more: [Development tools](https://academy.creatio.com/docs/8.x/dev/development-on-creatio-platform/category/development-tools) (developer documentation).\n## Configure the development environment​\nRegardless of the role, we recommend using a dedicated Creatio instance to develop composable apps efficiently. This lets you compile and restart the app only when needed as well as ensure database data remains unchanged.\nView the available development environments in the table below.\nRoles on the development team| Development environment  \n---|---  \nOn-site| Cloud  \nNo-code creator| +| +  \nSoftware developer| +| Not available  \nEvery development environment can include the following **set of tools** :\n* **Creatio instance**.\n* **Services required for Creatio operability** : database server (Microsoft SQL or PostgreSQL), Redis caching server, IIS, RabbitMQ (optional).\n* **Version control system required to work with the app source code** : Git client for Git version control system.\n* **Integration and development utilities** : Visual Studio Code, Clio utility, Clio explorer extension for Visual Studio Code. These tools let you work with the Git repository and deliver the composable app to Creatio easily.\n### On-site environment for a no-code creator​\nUse the Creatio on-site for a no-code creator in the following cases:\n* You need to maximize the Creatio performance.\n* Centralized company infrastructure is unavailable or inaccessible.\nThe hardware requirements are quite high since all services are run on-site. You can host some of the services in the cloud, but this reduces the execution time of some processes.\nView a set of tools needed for a no-code creator to develop a composable app in Creatio on-site in the figure below.\n![](https://academy.creatio.com/sites/default/files/documentation/sdk/ru/BPMonlineWebSDK/Screenshots/BestPracticesForDevelopment/8.1/scr_ToolsNoCodeCreatorOnSite.png)\nYou can host Creatio on-site and services required for Creatio operability on the **development team server** for a no-code creator.\nUse the development team server in the following cases:\n* You need to create new development environments automatically.\n* The local machine has a limited set of development tools.\n* The security policy restrictions are in place.\nThe configuration of the development team server must provide stable Creatio performance. To ensure this, use the [system requirements calculator](https://academy.creatio.com/docs/requirements/calculator) to estimate the required server computing capacity based on the number of developers working on the project at the same time.\nDevelop a composable app using Creatio in the browser. Install the app as well as commit and migrate the changes to Git version control system using the local machine.\nView a set of tools needed for a no-code creator to develop a composable app in Creatio hosted on the development team server in the figure below.\n![](https://academy.creatio.com/sites/default/files/documentation/sdk/ru/BPMonlineWebSDK/Screenshots/BestPracticesForDevelopment/8.1/scr_ToolsNoCodeCreatorTeamServer.png)\n### Cloud environment for a no-code creator​\nYou can use cloud Creatio instances hosted by the vendor in the same way as Creatio instances installed into the development team server.\nView a set of tools needed for a no-code creator to develop a composable app in Creatio in the cloud in the figure below.\n![](https://academy.creatio.com/sites/default/files/documentation/sdk/ru/BPMonlineWebSDK/Screenshots/BestPracticesForDevelopment/8.1/scr_ToolsNoCodeCreatorCloud.png)\n### On-site environment for a software developer​\nSoftware developers can use Creatio on-site if they need to work with the C# source code of assembly packages using all features of external IDEs. To set this environment up, deploy Creatio on-site and set it up to work in file system development mode. Instructions: [Set up Creatio to work with the file system](https://academy.creatio.com/documents?id=15111&anchor=title-2098-4) (developer documentation).\nView a set of tools a software developer needs to develop a composable app in Creatio on-site in the figure below.\n![](https://academy.creatio.com/sites/default/files/documentation/sdk/ru/BPMonlineWebSDK/Screenshots/BestPracticesForDevelopment/8.1/scr_ToolsDeveloper.png)\n## Git repository​\nAlthough you can deliver packages and composable apps between Creatio environments as *.zip archives, we recommend you deliver apps using the Git version control system. Git lets you prevent the problems that can occur when developers work together on the same package of the same app. The Git version control system serves as the unified point of origin for source code of the composable app.\nUse a dedicated Git repository for a single composable app. This lets you version the composable app easier. You can use a `trunk`-based approach to organize the repository structure. In this case, each repository includes `trunk`, `release`, and `feature` branches. When you create a repository, generate its content using the Clio utility. Develop the functionality in the `feature` branch. When the functionality is ready, deliver `feature` branch content to the `trunk` branch.\nBuild a composable app using the Clio utility based on the repository packages. Each name of a composable app build includes a unique version number that distinguishes the current build from other composable app builds. During the build process, the utility generates a *.zip archive to transfer to the Artifacts store.\n## Artifacts store​\nArtifacts store is a repository of artifacts. **Artifacts** are *.zip archives of ready-to-deliver composable apps.\nThe **artifact sources** are as follows:\n* Internal processes. For example, standalone version of a composable app build.\n* Third-party composable apps. For example, partner-developed composable apps, apps published on the Creatio Marketplace.\nWorking with artifacts such as *.zip archives ensure that deploying apps into the pre-production environment is identical to deploying apps into the production environment.such as *.zip archives lets you detect errors during composable app installation or update as part of testing.\nYou can use the file system and Nexus to organize the Artifacts store.\n## CI/CD server​\nCI/CD server is a server that executes automation tasks as part of composable app development. The set of automation tasks depends on the development complexity and the configuration of the testing environment. For example, automation tasks can be as follows:\n* create a development environment for no-code creator on the developer team server\n* deploy the environment on the QA team server\n* build a composable app into a *.zip archive\n* run acceptance tests\n* run integration tests\n* update the production environment\nYou can use any continuous integration server tool to automate tasks. For example, Jenkins, TeamCity, etc. Clio utility is required to execute operations with Creatio.\n## Testing environment​\nAfter you develop the composable app, test the designed functionality. To do this, deploy one or more test environments in the internal infrastructure. Use CI/CD server to automate tasks.\nA test environment includes the following elements:\n* QA team server\n* QA integration server\n* Pre-production environment\n### QA team server​\nQA team server is a mandatory component of the testing environment. Use it to deliver and test changes to the composable app. You can test functionality manually or automatically. Automated testing lets you release composable apps of higher quality than manual testing.\nIf you develop multiple composable apps simultaneously, you can increase the number of QA team servers. The exact number of QA team servers required depends on how many testing tasks you need executed at the same time.\n### QA integration server​\nQA integration server lets you test the interaction of a composable app with other composable apps developed or installed from the Creatio Marketplace. Use the server to test replaced functionality that overlaps with other composable apps.\n### Pre-production environment​\nA pre-production environment is an environment that includes the same set of composable apps as the production environment. Before you test the functionality, test the delivery of new package versions to a Creatio instance that contains previous package versions. If you use a web farm, test the developed composable app in the web farm mode.\n* * *\n## See also​\n[No-Code Customization](https://academy.creatio.com/docs/8.x/no-code-customization/category/customization-tools)\n[On-site deployment](https://academy.creatio.com/docs/8.x/setup-and-administration/category/on-site-deployment)\n[Server-side system requirements](https://academy.creatio.com/documents?id=1456)\n[Development tools (developer documentation)](https://academy.creatio.com/docs/8.x/dev/development-on-creatio-platform/category/development-tools)",
  "code_examples": [],
  "tables": [
    {
      "headers": [],
      "rows": [
        [
          "Roles on the development team",
          "Development environment"
        ],
        [
          "On-site",
          "Cloud"
        ],
        [
          "No-code creator",
          "+",
          "+"
        ],
        [
          "Software developer",
          "+",
          "Not available"
        ]
      ],
      "caption": "",
      "html": "<table><tbody><tr><th rowspan=\"2\"><p>Roles on the development team</p></th><th colspan=\"2\"><p>Development environment</p></th></tr><tr><th><p>On-site</p></th><th><p>Cloud</p></th></tr><tr><td><p>No-code creator</p></td><td><center><p>+</p></center></td><td><center><p>+</p></center></td></tr><tr><td><p>Software developer</p></td><td><center><p>+</p></center></td><td><center><p>Not available</p></center></td></tr></tbody></table>"
    }
  ],
  "callouts": [],
  "images": [
    {
      "src": "https://academy.creatio.com/sites/default/files/documentation/sdk/ru/BPMonlineWebSDK/Screenshots/BestPracticesForDevelopment/8.1/scr_GeneralStructure.png",
      "alt": "",
      "title": "",
      "context": "To avoid irregularities in Creatio and critical errors, organize special infrastructure when develop",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_no-code-customization_8.2_customization-tools_recommendations_best-practices_fc78364b4f6f.png"
    },
    {
      "src": "https://academy.creatio.com/sites/default/files/documentation/sdk/ru/BPMonlineWebSDK/Screenshots/BestPracticesForDevelopment/8.1/scr_ToolsNoCodeCreatorOnSite.png",
      "alt": "",
      "title": "",
      "context": "View a set of tools needed for a no-code creator to develop a composable app in Creatio on-site in t",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_no-code-customization_8.2_customization-tools_recommendations_best-practices_389f4c980fe7.png"
    },
    {
      "src": "https://academy.creatio.com/sites/default/files/documentation/sdk/ru/BPMonlineWebSDK/Screenshots/BestPracticesForDevelopment/8.1/scr_ToolsNoCodeCreatorTeamServer.png",
      "alt": "",
      "title": "",
      "context": "View a set of tools needed for a no-code creator to develop a composable app in Creatio hosted on th",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_no-code-customization_8.2_customization-tools_recommendations_best-practices_bb0d6078328c.png"
    },
    {
      "src": "https://academy.creatio.com/sites/default/files/documentation/sdk/ru/BPMonlineWebSDK/Screenshots/BestPracticesForDevelopment/8.1/scr_ToolsNoCodeCreatorCloud.png",
      "alt": "",
      "title": "",
      "context": "View a set of tools needed for a no-code creator to develop a composable app in Creatio in the cloud",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_no-code-customization_8.2_customization-tools_recommendations_best-practices_9b9fc122698f.png"
    },
    {
      "src": "https://academy.creatio.com/sites/default/files/documentation/sdk/ru/BPMonlineWebSDK/Screenshots/BestPracticesForDevelopment/8.1/scr_ToolsDeveloper.png",
      "alt": "",
      "title": "",
      "context": "View a set of tools a software developer needs to develop a composable app in Creatio on-site in the",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_no-code-customization_8.2_customization-tools_recommendations_best-practices_e140c8c076b9.png"
    }
  ],
  "videos": [],
  "downloadables": [],
  "headings": [
    {
      "level": 1,
      "text": "Best infrastructure practices for composable app development",
      "anchor": ""
    },
    {
      "level": 2,
      "text": "Roles within the development team​",
      "anchor": "title-15074-2"
    },
    {
      "level": 3,
      "text": "No-code creator​",
      "anchor": "title-15074-3"
    },
    {
      "level": 3,
      "text": "Software developer​",
      "anchor": "title-15074-4"
    },
    {
      "level": 2,
      "text": "Configure the development environment​",
      "anchor": "title-15074-5"
    },
    {
      "level": 3,
      "text": "On-site environment for a no-code creator​",
      "anchor": "title-15074-7"
    },
    {
      "level": 3,
      "text": "Cloud environment for a no-code creator​",
      "anchor": "title-15074-8"
    },
    {
      "level": 3,
      "text": "On-site environment for a software developer​",
      "anchor": "title-15074-9"
    },
    {
      "level": 2,
      "text": "Git repository​",
      "anchor": "title-15074-10"
    },
    {
      "level": 2,
      "text": "Artifacts store​",
      "anchor": "title-15074-11"
    },
    {
      "level": 2,
      "text": "CI/CD server​",
      "anchor": "title-15074-12"
    },
    {
      "level": 2,
      "text": "Testing environment​",
      "anchor": "title-15074-14"
    },
    {
      "level": 3,
      "text": "QA team server​",
      "anchor": "title-15074-14"
    },
    {
      "level": 3,
      "text": "QA integration server​",
      "anchor": "title-15074-15"
    },
    {
      "level": 3,
      "text": "Pre-production environment​",
      "anchor": "title-15074-16"
    },
    {
      "level": 2,
      "text": "See also​",
      "anchor": "see-also"
    }
  ],
  "api_docs": null,
  "sidebar_items": [
    {
      "href": "/docs/8.x/",
      "text": "Guides",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/recommendations/best-practices",
      "text": "Infrastructure",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/customization-tools/recommendations/best-practices",
      "text": "latest version",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.1/customization-tools/recommendations/best-practices",
      "text": "8.1",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.0/nocode-platform/UI-designer",
      "text": "8.0",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/customization-tools",
      "text": "Customization tools",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/recommendations",
      "text": "Recommendations",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/recommendations/recommendations-on-app-creation",
      "text": "PreviousBasics",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/app-management",
      "text": "NextApp management",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/app-management/app-types",
      "text": "App types",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/app-management/apps-management",
      "text": "Manage apps",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/app-management/manage-elements",
      "text": "Manage app elements",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/app-management/set-up-app-metadata",
      "text": "App properties",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/app-management/store-freedom-ui-data",
      "text": "Store app data",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/app-management/move-a-classic-ui-section-to-freedom-ui",
      "text": "Classic UI sections in Freedom UI",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/app-management/cyclic-connection-chains",
      "text": "Cyclic connection chains",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/app-management/application-hub",
      "text": "Application Hub",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/ui-and-business-logic-customization",
      "text": "UI and business logic customization",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/ui-and-business-logic-customization/UI-designer",
      "text": "Elements reference",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/element-setup-examples",
      "text": "Element setup examples",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/app-ui-setup",
      "text": "App UI setup",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/ui-and-business-logic-customization/static-filters",
      "text": "Static filters",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/ui-and-business-logic-customization/localize-a-freedom-ui-element",
      "text": "UI localization",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/ui-and-business-logic-customization/freedom-ui-business-rules",
      "text": "Business rules",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/ui-and-business-logic-customization/multiple-data-sources",
      "text": "Multiple data sources",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/accessibility",
      "text": "Accessibility",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/custom-localization",
      "text": "Custom localization",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/custom-localization/manage-ui-languages",
      "text": "Manage languages",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/custom-localization/localize-ui-via-the-[translation]-section",
      "text": "Translate the UI",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/custom-localization/import-translations-from-excel",
      "text": "Import from Excel",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/custom-localization/determine-translation-string-context-by-the-key-column",
      "text": "The Key column",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/system-settings-and-lookups",
      "text": "System settings and lookups",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/system-settings-and-lookups/manage-lookup-values",
      "text": "Lookup values",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/system-settings-and-lookups/create-new-lookups",
      "text": "Create a lookup",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/system-settings-and-lookups/manage-system-settings",
      "text": "Manage system settings",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/system-settings-and-lookups/description-of-system-settings",
      "text": "System setting reference",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/ai-tools",
      "text": "AI tools",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/creatio-ai",
      "text": "Creatio.ai",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/predictive-models",
      "text": "Predictive models",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/print-ready-reports",
      "text": "Print-ready reports",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/print-ready-reports/set-up-ms-word-report---general-procedure",
      "text": "Overview",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/print-ready-reports/install-creatio-plug-in-for-ms-word",
      "text": "Install the plugin",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/print-ready-reports/add-a-new-ms-word-report-in-creatio",
      "text": "Create a report",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/print-ready-reports/set-up-the-report-in-the-ms-word-plug-in-and-upload-it-in-creatio",
      "text": "Set up a report",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/appearance-customization",
      "text": "Appearance customization",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/appearance-customization/general-procedure",
      "text": "Turn on Freedom UI",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/appearance-customization/customize-freedomUI",
      "text": "Customize the Freedom UI",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/appearance-customization/manage-the-form-pages-overview",
      "text": "Manage form pages",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/appearance-customization/bind-ui-settings",
      "text": "Bind UI settings",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/appearance-customization/set-up-workplaces",
      "text": "Workplaces",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/mobile-app-setup",
      "text": "Mobile app setup",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/mobile-app-setup/set-up-mobile-app-workplaces",
      "text": "Workplaces",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/mobile-app-setup/set-up-mobile-application-section-list",
      "text": "Record list",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/mobile-app-setup/set-up-mobile-application-section-page",
      "text": "Page",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/mobile-app-setup/set-up-mobile-application-detail",
      "text": "Detail",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/mobile-app-setup/synchronization",
      "text": "Synchronization",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/tags-setup",
      "text": "Tags setup",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/set-up-tags/tag-storage-location",
      "text": "Tag storage location",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/set-up-tags/manage-tags-from-a-lookup",
      "text": "Tags in lookups",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/base-integrations",
      "text": "Base integrations",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/base-integrations/add-imap-smtp-email-provider",
      "text": "IMAP / SMTP email",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/ms-exchange--microsoft-365-email-and-calendar",
      "text": "MS Exchange / Microsoft 365 email and calendar",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/google-services",
      "text": "Google services",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/mailbox-setup",
      "text": "Mailbox setup",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/webhook-service-integration",
      "text": "Webhook service integration",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/chat-setup",
      "text": "Chat setup",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/oauth-20",
      "text": "OAuth 2.0",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/web-services",
      "text": "Web services",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/phone-integration-connectors",
      "text": "Phone integration connectors",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/bpm-tools",
      "text": "BPM tools",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/business-process-setup",
      "text": "Business process setup",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/process-elements-reference",
      "text": "Process elements reference",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/process-element-use-cases",
      "text": "Process element use cases",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/process-examples",
      "text": "Process examples",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/process-administration",
      "text": "Process administration",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/category/dynamic-case-setup-dcm",
      "text": "Dynamic case setup (DCM)",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/no-code-customization/category/customization-tools",
      "text": "No-Code Customization",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/dev/development-on-creatio-platform/category/development-tools",
      "text": "Development tools (developer documentation)",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/requirements/calculator",
      "text": "system requirements calculator",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/setup-and-administration/category/on-site-deployment",
      "text": "On-site deployment",
      "active": false
    }
  ],
  "related_links": [],
  "version": "8.x",
  "crawled_at": "2026-01-15T03:01:39.485682"
}