{
  "url": "https://academy.creatio.com/docs/8.x/creatio-apps/8.2/creatio-basics/communications/work-with-chats",
  "title": "Work with chats",
  "breadcrumbs": [
    {
      "text": "Platform",
      "href": "/docs/8.x/creatio-apps/8.2/category/platform"
    },
    {
      "text": "Communications",
      "href": "/docs/8.x/creatio-apps/8.2/category/communications"
    }
  ],
  "content_markdown": "Version: 8.2All Creatio products\nOn this page\nUse Creatio chat integration functionality to communicate with customers and process service cases through the communication channels that are convenient to your customers. Chat agents process incoming cases in the communication panel. During a chat, agents can provide consultations, share files, and run business processes using the communication panel. The chat logs are saved on the contact page.\nCreatio creates **new chats** in the following cases:\n* An incoming private message from a new customer in Facebook Messenger, WhatsApp, or Telegram bot.\n* A new message from an existing customer if there are no current active chats for this customer.\nIn other cases, Creatio displays new messages in the active chat.\nCreatio adds **new contacts** based on incoming chats if the following conditions are met:\n* A customer sent their first message using a company page, Telegram bot, or WhatsApp.\n* There are no Creatio contacts with a Facebook user ID, Telegram user ID, or WhatsApp number from the incoming message.\nWhen a new contact is created based on an incoming chat, Creatio will populate the following contact fields:\n* A Facebook user's name, profile picture, and ID.\n* A Telegram user's name, profile picture, and ID.\n* A WhatsApp user's name, profile picture, and phone number.\nMessages of the same Creatio contact sent from different contact IDs within the same channel are combined in a single Creatio chat window. For example, if a customer messages support from multiple WhatsApp accounts listed under the same Creatio contact, the chat agent can view the entire communication history in a single place.\n## Change the agent status​\nThe agent status determines whether they can receive and process chats in the Creatio communication panel.\n* **Active**. An active agent can see new messages and chats on the communication panel, process them, and send responses.\n* **Inactive**. An inactive agent can only see previously received chats on the communication panel, process them, and send responses. Creatio does not distribute new chats among inactive agents.\nBy default, the agent's status is \"Inactive.\" Change it in the communication panel (Fig. 1).\nFig. 1 Agent's status in the communication panel\n![Fig. 1 Agent's status in the communication panel](https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_set_operator_status.png)\nWhen an agent logs out (i. e., closes the session), their status will be changed to \"Inactive\" automatically and new chats will not be distributed to this agent.\n## Process chat messages​\nAgents can process chats using the **Chats** sidebar of the communication panel. Agents can access:\n* **Active** chats that are in progress.\n* **New** chats that are awaiting acceptance.\nnote\nThe time for taking a chat into processing, as well as the time limit for replying to an active chat, may be limited. Learn more in a separate article: [Add a chat queue](https://academy.creatio.com/documents?id=2382&anchor=title-2022-1).\nFig. 2 Chats on Creatio communication panel\n![Fig. 2 Chats on Creatio communication panel](https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_chats.png)\nIf you permit Creatio to send you desktop notifications in your browser, you will receive a desktop alert whenever a new chat is assigned to you.\nTo **start processing the chat** , click **Accept chat**. You will become the owner of this chat. After this you will have access to the following:\n* Text chat messages.\n* Files attached to the chat.\n* Contact details.\n* Chat source.\n* Chat actions.\nTo use a **quick reply template** , click the ![](https://academy.creatio.com/docs/sites/en/files/images/Setup_and_Administration/Chats/btn_com_view_chat_templates.png) button or type \"//\" in the reply field and proceed to enter the name or text of the template. A window with the list of [pre-configured chat templates](https://academy.creatio.com/documents?id=2357&anchor=title-2116-3) will open (Fig. 3).\nFig. 3 Quick reply template search\n![Fig. 3 Quick reply template search](https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_chat_templates.png)\nIf you leave the chat without sending the reply, Creatio will save a **draft** of your message automatically. You can get back to editing the reply at any moment after you open the chat again. The draft will appear in the reply field.\nTo **run a chat action** , for example, create a case, click the ![](https://academy.creatio.com/docs/sites/default/files/images/2020-12/btn_menu.png) button in the top right corner of the communication panel, and select the action to perform (Fig. 4).\nnote\nLearn more about setting up chat actions in a separate article: [Set up the chat actions](https://academy.creatio.com/documents?id=2382&anchor=title-2022-5).\nFig. 4 Run a chat action\n![Fig. 4 Run a chat action](https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_perform_chat_actions.png)\nWhen the conversation is over, click the ![](https://academy.creatio.com/docs/sites/default/files/images/Platform_basics/working_with_chats/btn_com_end_open_chat.png) button at the top of the communication panel. Alternatively, click the ![](https://academy.creatio.com/docs/sites/default/files/images/Platform_basics/working_with_chats/btn_com_end_chat.png) button on the communication panel to complete any active chat. You can complete a chat at any time without waiting for the timeout. If a customer sends a new message after the chat has been completed, Creatio will create a new chat and add it to the corresponding processing queue.\n## Find similar contacts​\nCustomers can reach out to you through different channels. If the same person uses multiple channels, there is a chance of creating several contact records for the same customer in Creatio. When a new chat is added, Creatio performs an automatic search for similar contacts.\nThe search for similar contacts is performed based on the active [duplicate search rules](https://academy.creatio.com/documents?id=1591&anchor=title-747-10). After the search is complete, the chat window displays information about similar contact records. This enables minimizing the number of duplicates in Creatio.\nClick the link with the number of the detected duplicates to open the list of potential duplicate contacts on a separate page. The contact from the active chat is labeled as \"Current.\" Should you decide to merge the duplicates, the chat contact will be changed for a resulting record.\nFig. 5 Duplicate search results\n![Fig. 5 Duplicate search results](https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_merge_duplicates.png)\n## Create a case from a chat​\nThe \"Create case\" chat action is available for the following Creatio products:\n* Service Creatio\n* Financial services Creatio\nIf you run the action, Creatio will add a new case with the following fields populated:\n* **Subject** : text of the first chat message.\n* **Description** : text of all incoming messages received before the agent answered in the chat.\n* **Source** : \"Chat.\"\n* **Registration date** : the case creation date.\n* **Status** : \"New.\"\n* **Contact** : contact from the chat.\n* **Account** : the account of the contact.\n* **Assignee** : chat agent.\n## Transfer the chat to another agent or queue​\nCustomers might ask questions that are out of the channel scope. For example, a customer who is experiencing issues with placing an online order and wants an alternative way to place it may contact you via the tech support channel. In these cases, the agent can assist the customer with the issue and transfer the chat to a different queue. For example, the sales department. Alternatively, they can transfer the chat to a specific employee. For example, the customer’s account manager. To transfer the chat:\n1. **Open** the relevant chat in the communication panel.\n2. **Click** the ![](https://academy.creatio.com/docs/sites/default/files/images/Platform_basics/working_with_chats/btn_transfer_chat.png) button at the top. This will open the list of available chat queues and agents.\n3. **Select the queue or the agent** to whom to transfer the chat in the list (Fig. 6). The list displays the status of each agent: \"Active\" (green indicator), \"Inactive\" (red indicator), or \"Chats exceeded\" (gray indicator). You can transfer the chat:\n* to agents whose status is \"Active\" or \"Inactive\"\n* to queues that have one or more agents besides you\nnote\nCreatio sets the \"Chats exceeded\" status automatically if the number of chats an agent is processing equals the value of the \"Simultaneous Chats\" (\"SimultaneousChats\" code) [system setting](https://academy.creatio.com/documents?id=1259). The default value is 5 chats. This status is displayed only in the agent list during chat transfer and cannot be set manually.\nFig. 5 Transfer the chat to another agent or queue\n![Fig. 5 Transfer the chat to another agent or queue](https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_transfer_chat.png)\nAfter the transfer, Creatio completes the current chat and automatically creates a child chat. The status of the new chat depends on the way you transfer it:\n* If you transfer the chat to a specific employee, Creatio adds the new chat to the agent’s active chat list and sets the chat status to \"In progress.\"\n* If you transfer the chat to a queue, Creatio sets the chat status to \"Waiting for processing\" and distributes the chat among the queue agents based on the queue routing rules. The chat appears in the **New chats** list until a specific agent accepts the chat. After the chat is accepted, Creatio changes its status to: \"In progress.\" After the agent opens the chat, they can access the parent chat messages and carry on the conversation.\n## View chats and analytics​\nThe agent can access chat messages in the communication panel. Users that have [permission to read](https://academy.creatio.com/documents?id=262) the \"Chats\" object can view both live and complete chats in the **Chat** section. For example, this helps managers to provide assistance without chat escalation or understand the context of issues that take multiple chats to troubleshoot. All sent messages and files are also available on the **Timeline** tab of the corresponding contact pages as well.\nThe **Chat** section also lets you view detailed information about the chats, group the chats by different parameters, view the customer communication history, analyze the customer case dynamics for a specific period, view the agent workload as well as chat processing rate.\n## Process chats using an external chatbot​\nUse chatbots to pre-process messages incoming via the Facebook Messenger or Ada AI chatbot channel and reduce the load on your agents. The chatbot will provide answers to frequently asked questions, as well as pre-process requests before Creatio passes the chat to an agent. The chatbot platform can integrate with your public Facebook page and upload the processed customer requests to Creatio.\nChatbots can only be used with Facebook Messenger chats. Learn more about setting up a chatbot in a separate article: [Set up third-party chatbot integration](https://academy.creatio.com/documents?id=2384&anchor=title-2023-14).\nThe chatbot will process messages customers send to your public page via Facebook Messenger. Depending on the chatbot settings, the message exchange can be saved to Creatio after the chat is over or distributed to an agent.\n### Pre-process a request with the chatbot​\nThis logic implies that the chatbot passes the customer request to a Creatio agent who decides if further work with this chat is needed. You can use this setting for chats where customers ask non-standard questions or require access to non-public data. For example, sales contracts.\nGenerally, the chatbot request processing looks as follows:\n1. A new chat with the \"Bot processing\" state is created. The chat is available in the **Chat** section but is not displayed on the communication panel.\n2. After Creatio takes over, it completes the chat and automatically with the \"Handed over to agent\" state and creates a child chat.\n3. The new chat is routed to an agent according to the channel settings.\n4. When processing the child chat on the communication panel, the agent can access the parent chat messages. The agent can use them to decide to continue or complete the chat.\n5. After the agent chat is over with \"Completed\" status, Creatio hands over the chat to the prime recipient of the transfer protocol (the chatbot platform). If the customer sends a new message, a new chat will be created.\n### Process a request with the chatbot​\nThis logic implies that the chatbot processes Facebook Messenger customer requests without passing them to agents. You can use this setting to provide answers for frequently asked questions or process typical messages. For example, quote requests.\nGenerally, the chatbot request processing looks as follows:\n1. A new chat with the \"Bot processing\" state is created. The chat is available in the **Chat** section but is not displayed on the communication panel.\n2. The chat completes automatically after the last message is sent/received with \"Completed by bot status\" status. Manage the chat autocompletion time in the channel settings:\n* **At the end of the waiting time** if the queue's **Chat completion timeout** field is populated. Learn more in a separate article: [Add a chat queue](https://academy.creatio.com/documents?id=2382&anchor=title-2022-1).\n* **After 60 minutes** if no timeout is specified in the queue settings.\n3. After the chat is over, Creatio hands over the chat to the prime recipient of the transfer protocol (the chatbot platform). The customer and bot's message history is available in the **Chat** section.\n## Initiate a chat conversation (Classic UI)​\nIn Creatio, you can not only process incoming cases but also initiate chat conversations with customers. Your company employee can contact the customer through any available chat channel as part of their workflow. This functionality is available in Classic UI on the [action panel](https://academy.creatio.com/documents?id=1765&anchor=title-2141-5) of any section. For example, message the case contact, lead contact, opportunity participants, or account contacts.\nClick the channel button to fetch the connected contact or list of contacts you can message through the channel.\nYou can message the customer as long as the following conditions are true:\n* There is an active provider channel in Creatio.\n* The contact messaged you through the channel at least once.\n* The customer sent their last message through the channel within the last 24 hours (only for Facebook Messenger and WhatsApp).\nFig. 5 Initiate the chat in the Opportunities section\n![Fig. 5 Initiate the chat in the Opportunities section](https://academy.creatio.com/docs/sites/en/files/images/Platform_basics/work_with_chats/scr_start_chat_from_opportunity_page.png)\nIf one or more conditions are false and you click the channel button, Creatio will notify you that it is not possible to message the contact.\n* * *\n## See also​\n[Set up chat processing](https://academy.creatio.com/documents?id=2382)\n[Chat access](https://academy.creatio.com/documents?id=2383)\n* * *\n## Resources​\n[Tech Hour - Effective Use Of Chats in Creatio](https://www.youtube.com/watch?v=PUpXIW2fTjA)",
  "code_examples": [],
  "tables": [],
  "callouts": [
    {
      "type": "note",
      "title": "Note",
      "content": "noteThe time for taking a chat into processing, as well as the time limit for replying to an active chat, may be limited. Learn more in a separate article:Add a chat queue.",
      "html": "<div class=\"theme-admonition theme-admonition-note alert alert--secondary admonition_WoCw\"><div class=\"admonitionHeading_TMsN\">note</div><div class=\"admonitionContent_vXIg\"><p>The time for taking a chat into processing, as well as the time limit for replying to an active chat, may be limited. Learn more in a separate article: <a href=\"https://academy.creatio.com/documents?id=2382&amp;anchor=title-2022-1\" rel=\"noopener noreferrer\" target=\"_blank\">Add a chat queue</a>.</p></div></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "note",
      "html": "<div class=\"admonitionHeading_TMsN\">note</div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "The time for taking a chat into processing, as well as the time limit for replying to an active chat, may be limited. Learn more in a separate article:Add a chat queue.",
      "html": "<div class=\"admonitionContent_vXIg\"><p>The time for taking a chat into processing, as well as the time limit for replying to an active chat, may be limited. Learn more in a separate article: <a href=\"https://academy.creatio.com/documents?id=2382&amp;anchor=title-2022-1\" rel=\"noopener noreferrer\" target=\"_blank\">Add a chat queue</a>.</p></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "noteLearn more about setting up chat actions in a separate article:Set up the chat actions.",
      "html": "<div class=\"theme-admonition theme-admonition-note alert alert--secondary admonition_WoCw\"><div class=\"admonitionHeading_TMsN\">note</div><div class=\"admonitionContent_vXIg\"><p>Learn more about setting up chat actions in a separate article: <a href=\"https://academy.creatio.com/documents?id=2382&amp;anchor=title-2022-5\" rel=\"noopener noreferrer\" target=\"_blank\">Set up the chat actions</a>.</p></div></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "note",
      "html": "<div class=\"admonitionHeading_TMsN\">note</div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "Learn more about setting up chat actions in a separate article:Set up the chat actions.",
      "html": "<div class=\"admonitionContent_vXIg\"><p>Learn more about setting up chat actions in a separate article: <a href=\"https://academy.creatio.com/documents?id=2382&amp;anchor=title-2022-5\" rel=\"noopener noreferrer\" target=\"_blank\">Set up the chat actions</a>.</p></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "noteCreatio sets the \"Chats exceeded\" status automatically if the number of chats an agent is processing equals the value of the \"Simultaneous Chats\" (\"SimultaneousChats\" code)system setting. The default value is 5 chats. This status is displayed only in the agent list during chat transfer and cannot be set manually.",
      "html": "<div class=\"theme-admonition theme-admonition-note alert alert--secondary admonition_WoCw\"><div class=\"admonitionHeading_TMsN\">note</div><div class=\"admonitionContent_vXIg\"><p>Creatio sets the \"Chats exceeded\" status automatically if the number of chats an agent is processing equals the value of the \"Simultaneous Chats\" (\"SimultaneousChats\" code) <a href=\"https://academy.creatio.com/documents?id=1259\" rel=\"noopener noreferrer\" target=\"_blank\">system setting</a>. The default value is 5 chats. This status is displayed only in the agent list during chat transfer and cannot be set manually.</p></div></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "note",
      "html": "<div class=\"admonitionHeading_TMsN\">note</div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "Creatio sets the \"Chats exceeded\" status automatically if the number of chats an agent is processing equals the value of the \"Simultaneous Chats\" (\"SimultaneousChats\" code)system setting. The default value is 5 chats. This status is displayed only in the agent list during chat transfer and cannot be set manually.",
      "html": "<div class=\"admonitionContent_vXIg\"><p>Creatio sets the \"Chats exceeded\" status automatically if the number of chats an agent is processing equals the value of the \"Simultaneous Chats\" (\"SimultaneousChats\" code) <a href=\"https://academy.creatio.com/documents?id=1259\" rel=\"noopener noreferrer\" target=\"_blank\">system setting</a>. The default value is 5 chats. This status is displayed only in the agent list during chat transfer and cannot be set manually.</p></div>"
    }
  ],
  "images": [
    {
      "src": "https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_set_operator_status.png",
      "alt": "Fig. 1 Agent's status in the communication panel",
      "title": "",
      "context": "By default, the agent's status is \"Inactive.\" Change it in the communication panel (Fig. 1).",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_85f039c7dbac.png"
    },
    {
      "src": "https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_chats.png",
      "alt": "Fig. 2 Chats on Creatio communication panel",
      "title": "",
      "context": "The time for taking a chat into processing, as well as the time limit for replying to an active chat",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_6277b0831c35.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Setup_and_Administration/Chats/btn_com_view_chat_templates.png",
      "alt": "",
      "title": "",
      "context": "To use aquick reply template, click thebutton or type \"//\" in the reply field and proceed to enter t",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_49a621fbecd4.png"
    },
    {
      "src": "https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_chat_templates.png",
      "alt": "Fig. 3 Quick reply template search",
      "title": "",
      "context": "To use aquick reply template, click thebutton or type \"//\" in the reply field and proceed to enter t",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_92dbb6496c0d.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/default/files/images/2020-12/btn_menu.png",
      "alt": "",
      "title": "",
      "context": "Torun a chat action, for example, create a case, click thebutton in the top right corner of the comm",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_64817d7b9391.png"
    },
    {
      "src": "https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_perform_chat_actions.png",
      "alt": "Fig. 4 Run a chat action",
      "title": "",
      "context": "Learn more about setting up chat actions in a separate article:Set up the chat actions.",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_6a37eec7d106.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/default/files/images/Platform_basics/working_with_chats/btn_com_end_open_chat.png",
      "alt": "",
      "title": "",
      "context": "When the conversation is over, click thebutton at the top of the communication panel. Alternatively,",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_a04c8068edf2.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/default/files/images/Platform_basics/working_with_chats/btn_com_end_chat.png",
      "alt": "",
      "title": "",
      "context": "When the conversation is over, click thebutton at the top of the communication panel. Alternatively,",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_99047c9b40c4.png"
    },
    {
      "src": "https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_merge_duplicates.png",
      "alt": "Fig. 5 Duplicate search results",
      "title": "",
      "context": "Click the link with the number of the detected duplicates to open the list of potential duplicate co",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_362c8b1b6ce8.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/default/files/images/Platform_basics/working_with_chats/btn_transfer_chat.png",
      "alt": "",
      "title": "",
      "context": "Clickthebutton at the top. This will open the list of available chat queues and agents.",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_61689e23b563.png"
    },
    {
      "src": "https://d3a7ykdi65m4cy.cloudfront.net/ac-en/s3fs-public/images/Setup_and_Administration/Chats/8_1/scr_transfer_chat.png",
      "alt": "Fig. 5 Transfer the chat to another agent or queue",
      "title": "",
      "context": "Creatio sets the \"Chats exceeded\" status automatically if the number of chats an agent is processing",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_9e928c6c4991.png"
    },
    {
      "src": "https://academy.creatio.com/docs/sites/en/files/images/Platform_basics/work_with_chats/scr_start_chat_from_opportunity_page.png",
      "alt": "Fig. 5 Initiate the chat in the Opportunities section",
      "title": "",
      "context": "You can message the customer as long as the following conditions are true:",
      "width": "",
      "height": "",
      "local_path": "creatio-docs-full/images/docs_8.x_creatio-apps_8.2_creatio-basics_communications_work-with-chats_097b6b9466a8.png"
    }
  ],
  "videos": [
    {
      "type": "link",
      "src": "https://www.youtube.com/watch?v=PUpXIW2fTjA",
      "text": "Tech Hour - Effective Use Of Chats in Creatio"
    }
  ],
  "downloadables": [],
  "headings": [
    {
      "level": 1,
      "text": "Work with chats",
      "anchor": ""
    },
    {
      "level": 2,
      "text": "Change the agent status​",
      "anchor": "title-2114-1"
    },
    {
      "level": 2,
      "text": "Process chat messages​",
      "anchor": "title-2114-2"
    },
    {
      "level": 2,
      "text": "Find similar contacts​",
      "anchor": "title-2114-3"
    },
    {
      "level": 2,
      "text": "Create a case from a chat​",
      "anchor": "title-2114-4"
    },
    {
      "level": 2,
      "text": "Transfer the chat to another agent or queue​",
      "anchor": "title-2114-15"
    },
    {
      "level": 2,
      "text": "View chats and analytics​",
      "anchor": "title-2114-5"
    },
    {
      "level": 2,
      "text": "Process chats using an external chatbot​",
      "anchor": "title-2114-11"
    },
    {
      "level": 3,
      "text": "Pre-process a request with the chatbot​",
      "anchor": "title-2114-12"
    },
    {
      "level": 3,
      "text": "Process a request with the chatbot​",
      "anchor": "title-2114-13"
    },
    {
      "level": 2,
      "text": "Initiate a chat conversation (Classic UI)​",
      "anchor": "title-2114-10"
    },
    {
      "level": 2,
      "text": "See also​",
      "anchor": "see-also"
    },
    {
      "level": 2,
      "text": "Resources​",
      "anchor": "resources"
    }
  ],
  "api_docs": null,
  "sidebar_items": [
    {
      "href": "/docs/8.x/",
      "text": "Guides",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/communications/work-with-chats",
      "text": "Chats",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/creatio-basics/communications/work-with-chats",
      "text": "latest version",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.1/creatio-basics/communications/work-with-chats",
      "text": "8.1",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/platform-basics/user-interface/creatio-interface",
      "text": "8.0",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/overview",
      "text": "Overview",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/overview/platform-overview",
      "text": "Studio Creatio",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/overview/sales-creatio-overview",
      "text": "Sales",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/overview/marketing-creatio-overview",
      "text": "Marketing",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/overview/service-creatio-overview",
      "text": "Service",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/overview/financial-services-creatio-overview",
      "text": "Financial Services",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/platform",
      "text": "Platform",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/freedom-ui",
      "text": "Freedom UI",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/freedomUI/creatio-freedom-shell",
      "text": "Overview",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/freedomUI/manage-a-freedom-ui-list",
      "text": "Record list",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/freedomUI/record-pages",
      "text": "Record pages",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/freedomUI/search-records",
      "text": "Search records",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/freedomUI/timeline",
      "text": "Timeline",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/freedomUI/keyboard-shortcuts",
      "text": "Hotkeys",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/freedomUI/attachments-and-notes",
      "text": "Attachments",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/business-data",
      "text": "Business data",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/business-data/filters",
      "text": "Filters",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/business-data/folders",
      "text": "Folders",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/business-data/summaries",
      "text": "Summaries",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/business-data/tags",
      "text": "Tags",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/data-import",
      "text": "Data import",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/business-data/exporting-list-data-to-excel",
      "text": "Excel export",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/business-data/find-and-merge-duplicates",
      "text": "Duplicates",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/business-data/share-records",
      "text": "Share records",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/business-data/delete-records",
      "text": "Delete records",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/communications",
      "text": "Communications",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/communications/check-notifications-and-process-tasks",
      "text": "Notifications",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/communications/approvals",
      "text": "Approvals",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/communications/managing-calls",
      "text": "Calls",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/communications/time-zones",
      "text": "Time zones",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/communications/working-with-emails",
      "text": "PreviousEmails",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/communications/work-with-message-templates",
      "text": "NextMessage templates",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/mobile-app",
      "text": "Mobile app",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/mobile-app/mobile-application-setup",
      "text": "Setup",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/mobile-app/mobile-application-freedom-interface",
      "text": "Freedom UI",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/mobile-app/mobile-application-interface",
      "text": "Classic UI",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/mobile-app/work-with-the-calendar",
      "text": "Calendar",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/mobile-app/how-to-work-in-the-dashboards-section",
      "text": "Dashboards",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/mobile-app/use-the-portal-in-the-mobile-app",
      "text": "Portal",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/mobile-app/mobile-application-faq",
      "text": "FAQ",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/view-analytics",
      "text": "View analytics",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/running-business-processes",
      "text": "Running business processes",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/running-business-processes/run-business-process",
      "text": "Run a process",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/running-business-processes/execute-process-steps",
      "text": "Execute a process",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/running-business-processes/resume-business-process",
      "text": "Resume a process",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/creatio-basics/use-two-factor-authentication",
      "text": "Use two-factor authentication",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/products",
      "text": "Products",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/common-features",
      "text": "Common features",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/marketing-tools",
      "text": "Marketing tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/sales-tools",
      "text": "Sales tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/service-tools",
      "text": "Service tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/finance-and-banking",
      "text": "Finance and banking",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/category/industry-cases",
      "text": "Industry cases",
      "active": false
    }
  ],
  "related_links": [],
  "version": "8.x",
  "crawled_at": "2026-01-15T05:30:42.191321"
}