{
  "url": "https://academy.creatio.com/docs/8.x/creatio-apps/financial-services/category/financial-services",
  "title": "Creatio Studio overview",
  "breadcrumbs": [
    {
      "text": "Overview",
      "href": "/docs/8.x/creatio-apps/category/overview"
    }
  ],
  "content_markdown": "Version: 8.3All Creatio products\nOn this page\nNo composable apps are included as part of Creatio Studio.\n[Creatio Studio](https://www.creatio.com/studio), the core of the Creatio product suite, is a no-code platform to automate workflows and build applications while enjoying the maximum degree of freedom. Built on a composable no-code architecture, the platform empowers non-technical individuals and no-code creators to effortlessly design and customize their distinctive business solutions using pre-built, composable components. The platform is required for any Creatio instance. The Creatio platform functionality is implemented in base packages. You can customize out-of-the-box functionality. The customizations extend functionality by replacing the base schemas and do not modify base packages and their schemas.\nCreatio Studio features a business process management (BPM) engine, empowering users to design, execute, and monitor business processes and workflows of varying complexities, irrespective of industry or business type. The platform's automation capabilities are elevated through its built-in AI tools, encompassing a wide array of use cases, including generative AI.\nCreatio Studio serves as the foundation for other Creatio products – Marketing, Sales, and Service – comprising all the technologies and tools inherent to the Creatio Studio platform.\nCreatio Studio lets you:\n* Craft enterprise-grade applications with modern, user-friendly interfaces – all achieved without the need for coding.\n* Design and automate complex organizational workflows using the integrated, robust capabilities of BPM and AI.\n* Seamlessly integrate your newly created solutions into an organization's digital ecosystem.\n* Accelerate application development by leveraging ready-to-use solutions and templates from the Creatio Marketplace.\n* Enhance the efficiency of solution implementation through robust delivery and support mechanisms.\n### Creatio Studio capabilities​\nExplore Creatio Studio's diverse suite of integrated tools:\n* **No-code technology** provides a seamless way to create and customize applications, from the modification of business logic on section pages to the establishment of app branding, and more. The No-Code Designer facilitates app customization, while the Freedom UI Designer allows detailed refinement of individual pages and data structures. Additionally, you can configure custom business rules to fine-tune app logic, such as the ability to hide fields based on specific conditions.\n* **Composability**. Creatio Studio is built on a composable no-code architecture, enabling organizations to streamline application creation. As all components of the architecture are pluggable, replaceable, and reusable, the extensive configuration, customization, and development efforts are replaced by assembling apps from available components. The platform provides an extensive library of composable components that no-code creators can utilize to assemble function blocks, applications, and even full-fledged products without the need for coding.\n* **BPMN 2.0-driven Process Designer** offers an intuitive drag-and-drop interface to construct and automate business processes and workflows. Utilizing ready-to-use elements, users can create business processes of any complexity, schedule activities, work with UI pages, process data, and call web services. A user-friendly setup **UI** and built-in validation tools help not only facilitate the design or update of business process charts but also streamline the debugging process, accounting for all execution details and nuances.\n* Within the Creatio Marketplace, you'll find a broad selection of **ready-to-use apps** tailored for Creatio Studio. These marketplace offerings facilitate the integration of varied systems and services into Creatio, providing a functional business solution that aligns with your specific needs. Moreover, the Creatio Marketplace lets you share and monetize your custom applications.\n* **Enterprise-grade scalability**. The multi-level architecture of Creatio allows you to scale your applications seamlessly, accommodating a user base ranging from a few users to tens of thousands. The high performance of Creatio solutions is underpinned by high-speed data processing and a maintained reliability level, achieved through a blend of component fault tolerance, system protection from logical data destruction, and meticulous distribution of access permissions.\n* **AI technologies** let you automate routine tasks and select optimal solutions at specific stages. Intelligent search and data mining algorithms combined with smart interface and ML technologies enable users to streamline and automate decision-making. For example, Creatio’s ML models allow for setting up customer profile categorization, routing help desk calls, or predicting the probability of closing an opportunity. Additionally, through the integration with OpenAI, you can generate a new application, with Creatio adding views, data models, and objects automatically based on a text prompt.\n* The **built-in integration tools** , based on .NET, REST, SOAP, OData, and open API, facilitate a smooth connection between external business applications and Creatio. An administration and access control system accelerates the secure integration of Creatio into the enterprise digital ecosystem. Creatio Studio provides limitless flexibility for third-party integrations as well.\n* **Built-in development tools** enable professional developers to customize Creatio for specific business goals. The platform provides an integrated development environment (IDE) for in-depth customization and building custom business apps. The development tools also provide control over custom configuration packages, app version control, and migration between working environments.\n* You can set up **user and role access permissions** to safeguard data integrity and provide multi-layer protection against unauthorized access to Creatio. Establishing distinct access permissions for Creatio data and functionalities based on individual users and user groups, categorized by organizational or functional roles, is a crucial aspect of system configuration. Within Creatio Studio, you can also allocate access to business data—such as section records or dashboards—as well as to Creatio functionality, including tasks like exporting records to Excel, designing business processes, and configuring sections.\n* The **Creatio Mobile app** empowers users to access crucial data and core functionalities anytime, anywhere. You can build both desktop and mobile apps in Creatio Studio. The mobile app is delivered along with other Creatio products and is available for iOS and Android platforms. You can use the mobile app as a remote workstation to access customer data, your personal activities, mobile feed, and dashboards.\n## Creatio Studio technologies​\nThe Creatio Studio platform relies on **[key technologies and characteristics](https://www.creatio.com/our-technologies)** that ensure seamless and efficient operations across organizations of all sizes and business models. These foundational elements guarantee the smooth functioning of both the Creatio platform and its products.\n* **[Microservice architecture and open-source technologies](https://www.creatio.com/our-technologies/architecture-and-principles)**. The principles of microservice architecture ensure superior performance, fault-tolerance, and scalability of business apps. Autonomous microservices facilitate horizontal and vertical component scaling and provide smooth 24/7 operation. Open-source components let you develop apps according to the latest tech requirements, addressing complex technological challenges, and optimizing resource utilization for on-site Creatio deployment.\n* **[Security on all levels](https://www.creatio.com/our-technologies/security)**. Creatio's complex multi-level security system can track operations and events at the application and network tiers, ensuring comprehensive monitoring of each security level. Additionally, the data storage infrastructure regularly and securely archives critically important information.\n* **[Performance and reliability](https://www.creatio.com/our-technologies/performance-and-reliability)**. Horizontal scaling of all subsystems ensures top Creatio performance in large-scale projects. This approach enables smooth operation regardless of the number of users while supporting seamless updating of OS components and other software. The operation capacity is ensured through the integration with monitoring systems, core component scaling, and automated deployment process for application services.\n* **[Open platform](https://www.creatio.com/our-technologies/open-platform)**. The Creatio platform is built with customization, flexibility, and scalability in mind. This approach empowers developers to create bespoke modules and adapt existing functionality to meet any specific business requirements. Creatio provides a wide range of tools for integration with third-party systems and applications. The platform is compatible with most open protocol standards, facilitating effective integration with various third-party and industry-specific systems.\n* **[Regular updates](https://www.creatio.com/our-technologies/regular-updates)**. Continuous deployment and flexible development processes accelerate the delivery of new functionality to users. Each new Creatio release maintains compatibility with public APIs and data models and is compatible with custom apps developed on the previous versions. This ensures high productivity of custom applications from the Creatio Marketplace, allowing users to preserve customized settings with the assistance of wizards, visual editors, and development tools.\n* [**Cloud deployment**](https://www.creatio.com/our-technologies/cloud). Users of Creatio have the flexibility to select a deployment option that aligns with their business needs and internal policies, whether it be cloud-based or on-premises.",
  "code_examples": [],
  "tables": [],
  "callouts": [],
  "images": [],
  "videos": [],
  "downloadables": [],
  "headings": [
    {
      "level": 1,
      "text": "Creatio Studio overview",
      "anchor": ""
    },
    {
      "level": 3,
      "text": "Creatio Studio capabilities​",
      "anchor": "title-1-1"
    },
    {
      "level": 2,
      "text": "Creatio Studio technologies​",
      "anchor": "title-1-2"
    }
  ],
  "api_docs": null,
  "sidebar_items": [
    {
      "href": "/docs/8.x/",
      "text": "Guides",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/platform-overview",
      "text": "Creatio Studio",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/overview/platform-overview",
      "text": "8.2",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.1/overview/platform-overview",
      "text": "8.1",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/platform-basics/user-interface/creatio-interface",
      "text": "8.0",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/overview",
      "text": "PreviousOverview",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/sales-creatio-overview",
      "text": "NextSales",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/marketing-creatio-overview",
      "text": "Marketing",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/service-creatio-overview",
      "text": "Service",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/financial-services-creatio-overview",
      "text": "Financial Services",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/platform",
      "text": "Platform",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/category/products",
      "text": "Products",
      "active": false
    }
  ],
  "related_links": [],
  "version": "8.x",
  "crawled_at": "2026-01-15T05:53:58.985989"
}