{
  "url": "https://academy.creatio.com/docs/8.x/no-code-customization/category/freedom-ui-designer",
  "title": "App development basics",
  "breadcrumbs": [
    {
      "text": "Customization tools",
      "href": "/docs/8.x/no-code-customization/category/customization-tools"
    },
    {
      "text": "Recommendations",
      "href": "/docs/8.x/no-code-customization/category/recommendations"
    }
  ],
  "content_markdown": "Version: 8.3All Creatio products\nOn this page\nLevel: beginner\nApps are function blocks that solve business problems and are the main unit of Creatio no-code development. No-code tools streamline the app creation process and make it accessible for both professional developers and business users.\nThe app creation process involves multiple phases regardless of the app scale and purpose:\n1. Design. Read more >>>\n2. Go-live. Read more >>>\n3. Everyday delivery. Read more >>>\nThe article covers each phase with emphasis on the best practices. You can use Creatio Service to track app development, improvement, and support efforts. This product lets you manage changes, problems, and releases. Learn more: [Case Management](https://academy.creatio.com/docs/8.x/creatio-apps/category/case-management).\n## Design​\n**Business use case**. Start working on the app by specifying business requirements, i. e., project goals and objectives, at a high level. This involves the following steps:\n* Define the app stakeholder.\n* Determine business processes the app is going to implement, then decompose them into smaller process use cases.\n* Review how consistent the use cases are across your organizational structure.\n* Define the success criteria.\n**Options analysis**. Once you have a business use case, determine whether no-code is the best possible approach. Coding or ready-made apps on Creatio Marketplace help to resolve some business problems more effectively. To determine the best avenue of approach, we recommend answering the following questions:\n* How standardized is your business process? Highly standardized business processes, for example, accounting, might already have an app on Creatio Marketplace.\n* How much customization is needed to meet your business needs and provide a competitive advantage? Little customization means a Creatio Marketplace app might be a better solution. A lot of customization means coding might work better.\n* How technically complex is your case? You can add custom-coded functionality to a no-code app, but particularly complex cases might not need no-code functionality at all.\n* Are there any custom integrations required? In some cases, you might want to develop a custom app to ensure the integrations work as intended.\n**Design and prototyping**. While traditional development requires design documents and external tools, for example, Figma or Adobe XD, Creatio No-code Designer lets you create prototypes that already contain basic functionality. That said, do not attempt to create a ready-to-release minimum viable product (MVP) at this stage. Settle for something that is close enough to your vision:\n* Create a single happy path for a user in the UI.\n* Focus on the top-level workflow, for example, the main business process.\n* Simplify the integrations. You can use REST/SOAP services, prebuilt connectors, or simple mockups if custom integrations are required.\n* Add only simple dashboards that display KPIs.\n**Project assignment**. The final stage of the design phase requires you to narrow the scope to plan for an MVP. We recommend taking the following steps:\n* Decompose the business use case. This will help you see which subprocesses to include in the MVP.\n* Prioritize and confirm the go-live scope of subprocesses with the stakeholder. We recommend stack-ranking subprocesses for prioritization. To create and prioritize tasks, use tools that support online access, co-editing, change versioning. For example, you can use Visio to describe the requirements as processes. Cloud test editors, Confluence, Jira, Miro are optimal for managing text descriptions. Use online tables or User story mapping format in Miro, Jira for prioritization.\n* Apply timeline constraints. Understand the business timetable and check whether you have a defined timeline linked to the success criteria.\n* Set up future project enablement. Make sure you have the additional resources required for the project to succeed. This can include the following: \n* power user recruitment\n* governance checks\n* user enablement plans\n* no-code environments\n* release strategy\n## Go-live​\n**Prototype-to-MVP**. We recommend starting app development from an existing prototype you created during the design phase. This lets you accelerate development. Take the following steps as part of the app development:\n* While you concentrated on a single happy path when creating a prototype, now is the time to branch out by adding other paths. Ensure the data source structure is clear and consistent. Set up business rules if needed. This is also a good time to review brand and UX to ensure the app is in line with corporate branding.\n* Add more details around subprocesses and individual tasks, improve edge cases, and ensure processes handle errors gracefully.\n* If your prototype has integration mockups, it is time to implement them fully.\n* Ensure the dashboards cover key aspects required for analysis. Add more widgets if needed.\n* Test end-to-end scenarios and APIs. Test the app on the user group that corresponds to the real target audience. In this case, the test scenario must direct users without imposing correct solutions on them.\nIf you want multiple developers to work on the app, make sure that the following requirements are met:\n* Developers have access to the version control system that stores the composable app at the development stage and the change history of the app.\n* Developers understand the commands from the version control system client.\nA single version control system can include multiple repositories. However, one repository can store only different versions of a single composable app. You can track changes since the commits of different apps do not cause a conflict.\nWhen you work on a single data source, ensure developers discuss changes in advance and make agreements. This prevents conflicts when committing changes. If a change commit causes an error, resolve conflicts using default tools of the version control system client.\nImportant\nWorking together with properties of the same element might cause a conflict that must be solved manually.\nThe exception is conflicts that occur when you work collaboratively on schemas stored in the package properties. For example, `ClientSchema`, `EntitySchema`, `ProcessSchema`. You cannot resolve these conflicts using default tools of the version control system client.\n**Feedback loop**. While it is a good idea to collect feedback at any stage, processing it intelligently requires a dedicated framework. We recommend taking the following steps:\n* Communicate with a stakeholder. It is most efficient to work with a single stakeholder who has a good understanding of the business process, has sufficient authority to make functionality-related decisions, and understands the technology.\n* Build and review micro use cases. Develop the app in small chunks and review each chunk as soon as it is ready. This lets you do feedback sessions quickly, efficiently, and regularly. We recommend aiming for multiple sessions per week.\n* Triage Go-Live scope. Even though you are collecting feedback constantly, keep the MVP in focus. Check which feedback you can implement in the MVP and which feedback goes to the backlog.\n* Keep addressing feedback after release using the same procedure.\n**Governance checks**. Although No-Code Designer helps to accelerate development and empower employees that have no coding skills, if you expect your app to be used by real users, it still must comply with a variety of rules and regulations. As such, check whether your app complies with the following checklists:\n* External compliance. For example, external laws, guidelines, and regulations imposed by governments, industries, or organizations.\n* Internal compliance. For example, rules, regulations, and practices as defined by internal policies and access controls.\n* Security. For example, rules to protect your corporate information resources from external or internal attacks.\n* Data governance. For example, assessments of how sensitive corporate data is managed and secured.\n**First release**. Before you can release your app to the users, make sure your infrastructure can support it. This includes both users and technology.\nAs far as users are concerned, unless your app is very small, you are going to need app documentation and a dedicated support team. You can create documentation in the [Knowledge Management app](https://marketplace.creatio.com/app/knowledge-management) and establish the support workflow in the [Case Management app](https://marketplace.creatio.com/app/case-management).\nAlso, consider how you are going to onboard users to your new app. It might be better to use phased onboarding to ease both the users and your infrastructure into the app gradually.\nAs far as technology is concerned, the release pipeline has to include multiple environments. The exact number of needed environments can vary depending on the app complexity. For example, a small app might only require a development and production environment. However, larger apps might require the full set of environments, specifically:\n* Sandbox. Use it to prototype the app and test the prototype as much as needed without the changes affecting the actual development.\n* Development. Use it to create apps.\n* QA. This environment must be new to ensure existing business logic and data do not impact the delivery and test results. Use it to test the app. To ensure the high quality of the app, automate the testing steps using a CI/CD server. This lets you receive test results immediately, which speeds up the preparation of release artifacts.\n* Preproduction. This environment must mimic the production environment, i.e., live site. Use it to perform final tests to ensure the customizations do not impact the existing business logic and work as expected.\n* Production. This is your live site that actual users use. Install the app into a production environment only after the app has been tested successfully and recognized as a release version.\nOnce you have the infrastructure prepared, obtain approval for release from the stakeholder and perform the final user acceptance test. Since released app is the priority at this stage, validate only the highest-level business requirements. Accept only the most critical feedback and move everything else to backlog.\n## Everyday delivery​\n**Feedback collection**. Development is not over once you release an app. It is important to keep improving it. To do that, collect feedback from the stakeholder, end users, and system itself. You can collect feedback using a wide variety of methods, for example:\n* email surveys\n* focus groups\n* user shadowing\n* UX questionnaires\n* in-app feedback widget\n* net promoter score\n* usage analytics\nAvoid common pitfalls while you collect feedback:\n* Prioritizing vocal minority of users. To ensure you are dealing with a truly significant issue, cross-reference user feedback with app data you collect.\n* Prioritizing infrequent users. It is important to collect feedback from any type of users, but infrequent users are not going to provide as much insight as power users.\n* Processing feedback slowly. Keep up the pace similar to what you did during the go-live phase. Schedule feedback sessions multiple times a week.\n**Incremental improvements**. It is important to keep improving the app. Unlike traditional development, No-Code Designer can deploy improvements in smaller increments. This lets you adapt to changes and process feedback much more quickly. We recommend taking the following steps as part of this stage:\n* Create new app uses cases based on feedback data and decompose them to micro use cases.\n* Prioritize feedback based on how it can let you achieve business goals. Approve the use case priority with a stakeholder.\n* Build and test enhancements once you have a priority list. We recommend creating a unified backlog of features. It is also important to ensure new changes don’t break existing features.\n* Sometimes you might need to change the entire app design as part of improvements. This is fine. You might even return to options analysis to see what type of development works best for the app in its current state.\n* You might need to pass more governance checks as changes might influence the complexity level of the application. For example, additional access permissions. Everyday delivery. Deliver the improvements you created as quickly as possible. In general, the procedure to deliver changes during this stage is the same as during Go-live phase. However, we recommend you shift your focus to implementing micro use cases. Users generally adapt to smaller changes easier. Also, inform users about your updates, be it through release notes or training sessions.\n**Application audit**. Keep auditing the app to ensure it remains compliant with standards and remains useable. Review the following:\n* App itself. Review the UX complexity, app performance, and the impact of data on performance.\n* Feature and app obsolescence. Retire features once users no longer need them. Also, retire the app itself once it reaches its end of life.\n* Organization changes. Make sure the app is always in line with current operational process and organizational structure.\n* Governance changes. Make sure the app is always in line with current internal and external requirements.\n* Component reuse. Some of the components you created during development might be useful for other projects. This is going to accelerate further app development significantly, so be on the lookout for them.\n* * *\n## See also​\n[Manage apps](https://academy.creatio.com/documents?id=2377)",
  "code_examples": [],
  "tables": [],
  "callouts": [
    {
      "type": "warning",
      "title": "Warning",
      "content": "ImportantWorking together with properties of the same element might cause a conflict that must be solved manually.",
      "html": "<div class=\"theme-admonition theme-admonition-caution alert alert--warning admonition_WoCw\"><div class=\"admonitionHeading_TMsN\">Important</div><div class=\"admonitionContent_vXIg\"><p>Working together with properties of the same element might cause a conflict that must be solved manually.</p></div></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "Important",
      "html": "<div class=\"admonitionHeading_TMsN\">Important</div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "Working together with properties of the same element might cause a conflict that must be solved manually.",
      "html": "<div class=\"admonitionContent_vXIg\"><p>Working together with properties of the same element might cause a conflict that must be solved manually.</p></div>"
    }
  ],
  "images": [],
  "videos": [],
  "downloadables": [],
  "headings": [
    {
      "level": 1,
      "text": "App development basics",
      "anchor": ""
    },
    {
      "level": 2,
      "text": "Design​",
      "anchor": "title-2380-1"
    },
    {
      "level": 2,
      "text": "Go-live​",
      "anchor": "title-2380-2"
    },
    {
      "level": 2,
      "text": "Everyday delivery​",
      "anchor": "title-2380-3"
    },
    {
      "level": 2,
      "text": "See also​",
      "anchor": "see-also"
    }
  ],
  "api_docs": null,
  "sidebar_items": [
    {
      "href": "/docs/8.x/",
      "text": "Guides",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/customization-tools/recommendations/recommendations-on-app-creation",
      "text": "Basics",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.2/customization-tools/recommendations/recommendations-on-app-creation",
      "text": "8.2",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.1/customization-tools/recommendations/recommendations-on-app-creation",
      "text": "8.1",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/8.0/nocode-platform/UI-designer",
      "text": "8.0",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/customization-tools",
      "text": "Customization tools",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/recommendations",
      "text": "PreviousRecommendations",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/customization-tools/recommendations/best-practices",
      "text": "NextInfrastructure",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/app-management",
      "text": "App management",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/ui-and-business-logic-customization",
      "text": "UI and business logic customization",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/custom-localization",
      "text": "Custom localization",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/system-settings-and-lookups",
      "text": "System settings and lookups",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/print-ready-reports",
      "text": "Print-ready reports",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/appearance-customization",
      "text": "Appearance customization",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/tags-setup",
      "text": "Tags setup",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/ai-tools",
      "text": "AI tools",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/base-integrations",
      "text": "Base integrations",
      "active": false
    },
    {
      "href": "/docs/8.x/no-code-customization/category/bpm-tools",
      "text": "BPM tools",
      "active": false
    },
    {
      "href": "https://academy.creatio.com/docs/8.x/creatio-apps/category/case-management",
      "text": "Case Management",
      "active": false
    }
  ],
  "related_links": [],
  "version": "8.x",
  "crawled_at": "2026-01-15T01:44:55.934857"
}