{
  "url": "https://academy.creatio.com/docs/8.x/creatio-apps/8.0/crm-tools/landing-pages-and-web-forms/landing-page-setup-faq",
  "title": "Landing page setup FAQ",
  "breadcrumbs": [
    {
      "text": "CRM tools",
      "href": "/docs/8.x/creatio-apps/8.0/category/crm-tools"
    },
    {
      "text": "Landing pages and web forms",
      "href": "/docs/8.x/creatio-apps/8.0/category/landing-pages-and-web-forms"
    }
  ],
  "content_markdown": "Version: 8.0Marketing\nOn this page\n## What is the purpose of the **Landing pages and web forms** section in Creatio?​\nThe **Landing pages and web forms** section is used to set up integration between Creatio and web forms on your websites. As a result, each time an integrated web form is submitted, a new record is automatically created in Creatio using data from the submitted form. Landing page integration can be used for generating leads, adding customers to event participants, automatic order registration, and more.\nThe **Landing pages and web forms** section is used for setting up connections between landing pages on your website and Creatio. In the **Landing pages and web forms** section a landing page record must be created that contains basic information about the landing page and a unique HTML code that must be integrated into the HTML code of the landing page.\nAfter performing these settings, the data entered in the web form of the landing page, such as full name, email, phone, will be passed to Creatio and used to add a new record (for example a new lead) in Creatio.\n## What are the difference between a landing page on the website and a Creatio landing page record?​\nWhen setting up a landing page two main entities must be differentiated:\n* A landing page on the website.\n* A landing page record in the **Landing pages and web forms** section of Creatio. A landing page record contains information on the actual landing page, for example, its name, link, etc. These records are used to set up connections between a landing page on a website and Creatio.\nAn actual landing page and the corresponding landing page record in the **Landing pages and web forms** section have their own HTML code used to connect the two entities. The unique code of a landing page record is integrated into the HTML code of an actual landing page on a website.\n## What does the landing page code do?​\nThe HTML code of a landing page is required to automatically create a new record in the system if a web form on the landing page is filled in. This code is used for setting up the data transfer between a landing page on a website to Creatio. Initially, the code fragment is set up for a specific landing page and then integrated into the HTML code of the landing page. Learn more about managing the landing page HTML code in a separate article: [Connect your website landing page to Creatio](https://academy.creatio.com/documents?id=1083).\n## How do I use the **Website domains** field?​\nEnter the actual landing page URL in the **Website domains** field.\nFor example, the website name is [www.example.com](http://www.example.com). This website has a landing page available at the following address: [www.example.com/landing](http://www.example.com/landing). This address must be entered in the **Website domains** field on the Creatio landing record page.\nImportant\nThe address entered in this field must match the address of the landing page where the HTML code was integrated.\nnote\nIn the **Website domains** field, specify all domains used to host the landing page. The domains must be separated with commas.\n## How do I use the **Redirection URL** field?​\nThe **Redirection URL** field in the landing code determines the page where the user is redirected after filling out the landing page webform. You can specify the address of any page on your website. If your website settings specify a different action after filling out the landing page, leave this field empty.\nIf you fill in the **Redirection URL** field for a new **Landing pages and web forms** section record, then the unique HTML code of this record will contain the link to the page specified in the **Redirection URL** field in the redirectUrl block.\nThus, for the proper functioning of the landing page, fill out the landing page record fields, including **Redirection URL** and save the record, then connect the landing page record with the landing page. Learn more about managing the landing page HTML code in a separate article: [Connect your website landing page to Creatio](https://academy.creatio.com/documents?id=1083).\n## How do you set up one landing page record for a page with several web forms?​\nIf your landing page has several web forms, you can use a single Creatio landing page record to connect to all of them.\nImportant\nThe settings below are performed by the website administrator.\nIn the standard HTML code of the landing page record in Creatio, there is a \"config,\" block where field mapping between web forms and lead fields are set up. To set up a mapping between a lead record field and **several web forms** , create several \"config\" blocks in the code, one for each actual web form. A separate createLead function must be set up for each \"config\" block.\nFor example, your landing page has two web forms. The first form contains \"Full name\" and \"Email\" fields, and the other one contains \"Full name\" and \"Mobile phone\" fields. To use one landing for the landing page with two web forms, make the following changes to the code:\n1. Copy the whole \"config\" block as many times as the number of web forms that you need to connect to the landing page record in Creatio.\n2. Add unique names to the \"config\" blocks whose parameters are passed to the createLead function. For example \"config1\" and \"config2.\"\n3. In the \"config1\" block, set up the mapping of the fields from the first web form:\nName: \"#...\" Email: \"#...\"  \n4. In the \"config2\" block, set up the mapping of the fields from the second webform:\nName: \"#...\" Phone: \"#...\"  \n5. Set up two createLead functions:\nfunction createLead1() { landing.createLeadFromLanding(config1) } function createLead2() { landing.createLeadFromLanding(config2) }  \n6. For each web form, set up calling of a separate createLead function:\nonsubmit=\"createLead1(); return false\" onsubmit=\"createLead2(); return false\"  \nAfter this, a lead will be created in Creatio each time a user fills out any of the two web forms.\n## How do I set up a single landing for several pages?​\nIf several web forms with a similar structure are implemented in several pages within one domain, you can use a single landing page record for all of them. To do this, enter all needed URLs in the **Website domains** field, separating them with commas: <https://www.creatio.com/trial?product=sales>, <https://www.creatio.com/trial?product=marketing>\nAs a result, when a web form is filled out on any of the website pages, where this landing page code is integrated, a new record (for example, lead) will be automatically created in Creatio.\n## Why will Creatio not register leads despite the properly customized landing page?​\nAfter you have created and [set up](https://academy.creatio.com/documents?id=1083) a landing page, new records will be registered in Creatio when the landing page webform is filled in. If it doesn’t happen, perhaps one of the landing page fields (such as lead) is required but either not included in the web form, or not filled.\nIn this case, you can:\n* Clear the **Required** checkbox from the lead page fields (or the page fields of another Creatio object). Learn more about changing fields on edit pages in a separate article: [Set up page fields](https://academy.creatio.com/documents?id=1398).\n* [Set up](https://academy.creatio.com/documents?id=1523) the population of these fields with default values.\n## How to set up the population of fields with default values for leads registered via a landing page?​\nThe landing page webform can contain all the fields used by Creatio on the lead page. You can set up automatic population of individual fields with default values. Learn more about populating the lead fields with default values in a separate article: [Set up autofill for lead page fields](https://academy.creatio.com/documents?id=1523).\n## How does Creatio search for contact duplicates while creating leads from landing pages?​\nAs soon as your customer submits a web form on your landing page, Creatio automatically creates a new lead record based on the entered data. After this, the \"Searching and creating contact\" process starts automatically to check whether the new lead can be linked to an existing contact or if a new contact needs to be created. This helps Creatio to avoid creating contact duplicates when new leads are registered from landing pages. You can view or edit the \"Searching and creating contact\" process in the process library.\nnote\nThe \"Searching and creating contact\" process starts only if the **Create contact** checkbox is selected for the landing page.\nLearn more about the contact identification mechanism in a separate article: [Identify contacts that submit web forms](https://academy.creatio.com/documents?id=2371).\n## How do I set up the correct population of lead creation time?​\nA situation may occur an incorrect date was set in the **Creation date** when registering a lead via a landing page.\nTo avoid this, we recommend you to check the time zone set on the server where Creatio is hosted. For the lead creation time to be set correctly, make sure that the time zone on the application server corresponds to your actual time zone.\n## Can I configure the website event tracking for manually registered leads?​\nYou cannot configure the website event tracking for manually registered leads.\nThe website event tracking is executed based on the history of the transitions through the website of a specific Internet user. During the tracking process, a certain session is recorded in the browser by using cookies. If a lead is created manually, no web-page visitor is connected to a web-browser session. Thus, the history of the website navigation of such a user cannot be tracked.\nIf an internet user, having made several transitions through the pages, fills in the landing page web form of your website, the history of his transitions will be transferred to Creatio.\nnote\nIf a user clears the browser cookies before filling out the landing page web form, the history of his transitions will be removed and will not appear in Creatio.\n## How do I configure data transfer from one landing page web form to separate lead page fields?​\nThere is the \"config\" block in the HTML code of the landing page. This block configures the mapping of landing page web form fields and lead fields. To set up the correspondence of one landing page webform field to multiple lead fields, you will need to add a hidden field to the HTML code of the landing page, set up the mapping, and then configure the createLead function.\nFor example, a single \"Name\" field is implemented in the web form of your landing page. And Creatio lead page has two separate fields: **First name** and **Last name**.\nImportant\nThe settings below are performed by the website administrator.\nTo populate the **First name** and **Last name** lead page fields correctly, make the following changes to the code:\n1. Add two hidden fields to the HTML markup:\n<input type=\"hidden\" id=\"selectedNameCaption\" /> <input type=\"hidden\" id=\"selectedSecondNameCaption\" />  \n2. Set up the mapping of the hidden fields in the \"config\" block:\n\"Name\": \"#selectedNameCaption\" \"SecondName\": \"#selectedSecondNameCaption\"  \n3. Before calling the function to create a lead, add a function, which describes the logic of the **Name** and **Surname** fields taking the value from the **Name** field.\n* * *\n## See also​\n[Configure the [Employees] section](https://academy.creatio.com/documents?id=1745)\n[Create a knowledge base article](https://academy.creatio.com/documents?id=1006)\n[Set up landing page integration](https://academy.creatio.com/documents?id=1775)",
  "code_examples": [
    {
      "code": "Name: \"#...\" Email: \"#...\"",
      "language": "js",
      "context": "In the \"config1\" block, set up the mapping of the fields from the first web form:",
      "tab_label": "",
      "line_count": 1
    },
    {
      "code": "Name: \"#...\" Phone: \"#...\"",
      "language": "js",
      "context": "In the \"config2\" block, set up the mapping of the fields from the second webform:",
      "tab_label": "",
      "line_count": 1
    },
    {
      "code": "function createLead1() { landing.createLeadFromLanding(config1) } function createLead2() { landing.createLeadFromLanding(config2) }",
      "language": "js",
      "context": "Set up two createLead functions:",
      "tab_label": "",
      "line_count": 1
    },
    {
      "code": "onsubmit=\"createLead1(); return false\" onsubmit=\"createLead2(); return false\"",
      "language": "js",
      "context": "For each web form, set up calling of a separate createLead function:",
      "tab_label": "",
      "line_count": 1
    },
    {
      "code": "<input type=\"hidden\" id=\"selectedNameCaption\" /> <input type=\"hidden\" id=\"selectedSecondNameCaption\" />",
      "language": "js",
      "context": "Add two hidden fields to the HTML markup:",
      "tab_label": "",
      "line_count": 1
    },
    {
      "code": "\"Name\": \"#selectedNameCaption\" \"SecondName\": \"#selectedSecondNameCaption\"",
      "language": "js",
      "context": "Set up the mapping of the hidden fields in the \"config\" block:",
      "tab_label": "",
      "line_count": 1
    }
  ],
  "tables": [],
  "callouts": [
    {
      "type": "warning",
      "title": "Warning",
      "content": "ImportantThe address entered in this field must match the address of the landing page where the HTML code was integrated.",
      "html": "<div class=\"theme-admonition theme-admonition-caution alert alert--warning admonition_WoCw\"><div class=\"admonitionHeading_TMsN\">Important</div><div class=\"admonitionContent_vXIg\"><p>The address entered in this field must match the address of the landing page where the HTML code was integrated.</p></div></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "Important",
      "html": "<div class=\"admonitionHeading_TMsN\">Important</div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "The address entered in this field must match the address of the landing page where the HTML code was integrated.",
      "html": "<div class=\"admonitionContent_vXIg\"><p>The address entered in this field must match the address of the landing page where the HTML code was integrated.</p></div>"
    },
    {
      "type": "note",
      "title": "Website domains",
      "content": "noteIn theWebsite domainsfield, specify all domains used to host the landing page. The domains must be separated with commas.",
      "html": "<div class=\"theme-admonition theme-admonition-note alert alert--secondary admonition_WoCw\"><div class=\"admonitionHeading_TMsN\">note</div><div class=\"admonitionContent_vXIg\"><p>In the <strong>Website domains</strong> field, specify all domains used to host the landing page. The domains must be separated with commas.</p></div></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "note",
      "html": "<div class=\"admonitionHeading_TMsN\">note</div>"
    },
    {
      "type": "note",
      "title": "Website domains",
      "content": "In theWebsite domainsfield, specify all domains used to host the landing page. The domains must be separated with commas.",
      "html": "<div class=\"admonitionContent_vXIg\"><p>In the <strong>Website domains</strong> field, specify all domains used to host the landing page. The domains must be separated with commas.</p></div>"
    },
    {
      "type": "warning",
      "title": "Warning",
      "content": "ImportantThe settings below are performed by the website administrator.",
      "html": "<div class=\"theme-admonition theme-admonition-caution alert alert--warning admonition_WoCw\"><div class=\"admonitionHeading_TMsN\">Important</div><div class=\"admonitionContent_vXIg\"><p>The settings below are performed by the website administrator.</p></div></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "Important",
      "html": "<div class=\"admonitionHeading_TMsN\">Important</div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "The settings below are performed by the website administrator.",
      "html": "<div class=\"admonitionContent_vXIg\"><p>The settings below are performed by the website administrator.</p></div>"
    },
    {
      "type": "note",
      "title": "Create contact",
      "content": "noteThe \"Searching and creating contact\" process starts only if theCreate contactcheckbox is selected for the landing page.",
      "html": "<div class=\"theme-admonition theme-admonition-note alert alert--secondary admonition_WoCw\"><div class=\"admonitionHeading_TMsN\">note</div><div class=\"admonitionContent_vXIg\"><p>The \"Searching and creating contact\" process starts only if the <strong>Create contact</strong> checkbox is selected for the landing page.</p></div></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "note",
      "html": "<div class=\"admonitionHeading_TMsN\">note</div>"
    },
    {
      "type": "note",
      "title": "Create contact",
      "content": "The \"Searching and creating contact\" process starts only if theCreate contactcheckbox is selected for the landing page.",
      "html": "<div class=\"admonitionContent_vXIg\"><p>The \"Searching and creating contact\" process starts only if the <strong>Create contact</strong> checkbox is selected for the landing page.</p></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "noteIf a user clears the browser cookies before filling out the landing page web form, the history of his transitions will be removed and will not appear in Creatio.",
      "html": "<div class=\"theme-admonition theme-admonition-note alert alert--secondary admonition_WoCw\"><div class=\"admonitionHeading_TMsN\">note</div><div class=\"admonitionContent_vXIg\"><p>If a user clears the browser cookies before filling out the landing page web form, the history of his transitions will be removed and will not appear in Creatio.</p></div></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "note",
      "html": "<div class=\"admonitionHeading_TMsN\">note</div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "If a user clears the browser cookies before filling out the landing page web form, the history of his transitions will be removed and will not appear in Creatio.",
      "html": "<div class=\"admonitionContent_vXIg\"><p>If a user clears the browser cookies before filling out the landing page web form, the history of his transitions will be removed and will not appear in Creatio.</p></div>"
    },
    {
      "type": "warning",
      "title": "Warning",
      "content": "ImportantThe settings below are performed by the website administrator.",
      "html": "<div class=\"theme-admonition theme-admonition-caution alert alert--warning admonition_WoCw\"><div class=\"admonitionHeading_TMsN\">Important</div><div class=\"admonitionContent_vXIg\"><p>The settings below are performed by the website administrator.</p></div></div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "Important",
      "html": "<div class=\"admonitionHeading_TMsN\">Important</div>"
    },
    {
      "type": "note",
      "title": "Note",
      "content": "The settings below are performed by the website administrator.",
      "html": "<div class=\"admonitionContent_vXIg\"><p>The settings below are performed by the website administrator.</p></div>"
    }
  ],
  "images": [],
  "videos": [],
  "downloadables": [],
  "headings": [
    {
      "level": 1,
      "text": "Landing page setup FAQ",
      "anchor": ""
    },
    {
      "level": 2,
      "text": "What is the purpose of theLanding pages and web formssection in Creatio?​",
      "anchor": "title-2632-1"
    },
    {
      "level": 2,
      "text": "What are the difference between a landing page on the website and a Creatio landing page record?​",
      "anchor": "title-2632-2"
    },
    {
      "level": 2,
      "text": "What does the landing page code do?​",
      "anchor": "title-2632-3"
    },
    {
      "level": 2,
      "text": "How do I use theWebsite domainsfield?​",
      "anchor": "title-2632-4"
    },
    {
      "level": 2,
      "text": "How do I use theRedirection URLfield?​",
      "anchor": "title-2632-5"
    },
    {
      "level": 2,
      "text": "How do you set up one landing page record for a page with several web forms?​",
      "anchor": "title-2632-6"
    },
    {
      "level": 2,
      "text": "How do I set up a single landing for several pages?​",
      "anchor": "title-2632-7"
    },
    {
      "level": 2,
      "text": "Why will Creatio not register leads despite the properly customized landing page?​",
      "anchor": "title-2632-8"
    },
    {
      "level": 2,
      "text": "How to set up the population of fields with default values for leads registered via a landing page?​",
      "anchor": "title-2632-9"
    },
    {
      "level": 2,
      "text": "How does Creatio search for contact duplicates while creating leads from landing pages?​",
      "anchor": "title-2632-10"
    },
    {
      "level": 2,
      "text": "How do I set up the correct population of lead creation time?​",
      "anchor": "title-2632-11"
    },
    {
      "level": 2,
      "text": "Can I configure the website event tracking for manually registered leads?​",
      "anchor": "title-2632-12"
    },
    {
      "level": 2,
      "text": "How do I configure data transfer from one landing page web form to separate lead page fields?​",
      "anchor": "title-2632-13"
    },
    {
      "level": 2,
      "text": "See also​",
      "anchor": "see-also"
    }
  ],
  "api_docs": {
    "endpoints": [
      {
        "method": "CREATELEADFROMLANDING",
        "path": "("
      },
      {
        "method": "CREATELEADFROMLANDING",
        "path": "("
      }
    ],
    "parameters": [],
    "responses": [],
    "examples": []
  },
  "sidebar_items": [
    {
      "href": "/docs/8.x/",
      "text": "Guides",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/landing-pages-and-web-forms/landing-page-setup-faq",
      "text": "FAQ",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/overview/platform-overview",
      "text": "latest version",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.2/overview/platform-overview",
      "text": "8.2",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.1/overview/platform-overview",
      "text": "8.1",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/platform-basics",
      "text": "Platform basics",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/classic-ui",
      "text": "Classic UI",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/freedom-ui",
      "text": "Freedom UI",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/business-data",
      "text": "Business data",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/communications",
      "text": "Communications",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/mobile-app",
      "text": "Mobile app",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/running-business-processes",
      "text": "Running business processes",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/crm-tools",
      "text": "CRM tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/activities",
      "text": "Activities",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/activities/create-activity",
      "text": "Create an activity",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/activities/work-with-calendar",
      "text": "Calendar",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/activities/manage-group-activities",
      "text": "Manage group activities",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/accounts-and-contacts",
      "text": "Accounts and contacts",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/accounts-and-contacts/create-contact",
      "text": "Create a contact",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/accounts-and-contacts/create-account",
      "text": "Create an account",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/accounts-and-contacts/add-relationships-between-accounts-and-contacts",
      "text": "Relationships between contacts and accounts",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/accounts-and-contacts/calculate-contact-age",
      "text": "Calculate contact age",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/accounts-and-contacts/calculate-profile-completion",
      "text": "Profile completion",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/communication-options-and-addresses",
      "text": "Communication options and addresses",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/accounts-and-contacts/manage-job-experience",
      "text": "Job experience",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/accounts-and-contacts/enrich-contact-data",
      "text": "Enrich contact data",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/accounts-and-contacts/enrich-account-data",
      "text": "Enrich account data",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/knowledge-base",
      "text": "Knowledge base",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/knowledge-base/add-knowledge-base-articles",
      "text": "Create an article",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/knowledge-base/set-up-case-playbook-hints",
      "text": "Playbook",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/landing-pages-and-web-forms",
      "text": "Landing pages and web forms",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/landing-pages-and-web-forms/setup-landing-general-information",
      "text": "Overview",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/landing-pages-and-web-forms/landingi-integration",
      "text": "Landingi service integration",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/web-to-object-integration",
      "text": "Web-to-object integration",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/landing-pages-and-web-forms/web-to-object/create_landing_page_on_your_website",
      "text": "Web-page landing recommendations",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/landing-pages-and-web-forms/web-to-object/connect_your_website_landing_page_to_Creatio",
      "text": "Connect a landing to Creatio",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/landing-pages-and-web-forms/web-to-object/set_up_autofill_for_lead_page_fields",
      "text": "Autofill of Creatio fields",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/landing-pages-and-web-forms/web-to-object/landing_page_autofill",
      "text": "Autofill of web form fields",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/landing-pages-and-web-forms/web-to-object/identify_contacts_that_submit_web_forms",
      "text": "Identify contacts in forms",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/landing-pages-and-web-forms/set-up-lead-registration-from-socials",
      "text": "PreviousFacebook lead generation",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/employees",
      "text": "NextEmployees",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/employees/create-new-employee",
      "text": "Create an employee",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/employees/keep-record-of-employe-career",
      "text": "Employee's career",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/employees/keep-track-of-former-employees",
      "text": "Former employees",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/crm-tools/employees/configure-employees-section",
      "text": "Configure the section",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/marketing-tools",
      "text": "Marketing tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/leads",
      "text": "Leads",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/email-marketing",
      "text": "Email marketing",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/marketing-campaigns",
      "text": "Marketing campaigns",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/website-tracking",
      "text": "Website tracking",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/marketing-tools/plan-marketing-budget",
      "text": "Marketing plans",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/marketing-events",
      "text": "Marketing events",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/digital-ads",
      "text": "Digital Ads",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/sales-tools",
      "text": "Sales tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/long-sales",
      "text": "Long sales",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/short-sales-orders-and-invoices",
      "text": "Short sales, orders, and invoices",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/field-sales",
      "text": "Field sales",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/сhannel-sales",
      "text": "Сhannel sales",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/forecasting",
      "text": "Forecasting",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/products-and-prices",
      "text": "Products and prices",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/document-flow",
      "text": "Document flow",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/projects",
      "text": "Projects",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/service-tools",
      "text": "Service tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/service-cases",
      "text": "Service cases",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/contact-center-tools",
      "text": "Contact center tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/itsm-tools",
      "text": "ITSM tools",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/more-apps",
      "text": "More apps",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/field-sales-1",
      "text": "Field sales",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/field-management",
      "text": "Field Management",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/pharma",
      "text": "Pharma",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/portal",
      "text": "Portal",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/finance-and-banking",
      "text": "Finance and banking",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/finance-and-banking/financial-services-creatio-overview",
      "text": "Financial Services Creatio Overview",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/financial-products",
      "text": "Financial products",
      "active": false
    },
    {
      "href": "/docs/8.x/creatio-apps/8.0/category/financial-services",
      "text": "Financial services",
      "active": false
    }
  ],
  "related_links": [],
  "version": "8.x",
  "crawled_at": "2026-01-15T06:43:23.510286"
}